[
{"title": "The Man Behind the Antlers", "content": "<p>Haven’t we all wondered about RadioactiveCaribou..er, NuclearMoose at some point or other?  He’s all over the forums, he’s just done an incredible job with a preliminary <a href=\"https://wiki.wordpress.org/index.php/Table%20Of%20Contents\">table of contents</a> for the wiki, and he’s created most of the great WordPress holiday logos seen in the header (among many other things).  I mean, who IS this guy?  And where does he find the time?</p>\n<p>Well, a couple of weeks ago I set out to find the ‘real’ NuclearMoose.  I emailed him a few questions, to which he promptly responded.</p>\n<p>Here then, is Craig Hartel, otherwise known as NuclearMoose…kind of live and completely uncensored!<br>\n<span id=\"more-94\"></span><br>\n<strong>Tell us a little about yourself.</strong></p>\n<p>I was born in Moose Jaw, Saskatchewan, which should not come as a surprise.  I moved to the wilds of central British Columbia when I was a brat, and grew up there. Uh, that is to say, I got older there. 😀  I now make my home in north-east BC, in a small city called Dawson Creek. No, it is NOTHING like the TV show. I am a GIS technician by trade, working for the BC Forest Service.</p>\n<p>I have two sons, aged 13 and 8, and a black Labrador Retriever named Ruby. I have never been to Spain, but I have been to Humptulips, Washington. The stupidest thing I have ever done is cut my head open with a hunting knife which required stitches to close. If you ask me how I did it, I would tell you that I was defending myself from an attacking bear, but I would be lying. Actually, I was trying to kill a house fly but cutting it in half while it was perched on a shelf…I missed the fly, and stabbed myself in the head. [<em>ed note: read the whole story <a href=\"http://blog.nuclearmoose.com/archives/2004/03/24/stupid-is-as-stupid-does/\">here</a></em>]. The smartest thing I ever did was have my two sons. While being a single Dad with two growing boys is a challenge, it is the best part of my life.</p>\n<p>I have been using computers since CPM 86 was the OS of choice, and I remember the first time I upgraded to MS-DOS and the computer doubled in speed! Yep, an application only took two minutes to load instead of four! 😀</p>\n<p>Computers are my hobby, and I have, in the past couple of years, started to try to figure out a way to support myself online rather than doing the 9-5 nonsense. Alas, it eludes me…</p>\n<p><strong>When did you first start using WP?  What was your prior experience with  blogging/blogware? </strong></p>\n<p>I lost my bloginity to Blogger in October of 2003. I’ve always wanted to set up and manage my own site, but never got around to it. Blogger had only recently been bought out by Google, so the support and development of Blogger had basically come to a halt. I got up and running quickly with Blogger, but the template system really sucked. I wanted more control, and more features. So, I started to look for others. I was actually a Beta-tester of TypePad, the gee-whiz post a site in no time child of the MovableType family. I liked it a lot, but again, I didn’t want to have a push-button solution. I wanted to learn more. Plus I didn’t want to pay the prices for the service. From there, I picked up on Greymatter, installed it, freaked out over the complexity of it and then decided to drop it as well.</p>\n<p>One day, purely by luck, I was Googling, trying to find a publishing tool more to my liking. I came across WordPress, and SCHWING! I was hooked. I turfed my old web host, signed up with a new one, and had WP up and running in November of 2003 in one night. I was amazed at how easy it was to install, and I liked the support forum for the friendly people that were there. I will never look at another publishing program again. WP is my baby, now. I hope to learn more PHP, more DB stuff, and more CSS along the way.</p>\n<p><strong>How’d you first start designing the holiday header graphics for the wp.org site?</strong></p>\n<p>I love doing graphics. I bought Macromedia Studio MX a couple of years ago, and through my subscription to CommunityMX.com, I learned a great deal about web graphics. I’m a frustrated artist. I can’t draw a conclusion, let alone a nice 3D sphere, but Fireworks allows me to do this and a lot more. It’s not the same tool as Photoshop…it is made specifically for web graphics.</p>\n<p>Anyway, I love the tools, and one night I was looking for something to do. I quiet frankly ripped off, uh, I mean, was inspired by Google and how they do fun things with their logo, so I decided to try a few out. I shipped a few of them off to Matt, and he liked them and started to use them. In all, I’ve sent probably a dozen or more to him. I don’t know if we will see all of them or not, but I will continue to do them for my own interest and enjoyment. I hope that the community enjoys them too!</p>\n<p><strong>You’re a coleader of the docs team. What are your future plans for docs?  Are there other WP projects you’d like to work on?</strong></p>\n<p>Well, the WP Documentation project has been a real challenge. I think that the adoption of the Wiki has been a very positive thing for WordPress. Now we need to organise and document it better, so information is easy to find, and we need to promote it better on the support forums. As well, I am starting to work on tutorials for the WordPress site as well. That is to say that I am gathering them together from many sources, and I will be making them XHTML and CSS valid, and Matt will integrate them into the site. This is currently a work in progress, and I have already received some great help from Southern-Gal to start with. Thanks, Sara! You’re a doll!<br>\nI work with a great group of people on the documentation team, and I appreciate you all.</p>\n<p><strong>What are some benefits of using WP, in your opinion?</strong></p>\n<p>The strength of WP is in its design. Standards-compliance is not an easy task, but it makes things a lot easier to integrate and to work with the tools available. It allows the many talented WP community members to contribute their own ideas and solutions to meet the sophisticated demands of the WP users. Not only that, WP right out of the box is easy enough for someone with a modest level of computer knowledge to set up and use. It’s a great way to learn some valuable skills, and you get to meet a lot of fun people along the way. That and when I tell all the Moose-groupies that I’m into WP, they swoon over me like Winnie the Pooh drooling over a pot of honey.</p>\n<p><strong>What’s been the best part of the WP experience for you?</strong></p>\n<p>Being welcomed into the community and allowed to be an active participant in the development of WP has been great. I’ve made new friends, learned new things, and I get to have a tool set to publish all of my drivel whenever I so desire. What can be better than that?</p>\n<p><strong>Is that an antler in your pocket, or are you just happy to see me?  </strong></p>\n<p>Why don’t you look in my pocket and see for yourself? 😀 Hehe. Actually, as far as moose go, I am a very polite moose. I don’t get mad often, but I will try to trample the occasional troll. I’m here to have fun. If my blog works and looks okay, great, I’m satisfied. Getting to meet lots of cool people like you, Cena, is just a great side-benefit.</p>\n<hr>\n<p>Thank you, Craig,  for your amusing and enlightening responses. (<em>Humptulip?</em>)</p>\n<p>If there’s another member of the WordPress community you’d like to see interviewed (including yourself), feel free to email me with suggestions and comments.</p>"},
{"title": "People of WordPress: Alice Orru", "content": "<p><em>You’ve probably heard that WordPress is open-source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>Meet Alice Orru, from Sardinia, Italy.</strong></h2>\n\n\n\n<p>Alice Orru was born in Sardinia, an island in the middle of the Mediterranean Sea. As a child, she dreamt of becoming a flight attendant, traveling the world, and speaking many foreign languages.</p>\n\n\n\n<p>Unable to meet the height requirements of her chosen profession, Orru ended up choosing a different path in life, following the Italian mantra: “You have to study something that will guarantee a stable and secure job for life.”</p>\n\n\n\n<p>The unemployment rate in Sardinia is very high, a challenge shared throughout the surrounding islands. In addition to that, Alice wasn’t that keen on having the same job all her life, as her parents had.</p>\n\n\n\n<p>When Orru was 22 she moved to Siena, Tuscany, to finish her studies. That is when she created her first personal blog. The website was built on an Italian platform named Tiscali, which she later migrated to WordPress.com.</p>\n\n\n\n<p>After 2 years in Tuscany Orru moved to Strasbourg, France. She studied French and worked several jobs while living there. Her first serious job was in Milan – working 40 hours/week in the marketing department of a large, international company. She found herself surrounded by ambitious colleagues and a boss who constantly requested extra —unpaid— working hours per day.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1920\" height=\"1280\" src=\"https://i0.wp.com/wordpress.org/news/files/2019/10/IMG_2672.jpg?fit=632%2C422&amp;ssl=1\" alt=\"Alice Orru\" class=\"wp-image-7291\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2019/10/IMG_2672.jpg?w=1920&amp;ssl=1 1920w, https://i1.wp.com/wordpress.org/news/files/2019/10/IMG_2672.jpg?resize=300%2C200&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2019/10/IMG_2672.jpg?resize=1024%2C683&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2019/10/IMG_2672.jpg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2019/10/IMG_2672.jpg?resize=1536%2C1024&amp;ssl=1 1536w, https://i1.wp.com/wordpress.org/news/files/2019/10/IMG_2672.jpg?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>Alice Orru</figcaption></figure>\n\n\n\n<h2>Choices, choices, choices…</h2>\n\n\n\n<p>Alice gave up blogging because she wasn’t feeling inspired enough to write. She questioned whether she really wanted to do that job forever; working 10 hours per day under the neon lights of an office. It forced her to set aside her dreams for the time being, and for a while, she mainly lived for the weekends.</p>\n\n\n\n<p>Alice decided to leave the job and moved to Barcelona, Spain, all by herself, in 2012.</p>\n\n\n\n<p>After a few months of intense Spanish learning at the university, she found a job in an international clinic as a “Patient Coordinator.” Orru assisted international patients coming to Barcelona for their treatments. She acted as their translator, interpreter and administrative consultant. </p>\n\n\n\n<p>Patients came from Italy, France, England, Morocco, Senegal, and several other countries. Alice was so inspired by some of their stories, that she started to write again: She dusted off her WordPress blog and filled it with stories about her new life in Barcelona and some of the women she met at the clinic. “I was feeling stronger and more independent than ever,” Orru expressed.</p>\n\n\n\n<h2>Technical issues led to unexpected opportunities</h2>\n\n\n\n<p>In the summer of 2015, Alice was writing on her blog and got stuck with a technical problem. While she was searching through the WordPress.com documentation, she saw a pop-up in the bottom right corner of her screen. It was a staff member of Automattic, checking if she needed help. They chatted for a few minutes and the problem was solved. Alice left the chat with one question, though: how did that person on chat find a support job with WordPress?</p>\n\n\n\n<p>Alice found the official WordPress job page: <a href=\"http://jobs.wordpress.net/\"><strong>jobs.wordpress.net</strong></a> and noticed a job offer that caught her attention: WP Media, a French startup, was looking for a polyglot and remote customer service teammate for one of their plugins, WP Rocket. She read their requirements: fluency in English, French and possibly other languages, excellent experience with WordPress, and some coding skills.</p>\n\n\n\n<p>She knew she didn’t meet all the requirements, but could speak 4 languages, and she had a WordPress blog. She didn’t know anything about PHP, though. Orru had been a WordPress.com user for years and knew she was ready to learn more.</p>\n\n\n\n<p>Orru wrote a cover letter and sent her CV. A Skype interview was conducted and several days later she received the news that she had gotten the job! </p>\n\n\n\n<h2><strong>A steep learning curve</strong></h2>\n\n\n\n<p>The early days in her new job were intense. Alice felt inexperienced but was supported by her teammates. She started studying and reading everything about WordPress for beginners. Initially, she answered easy tickets from customers. All the while her teammates were sending useful material to read, setting up video-calls for 1 to 1 training, and encouraging her the entire time.</p>\n\n\n\n<p>Soon, Orru was replying to customers whose first language was either Spanish or Italian in their native language. This was much appreciated and resulted in several happy comments. Until that moment the plugin’s support had been offered only in English and French.</p>\n\n\n\n<h2><strong>Finding her way in the WordPress community</strong></h2>\n\n\n\n<p>At WordCamp Paris 2016, one of Alice’s teammates introduced her to how the WordPress community collaborated and kept in contact through Slack.</p>\n\n\n\n<p>“You speak multiple languages, why don’t you try to contribute to the polyglots team?” he asked.</p>\n\n\n\n<p>Alice knew very little about contributing to WordPress. She had only been working for WP Media for 6 months and didn’t feel ready to dive into a new challenge and start also contributing to WordPress.</p>\n\n\n\n<p>Yet, curiosity led her to join both the local Italian and the global WordPress Community on Slack. For the first few months, she mainly observed what was happening the channels. Then, she attended WordCamp Milan and met some members of the Italian Polyglots team.</p>\n\n\n\n<p>It was love at first string! Laura, one of the <a href=\"https://make.wordpress.org/polyglots/teams/?locale=it_IT\"><strong>General Translation Editors</strong></a> (GTE) for Italy, taught her how to start contributing and translating, following the polyglots guidelines. She also told her about the Italian community’s big efforts to work together, consistently, to boost and grow WordPress related events in Italy.</p>\n\n\n\n<p>With her teammates’ encouragement, Orru applied to WordCamps as a speaker and gave her first talk in December 2016 at WordCamp Barcelona. After that, she both spoke at WordCamp Torino on April 2017 and at WordCamp Europe in 2017.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1280\" height=\"720\" src=\"https://i2.wp.com/wordpress.org/news/files/2019/10/aliceorru-wordcamp-europe.jpg?fit=632%2C356&amp;ssl=1\" alt=\"\" class=\"wp-image-7292\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2019/10/aliceorru-wordcamp-europe.jpg?w=1280&amp;ssl=1 1280w, https://i0.wp.com/wordpress.org/news/files/2019/10/aliceorru-wordcamp-europe.jpg?resize=300%2C169&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2019/10/aliceorru-wordcamp-europe.jpg?resize=1024%2C576&amp;ssl=1 1024w, https://i0.wp.com/wordpress.org/news/files/2019/10/aliceorru-wordcamp-europe.jpg?resize=768%2C432&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>Alice Orru speaking at WordCamp Europe, in Paris, in 2017</figcaption></figure>\n\n\n\n<h2><strong>Dreams evolve, all the time!</strong></h2>\n\n\n\n<p>Orru knows that her experiences are not just due to luck. She used her previous skills and passions and adapted them to a new career and life path.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“We all have some skills; and if we don’t know which they are exactly, we should take some time to make a list of the things we’re really good at. With that in mind, just try. Apply. Get involved. Don’t get stuck in the feeling of ‘I can’t do it because I don’t know enough’. So that’s what I did. Without even realizing it, I started putting into reality the dream of the little girl who was born on an island and wanted to travel and speak different languages.WordPress made this possible.  I’m now part of a big community, and I am proud of it.”</p><cite>Alice Orru</cite></blockquote>\n\n\n\n<hr class=\"wp-block-separator\">\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img loading=\"lazy\" src=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=109%2C82&amp;ssl=1\" alt=\"\" class=\"wp-image-7025\" width=\"109\" height=\"82\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?w=1024&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=768%2C576&amp;ssl=1 768w\" sizes=\"(max-width: 109px) 100vw, 109px\" data-recalc-dims=\"1\"></figure></div>\n\n\n\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<p><em>This post is based on an article originally published on HeroPress.com, a community initiative created by <a href=\"https://profiles.wordpress.org/topher1kenobe/\">Topher DeRosia</a>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n</div></div>\n\n\n\n<p><em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em></p>"},
{"title": "People of WordPress: Amanda Rush", "content": "<p><em>You’ve probably heard that WordPress is open source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>Meet Amanda Rush from Augusta, Georgia, USA.</strong></h2>\n\n\n\n<p>Amanda Rush is a WordPress advocate with a visual disability. She first started using computers in 1985, which enabled her to turn in homework to her sighted teachers. Screen reader technology for Windows was in its infancy then, so she worked in DOS almost exclusively.</p>\n\n\n\n<p>After graduating high school, Amanda went to college to study computer science, programming with DOS-based tools since compilers for Windows were still inaccessible. As part of her computer science course of study, she learned HTML which began her career in web development.</p>\n\n\n\n<h2>How Amanda got started with WordPress</h2>\n\n\n\n<p>Amanda began maintaining a personal website, and eventually began publishing her own content using LiveJournal. However, controlling the way the page around her content looked was hard, and she soon outgrew the hosted solution.</p>\n\n\n\n<p>So in 2005, Amanda bought customerservant.com, set up a very simple CMS for blogging, and started publishing there. She accepted the lack of design and content, and lack of easy customization because she wasn’t willing to code her own solution. Nor did she want to move to another hosted solution, as she liked being able to customize her own site, as well as publish content.</p>\n\n\n\n<h3><strong>Hebrew dates led her to WordPress</strong></h3>\n\n\n\n<p>At some point, Amanda was looking for an easy way to display the Hebrew dates alongside the Gregorian dates on her blog entries. Unfortunately, the blogging software she was using at the time, did not offer customization options at that level. She decided to research alternative solutions and came across a WordPress plugin that did just that. </p>\n\n\n\n<p>The fact that WordPress would not keep her locked into a visual editor, used themes to customize styling, and offered ways to mark up content, immediately appealed to Amanda. She decided to give it a go.</p>\n\n\n\n<h3><strong>Accessibility caused her to dive deeper</strong></h3>\n\n\n\n<p>When the software Amanda used at work became completely inaccessible, she started learning about WordPress. While she was learning about this new software, <a href=\"https://en.wikipedia.org/wiki/Web_2.0\">Web 2.0</a> was introduced. The lack of support for it in the screen reader she used meant that WordPress administration was completely inaccessible. To get anything done, Amanda needed to learn to find her way in WordPress’ file structure.</p>\n\n\n\n<p>Eventually Amanda started working as an independent contractor for the largest screen reader developer in the market, Freedom Scientific. She worked from home every day and hacked on WordPress after hours.</p>\n\n\n\n<p>Unfortunately Amanda hit a rough patch when her job at Freedom Scientific ended. Using her savings she undertook further studies for various Cisco and Red Hat certifications, only to discover that the required testing for these certifications were completely inaccessible. She could study all she wanted, but wasn’t able to receive grades to pass the courses.</p>\n\n\n\n<p>She lost her financial aid, her health took a turn for the worse, she was diagnosed with Lupus, and lost her apartment. Amanda relocated to Augusta where she had supportive friends who offered her a couch and a roof over her head.</p>\n\n\n\n<h3><strong>But Amanda refused to give up</strong></h3>\n\n\n\n<p>Amanda continued to hack WordPress through all of this. It was the only stable part of her life. She wanted to help make WordPress accessible for people with disabilities, and in 2012 joined the  WordPress Accessibility Team. Shortly after that, she finally got her own place to live, and started thinking about what she was going to do with the rest of her working life.</p>\n\n\n\n<p>Listening to podcasts led her to take part in <a href=\"http://wordsesh.org/\">WordSesh</a>, which was delivered completely online and enabled Amanda to participate without needing to travel. She began to interact with WordPress people on Twitter, and continued to contribute to the community as part of the WordPress Accessibility Team. Things had finally started to pick up.</p>\n\n\n\n<h2><strong>Starting her own business</strong></h2>\n\n\n\n<p>In 2014, Amanda officially launched her own business, <a href=\"http://www.customerservant.com/\">Customer Servant Consultancy</a>. Since WordPress is open source, and becoming increasingly accessible, Amanda could modify WordPress to build whatever she wanted and not be at the mercy of web and application developers who know nothing about accessibility. And if she got stuck, she could tap into the community and its resources.</p>\n\n\n\n<p>Improving her circumstances and becoming more self-sufficient means Amanda was able to take back some control over her life in general. She was able to gain independence and create her own business despite being part of the blind community, which has an 80% unemployment rate. </p>\n\n\n\n<p>In her own words:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>We’re still fighting discrimination in the workplace, and we’re still fighting for equal access when it comes to the technology we use to do our jobs. But the beauty of WordPress and its community is that we can create opportunities for ourselves.</em></p><p><em>I urge my fellow blind community members to join me inside this wonderful thing called WordPress. Because it will change your lives if you let it.</em></p><cite>Amanda Rush, entrepreneur</cite></blockquote>\n\n\n\n<hr class=\"wp-block-separator\">\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img loading=\"lazy\" src=\"https://i0.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo-1.jpg?fit=632%2C474&amp;ssl=1\" alt=\"\" class=\"wp-image-7026\" width=\"110\" height=\"83\"></figure></div>\n\n\n\n<p><em>This #ContributorStory post is based on an article originally published on HeroPress.com, a community initiative created by <a href=\"https://profiles.wordpress.org/topher1kenobe/\">Topher DeRosia</a>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p><em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em></p>"},
{"title": "People of WordPress: Abdullah Ramzan", "content": "<p><em>You’ve probably heard that WordPress is open-source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>Meet Abdullah Ramzan, from Lahore, Punjab, Pakistan.</strong></h2>\n\n\n\n<p>Abdullah Ramzan was born and brought up in the under-developed city of <a href=\"https://en.wikipedia.org/wiki/Layyah\"><strong>​Layyah​</strong></a>, which is situated in Southern Punjab, Pakistan and surrounded by desert and the river ​Sindh​.</p>\n\n\n\n<p>He graduated from college in his home town and started using a computer in ​2010​ when he joined <a href=\"https://gcuf.edu.pk/\"><strong>​Government College University Faisalabad​</strong></a>. Abdullah’s introduction to WordPress happened while he was finishing the last semester of his degree. His final project was based in WordPress.</p>\n\n\n\n<p>Ramzan’s late mother was the real hero in his life, helping him with his Kindergarten homework and seeing him off to school every day. </p>\n\n\n\n<p>Before her heart surgery, Ramzan visited her in the hospital ICU, where she hugged him and said: ​“<strong>Don’t worry, everything will be good</strong>.” Sadly, his mother died during her surgery. However, her influence on Ramzan’s life continues.</p>\n\n\n\n<h3><strong>Start of Ramzan’s Career:</strong></h3>\n\n\n\n<p>After graduation, Ramzan struggled to get his first job. He first joined PressTigers<strong>​</strong> as a Software Engineer and met Khawaja Fahad Shakeel<a href=\"https://twitter.com/FahadShakeel\"><strong>​</strong></a>, his first mentor. Shakeel provided Ramzan with endless support. Something had always felt missing in his life, but he felt like he was on the right track for the first time in his life when he joined the WordPress community. </p>\n\n\n\n<h3><strong>Community – WordCamps and Meetups:</strong></h3>\n\n\n\n<p>Although Ramzan had used WordPress since ​2015​, attending WordPress meetups and open source contributions turned out to be a game-changer for him. He learned a lot from the WordPress community and platform, and developed strong relationships with several individuals. One of them is <a href=\"https://twitter.com/jainnidhi03\"><strong>​</strong></a>Nidhi Jain​ from Udaipur India who he works with on WordPress development. The second is <a href=\"https://twitter.com/desrosj\"><strong>​</strong></a>Jonathan Desrosiers​ who he continues to learn a lot from.</p>\n\n\n\n<p>In addition, Usman Khalid<a href=\"https://twitter.com/Usman__Khalid\"><strong>​</strong></a>, the lead organizer of WC Karachi, mentored Ramzan, helping him to develop his community skills. </p>\n\n\n\n<p>With the mentorship of these contributors, Ramzan is confident supporting local WordPress groups and helped to organize ​WordCamp Karachi​, where he spoke for the first time at an international level event. He believes that WordPress has contributed much to his personal identity. </p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"632\" height=\"422\" src=\"https://i1.wp.com/wordpress.org/news/files/2019/09/AbdullahRamzan.jpeg?resize=632%2C422&amp;ssl=1\" alt=\"Abdullah Ramzan among a group of community members at WordCamp Karachi 2018\" class=\"wp-image-7088\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2019/09/AbdullahRamzan.jpeg?resize=1024%2C683&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2019/09/AbdullahRamzan.jpeg?resize=300%2C200&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2019/09/AbdullahRamzan.jpeg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2019/09/AbdullahRamzan.jpeg?w=2048&amp;ssl=1 2048w, https://i1.wp.com/wordpress.org/news/files/2019/09/AbdullahRamzan.jpeg?w=1264&amp;ssl=1 1264w, https://i1.wp.com/wordpress.org/news/files/2019/09/AbdullahRamzan.jpeg?w=1896&amp;ssl=1 1896w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"><figcaption>Abdullah Ramzan at WordCamp Karachi 2018</figcaption></figure>\n\n\n\n<h3><strong>WordPress and the Future:</strong></h3>\n\n\n\n<p>As a <a href=\"https://www.meetup.com/WordPress-Lahore/members/?op=leaders&amp;sort=name\"><strong>​co-organizer of WordPress Meetup Lahore,​</strong></a> he would love to involve more people in the community leadership team, to provide a platform for people to gather under one roof, to learn and share something with each other. </p>\n\n\n\n<p>But he has loftier ambitions. Impressed by <a href=\"https://walktowc.eu/\">Walk to WordCamp Europe</a>, Abdullah is seriously considering walking to WordCamp Asia. He also one day hopes for the opportunity to serve his country as a senator of Pakistan<a href=\"http://www.senate.gov.pk/\"><strong>​</strong></a> and intends to enter the next senate election.</p>\n\n\n\n<h3><strong>Words of Encouragement</strong></h3>\n\n\n\n<p>Abdullah Ramzan knows there is no shortcut to success. “You have to work hard to achieve your goals,” explained Ramzan. He still has much he wishes to accomplish and hopes to be remembered for his impact on the project.</p>\n\n\n\n<p>Abdullah believes WordPress can never die as long as people don’t stop innovating to meet new demands. The beauty of WordPress is that it is made for everyone.</p>\n\n\n\n<p>Ramzan encouraged, “If you seriously want to do something for yourself, do something for others first. Go for open source, you’ll surely learn how to code. You’ll learn how to work in a team. Join local meetups, meet with the folks: help them, learn from them, and share ideas.”</p>\n\n\n\n<hr class=\"wp-block-separator\">\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img loading=\"lazy\" src=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=109%2C82&amp;ssl=1\" alt=\"\" class=\"wp-image-7025\" width=\"109\" height=\"82\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?w=1024&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=768%2C576&amp;ssl=1 768w\" sizes=\"(max-width: 109px) 100vw, 109px\" data-recalc-dims=\"1\"></figure></div>\n\n\n\n<p><em>This #ContributorStory post is based on an article originally published on HeroPress.com, a community initiative created by <a href=\"https://profiles.wordpress.org/topher1kenobe/\">Topher DeRosia</a>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p><em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em></p>"},
{"title": "People of WordPress: Ugyen Dorji", "content": "<p><em>You’ve probably heard that WordPress is open source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>Meet Ugyen Dorji from Bhutan</strong></h2>\n\n\n\n<p>Ugyen lives in <a href=\"https://en.wikipedia.org/wiki/Bhutan\">Bhutan</a>, a landlocked country situated between two giant neighbors, India to the south and China to the north. He works for ServMask Inc and is responsible for the Quality Assurance process for All-in-One WP Migration plugin. <br><br>He believes in the Buddhist teaching that “the most valuable service is one rendered to our fellow humans,” and his contributions demonstrates this through his WordPress translation work and multi-lingual support projects for WordPress.</p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1728\" height=\"1296\" src=\"https://i2.wp.com/wordpress.org/news/files/2019/07/60340743_2330687777177099_8058690662683377664_o.jpg?fit=632%2C474&amp;ssl=1\" alt=\"\" class=\"wp-image-7023\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2019/07/60340743_2330687777177099_8058690662683377664_o.jpg?w=1728&amp;ssl=1 1728w, https://i1.wp.com/wordpress.org/news/files/2019/07/60340743_2330687777177099_8058690662683377664_o.jpg?resize=300%2C225&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2019/07/60340743_2330687777177099_8058690662683377664_o.jpg?resize=768%2C576&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2019/07/60340743_2330687777177099_8058690662683377664_o.jpg?resize=1024%2C768&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2019/07/60340743_2330687777177099_8058690662683377664_o.jpg?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>Bhutanese contributors to the Dzongkha locale on WordPress Translation Day</figcaption></figure>\n\n\n\n<h2><strong>How Ugyen started his career with WordPress</strong></h2>\n\n\n\n<p>Back in 2016, Ugyen was looking for a new job after his former cloud company ran into financial difficulties.</p>\n\n\n\n<p>During one interview he was asked many questions about WordPress and, although he had a basic understanding of WordPress, he struggled to give detailed answers. After that interview he resolved to develop his skills and learn as much about WordPress as he could. </p>\n\n\n\n<p>A few months passed and he received a call from ServMask Inc, who had developed a plugin called All-in-One WP Migration. They offered him a position, fulfilling his wish to work with WordPress full-time. And because of that, Ugyen is now an active contributor to the WordPress community.</p>\n\n\n\n<h3><strong>WordCamp Bangkok 2018</strong></h3>\n\n\n\n<p>WordCamp Bangkok 2018 was a turning point event for Ugyen. WordCamps are a great opportunity to meet WordPress community members you don’t otherwise get to know, and he was able to attend his first WordCamp through the sponsorship of his company.</p>\n\n\n\n<p>The first day of WordCamp Bangkok was a Contributor Day, where people volunteer to work together to contribute to the development of WordPress. Ugyen joined the Community team to have conversations with WordPress users from all over the world. He was able to share his ideas for supporting new speakers, events and organizers to help build the WordPress community in places where it is not yet booming.</p>\n\n\n\n<p>During the main day of the event, Ugyen managed a photo booth for speakers, organizers, and attendees to capture their memories of WordCamp. He also got to take some time out to attend several presentations during the conference. What particularly stuck in Ugyen’s mind was learning that having a website content plan has been shown to lead to 100% growth in business development.</p>\n\n\n\n<h3>Co-Organizing<strong> Thimphu</strong>‘s <strong>WordPress Meetup</strong></h3>\n\n\n\n<p>After attending WordCamp Bangkok 2018 as well as a local Meetup event, Ugyen decided to introduce WordPress to his home country and cities. </p>\n\n\n\n<p>As one of the WordPress Translation Day organizers, he realized that his local language, Dzongkha, was not as fully translated as other languages in the WordPress Core Translation. That is when Ugyen knew that he wanted to help build his local community. He organized Thimphu’s first WordPress Meetup to coincide with WordPress Translation Day 4, and it was a huge success!</p>\n\n\n\n<p>Like all WordPress Meetups, the Thimpu WordPress Meetup is an easygoing, volunteer-organized, non-profit meetup which covers everything related to WordPress. But it also keeps in mind the <a href=\"https://en.wikipedia.org/wiki/Gross_National_Happiness\">Bhutanese Gross National Happiness</a> four pillars by aiming to preserve and promote their unique culture and national language. </p>\n\n\n\n<h2><strong>Big dreams get accomplished one step at a time</strong></h2>\n\n\n\n<p>Ugyen has taken an active role in preserving his national language by encouraging his community to use WordPress, including Dzongkha bloggers, online Dzongkha news outlets, and government websites.</p>\n\n\n\n<p>And while Ugyen has only been actively involved in the community for a short period, he has contributed much to the WordPress community, including:</p>\n\n\n\n<ul><li>becoming a Translation Contributor for WordPress Core Translation for Dzongkha;</li><li>participating in the <a href=\"https://wptranslationday.org/\">Global WordPress Translation Day 4</a> Livestream and organizing team;</li><li>inviting WordPress Meetup Thimphu members and WordPress experts from other countries to join the <a href=\"https://wpbhutan.slack.com/\">local Slack instance</a>;</li><li>encouraging ServMask Inc. to become an event sponsor;</li><li>providing the Dzongkha Development Commission the opportunity to involve their language experts.</li></ul>\n\n\n\n<p>When it comes to WordPress, Ugyen particularly focuses on encouraging local and international language WordPress bloggers; helping startups succeed with WordPress; and sharing what he has learned from WordPress with his Bhutanese WordPress community.</p>\n\n\n\n<p>As a contributor, Ugyen hopes to accomplish even more for the Bhutan and Asian WordPress Communities. His dreams for his local community are big, including teaching more people about open source, hosting a local WordCamp, and helping to organize WordCamp Asia in 2020 — all while raising awareness of his community.</p>\n\n\n\n<hr class=\"wp-block-separator\">\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img loading=\"lazy\" src=\"https://i0.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo-1.jpg?fit=632%2C474&amp;ssl=1\" alt=\"\" class=\"wp-image-7026\" width=\"110\" height=\"83\"></figure></div>\n\n\n\n<p><em>This post is based on an article originally published on HeroPress.com, a community initiative created by <a href=\"https://profiles.wordpress.org/topher1kenobe/\">Topher DeRosia</a>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p><em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em></p>"},
{"title": "Matt and Ryan talk about 1.5", "content": "<p>Craig Hartel, aka <a href=\"http://blog.nuclearmoose.com/\">NuclearMoose</a> sits down with <a href=\"http://ma.tt/\">Matt</a> and <a href=\"http://boren.nu/\">Ryan</a>, and asks them a few question about WordPress 1.5, Life, and Everything in <a href=\"http://blog.nuclearmoose.com/archives/2005/01/27/the-inside-scoop/\">The Inside Scoop</a> – an interview of sorts.</p>\n<p>Matt talks about helping out with managing the project, while also keeping track of changes in one’s personal and professional lives, and also about why he’s excited about the forthcoming 1.5 release. Ryan, who has been busy with regularly fine-tuning WordPress and fixing bugs, talks about some of the more significant bug fixes and feature changes.</p>"},
{"title": "People of WordPress: Mary Job", "content": "<p><em>You’ve probably heard that WordPress is open-source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories. </em></p>\n\n\n\n<h2>How it all began</h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"844\" src=\"https://i1.wp.com/wordpress.org/news/files/2020/02/At-WordCamp-Kampala-2020.jpeg?resize=632%2C844&amp;ssl=1\" alt=\"Mary Job at WordCamp Kampala 2020\" class=\"wp-image-8410\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2020/02/At-WordCamp-Kampala-2020.jpeg?resize=767%2C1024&amp;ssl=1 767w, https://i1.wp.com/wordpress.org/news/files/2020/02/At-WordCamp-Kampala-2020.jpeg?resize=225%2C300&amp;ssl=1 225w, https://i1.wp.com/wordpress.org/news/files/2020/02/At-WordCamp-Kampala-2020.jpeg?resize=768%2C1025&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2020/02/At-WordCamp-Kampala-2020.jpeg?w=809&amp;ssl=1 809w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"><figcaption>Mary Job at WordCamp Kampala 2020</figcaption></figure>\n\n\n\n<p>Mary remembers when cybercafés started trending in Nigeria. She had just finished high school and was awaiting her results for admission to university. She spent all of her time (10 hours a day) and all of her pocket money buying bulk time online at cafes. All the way through university that was true, until in 2008 she graduated with a degree in philosophy and bought her own computer and modem.</p>\n\n\n\n<p>She started blogging in 2009. Initially, she tried out Blogger, Hubpages, and WordPress—but found WordPress too complicated. </p>\n\n\n\n<h2>Growing up as a timid but curious cat</h2>\n\n\n\n<p>Mary is one of four kids, and the only girl among her siblings. Throughout her childhood she felt shy, even though others didn’t always see her that way. </p>\n\n\n\n<p>When she first started her personal blog, it was mostly an opportunity for her to speak her mind where she was comfortable. Blogging gave her a medium to express her thoughts and with every new post she became a better writer.</p>\n\n\n\n<h2>Rediscovering WordPress</h2>\n\n\n\n<p>After completing a postgraduate diploma in mass communication, Mary started a Masters degree in Information Management. This required a three month internship. She decided to volunteer in Ghana in 2015 at the headquarters of the Salesians of Don Bosco in West Africa (SDBAFW<strong>)</strong> where her uncle was based.</p>\n\n\n\n<p>While she was there, her uncle asked Mary why she was not blogging on WordPress, which also happened to be the software the organisation used. She explained how difficult and complicated it was so he shared a group of beginner-level tutorial videos with her.</p>\n\n\n\n<p>After two weeks of watching those videos, she started to realize she could have a full-time career doing this. So she immediately joined a number of online training groups so she could learn everything.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>I saw a lot of people earning an income from things I knew and did for the fun of it. I found myself asking why I had not turned my passion into a business.</em></p><cite>Mary Job</cite></blockquote>\n\n\n\n<p>Not long after that, she was contacted by a website editor who was impressed by her blog. With the information available online for WordPress, she was able to learn everything she needed to improve and redesign a site for what turned into her first client.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"512\" height=\"288\" src=\"https://i1.wp.com/wordpress.org/news/files/2020/03/my-home-office-in-2016.jpeg?resize=512%2C288&amp;ssl=1\" alt=\"\" class=\"wp-image-8412\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2020/03/my-home-office-in-2016.jpeg?w=512&amp;ssl=1 512w, https://i1.wp.com/wordpress.org/news/files/2020/03/my-home-office-in-2016.jpeg?resize=300%2C169&amp;ssl=1 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" data-recalc-dims=\"1\"><figcaption>Mary’s home office in 2016</figcaption></figure>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>I visited the <a href=\"https://wordpress.org/showcase/\">WordPress.org showcase</a> and was wowed with all the good things I could do with WordPress.</em></p><cite>Mary Job</cite></blockquote>\n\n\n\n<p>In 2016 after a year of deep WordPress learning, she had fallen in love with the CMS and wanted to give back to the <a href=\"https://make.wordpress.org/\">WordPress open source project</a>. </p>\n\n\n\n<p>She volunteered to help the Community team. And when she moved to Lagos later that year, she discovered there was an active WordPress Meetup community. This started her journey toward becoming a WordPress Meetup Co-organizer and a Global Community Team Deputy.</p>\n\n\n\n<p>Today the Nigerian WordPress community continues to grow, as has the <a href=\"https://www.meetup.com/Lagos-WordPress-Meetup-Group\">Lagos WordPress Meetup</a> group. The first Nigerian WordCamp took place in Lagos in 2018 and a <a href=\"https://2020.lagos.wordcamp.org/\">2020 event is being planned</a>. A local WordPress community also developed in Mary’s hometown in Ijebu.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>I have made great friends and met co-organizers in the community who are dedicated to building and sharing their WordPress knowledge with the community like I am.</em></p><cite>Mary Job</cite></blockquote>\n\n\n\n<h2>What did Mary gain from using and contributing to WordPress?</h2>\n\n\n\n<ul><li>She <strong>overcame her stage fright</strong> by getting up in front of an audience at her local Meetup to introduce speakers and to talk about the WordPress community. </li><li>She <strong>attended her first of many African WordCamps </strong>in Cape Town, South Africa. Coincidentally this was also her first time outside West Africa. Before that, she had not been in an aircraft for more than one hour.</li><li>She <strong>earned money</strong> from WordPress web design projects to sustain her during her learning period. Mary continues to use WordPress in her work and says she is still learning every day!</li><li>She got to <strong>jump off</strong> Signal Hill in Cape Town when visiting a WordCamp! </li></ul>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1683\" height=\"1122\" src=\"https://i1.wp.com/wordpress.org/news/files/2020/03/Moderating-a-Panel-at-WCLOS2019.jpg?fit=632%2C422&amp;ssl=1\" alt=\"\" class=\"wp-image-8413\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2020/03/Moderating-a-Panel-at-WCLOS2019.jpg?w=1683&amp;ssl=1 1683w, https://i1.wp.com/wordpress.org/news/files/2020/03/Moderating-a-Panel-at-WCLOS2019.jpg?resize=300%2C200&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2020/03/Moderating-a-Panel-at-WCLOS2019.jpg?resize=1024%2C683&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2020/03/Moderating-a-Panel-at-WCLOS2019.jpg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2020/03/Moderating-a-Panel-at-WCLOS2019.jpg?resize=1536%2C1024&amp;ssl=1 1536w, https://i1.wp.com/wordpress.org/news/files/2020/03/Moderating-a-Panel-at-WCLOS2019.jpg?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>Mary moderating a panel at WordCamp Lagos in 2019</figcaption></figure>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Essentially, the community has taught me to be a better communicator, and a better person. I’ve made friends across the world that have become like a family to me.</em></p><cite>Mary Job</cite></blockquote>\n\n\n\n<p>She now runs a village hub in Ijebu,  where she teaches girls digital skills and WordPress as a way of giving back to her town.</p>\n\n\n\n<p>Since she started on this journey, Mary has gotten a fulltime job supporting a WordPress plugin. She’s also become a Community Team Rep and continues to build and foster communities.</p>\n\n\n\n<h2>Mary’s advice to others</h2>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Always seek to understand the basics of whatever knowledge you seek. Never jump in too fast, wanting to spiral to the top while ignoring the learning curve. You will likely crash down effortlessly if you do so, and would have learned nothing.</em></p><cite>Mary Job</cite></blockquote>\n\n\n\n<h2>Contributors</h2>\n\n\n\n<p>Thanks to Alison Rothwell (<a href=\"https://profiles.wordpress.org/wpfiddlybits/\">@wpfiddlybits</a>), Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\">@yvettesonneveld</a>), Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\">@webcommsat</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>), Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\">@topher1kenobe</a>). Thank you to Mary Job (<a href=\"https://profiles.wordpress.org/mariaojob/\">@maryojob</a>) for sharing her #ContributorStory.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft size-large\"><img loading=\"lazy\" width=\"180\" height=\"135\" src=\"https://i1.wp.com/wordpress.org/news/files/2020/03/heropress_logo_180.png?resize=180%2C135&amp;ssl=1\" alt=\"\" class=\"wp-image-8409\" data-recalc-dims=\"1\"></figure></div>\n\n\n\n<p><em>This post is based on </em><a href=\"https://heropress.com/essays/wordpress-gave-perfect-identity/\"><em>an article originally published on HeroPress.com</em></a><em>, a community initiative created by </em><a href=\"https://profiles.wordpress.org/topher1kenobe/\"><em>Topher DeRosia</em></a><em>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p><em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em></p>"},
{"title": "People of WordPress: Thelma Mutete", "content": "<p><em>WordPress is open source software, maintained by a global network of contributors. There are many examples of how WordPress has changed people’s lives for the better. In this monthly series, we share some of those lesser-known, amazing stories.</em></p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" src=\"https://i1.wp.com/wordpress.org/news/files/2021/01/Thelma-Mutete.jpg?resize=500%2C750&amp;ssl=1\" alt=\"Thelma Mutete at a WordCamp\" class=\"wp-image-9564\" width=\"500\" height=\"750\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2021/01/Thelma-Mutete.jpg?w=667&amp;ssl=1 667w, https://i1.wp.com/wordpress.org/news/files/2021/01/Thelma-Mutete.jpg?resize=200%2C300&amp;ssl=1 200w\" sizes=\"(max-width: 500px) 100vw, 500px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>From a young age Thelma was encouraged by her father to ‘work hard, and dream big’. In High School, she pursued a career in Computer Science. She said: “I did not know what I would be doing or how I would get there but I just knew that I was going to pursue a career in information technology.”</p>\n\n\n\n<p>She wrote her first line of code at the age of 16 living in Zimbabwe, Africa. This was to mark the beginning of her enthusiasm for computer programming.</p>\n\n\n\n<p>When she joined the school’s computer class, Thelma thought she would learn Excel and Word. Instead, the assignment was to write her first program in C. She said: “It was not easy, but it was very exciting. l remember writing up simple code for a Video Club – a check-in/out for VHS tapes and CDs. Thus began my fascination with computers.”</p>\n\n\n\n<p>Seven years later, she went on to university to study for a Bachelors in Business Management and Information Technology. Her third year internship was at a local web design and hosting company. Though she had hoped her placement would be at a local bank or telecommunications company, the chance to discover website design turned out to be the best thing that could have happened. </p>\n\n\n\n<p>In 2017, Thelma went on to work for a company designing websites using HTML, CSS, PHP, JavaScript and Joomla. She had heard about WordPress but had not used it. She recalls: “People have this misconception that WordPress is not for real developers and it is not secure and at that time I was one of those people.”</p>\n\n\n\n<h2>Finding a local community</h2>\n\n\n\n<p>From a discussion with a member of the local WordPress community, <a href=\"https://heropress.com/essays/wordpress-opened-whole-new-world/\">Thabo Tswana</a>, about a striking swag gift from a WordCamp, Thelma’s interest was sparked. </p>\n\n\n\n<p>She started to find out more about WordPress and WooCommerce, and visited her local WordCamp Harare website. She was delighted to find that she could learn more about WordPress without needing any pre-existing knowledge, and wanted to be involved. So instead of just attending the camp, she volunteered too! </p>\n\n\n\n<p>Her response to her first WordPress event mirrors the experience of many others in the community. She said: “I only started using WordPress because of the awesome people that l had met at that WordCamp. Everyone was so welcoming.”</p>\n\n\n\n<p>A week later, with help from Thabo, she designed her first website using WordPress.</p>\n\n\n\n<p>She soon became more involved with the community and Meetups. Thelma participated in the first-ever ‘Women Who WordPress’ Meetup in 2018, with lots of women getting involved from bloggers to developers. </p>\n\n\n\n<p>She said: “We were free to talk and discuss a lot of things. We had more time to discuss the difference between WordPress.com and WordPress.org, we shared views on how to handle discrimination at work, how to promote your website and a whole lot of other things.”</p>\n\n\n\n<h2>Establishing roots in WordPress</h2>\n\n\n\n<p>In 2018, WordCamp Harare had its first-ever female Lead Organizer <a href=\"https://tapiwanashe.com/\">Tapiwanashe Manhobo</a>. Thelma was part of the organising team that year and was assigned to handle Harare’s first Kids Camp to take place eight months later. You can read more about her experiences of organizing a <a href=\"https://thelmachido.wordpress.com/2019/11/21/wordpress-juniours-first-edition/\"><strong>Kids Camp</strong></a> on her blog.</p>\n\n\n\n<p>She said: “After the first Kids Camp, we had several people in the local Zimbabwean WordPress community who were enthusiastic about encouraging young people to embrace ICT. In 2019, we had not planned to have a Kids Camp because of financial constraints but to our surprise, we had some anonymous donations and we managed to have a WordPress Community outreach to a youth centre, <a href=\"https://cttzim.org/\"><strong>Centre for Total Transformation</strong></a>, a week after our WordCamp. It is a non-formal school that caters for underprivileged and vulnerable children. The group were able to share practical skills about using WordPress, computer hardware and software.</p>\n\n\n\n<p>Thelma shares that she became hooked on WordPress because of its community. “I enjoy attending WordCamps, meeting new people and just learning new stuff. I have a huge list of WordCamps I would like to attend. Last year I managed to cross WordCamp Johannesburg off my list. When everything is back to normal my plan to travel to WordCamps will proceed (fingers crossed).”</p>\n\n\n\n<h2>Reaping the fruits of ongoing learning</h2>\n\n\n\n<p>Thelma is committed to ongoing development training. She said: “Even though I can still cook up code in C and Java, for now, I have also included WordPress PHP functions to the mix. It was not easy to get to this point, daring myself got me to this slightly better stage. I try to do my best where I can and I am happy to say it has paid off so far.”</p>\n\n\n\n<p>Thelma has continued her journey working in design and digital marketing last year with Trust Nhokovenzo who works in digital marketing and is active in  the WordPress Community. He came across her name as a developer from talking with others involved in WordPress. She went to work with his team at a marketing agency.</p>\n\n\n\n<p>Her interest in the development of WordPress continued and she joined the <a href=\"https://wordpress.org/news/2020/12/simone/\">5.6 Release Squad</a> in the mid 2020. At the end of 2020, she moved to become a Happiness Engineer working with WordPress.com. Thelma’s fascination with the platform and the community continues to grow and her contributor story is ongoing.</p>\n\n\n\n<p>Find out more about the <a href=\"https://www.meetup.com/Harare-WordPress-Meetup\">Harare WordPress community</a> in Zimbabwe.</p>\n\n\n\n<h2>Contributors</h2>\n\n\n\n<p>Thanks to Nalini Thakor (<a href=\"https://profiles.wordpress.org/nalininonstopnewsuk/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>nalininonstopnewsuk</a>) and Surendra Thakor (<a href=\"https://profiles.wordpress.org/sthakor/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>sthakor</a>), Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>yvettesonneveld</a>), Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>webcommsat</a>), Larissa Murillo (<a href=\"https://profiles.wordpress.org/lmurillom/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>lmurillom</a>), Meher Bala (<a href=\"https://profiles.wordpress.org/meher/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>meher</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>chanthaboune</a>), and Chloé Bringmann (<a href=\"https://profiles.wordpress.org/cbringmann/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>cbringmann</a>). Thank you to Thelma Mutete (<a href=\"https://profiles.wordpress.org/thelmachido/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>thelmachido</a>) for sharing her #ContributorStory.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/s24EVZGKbxVeafljPU1ubF1DjIwn98E3-wGx1LD2CWYk7zYQppFhXNpb0aUhGe01TStMdTwXrcYaxBZQHRgZJ10lvW2hsg61Ce37_pBGJuTRQlJ6r9iUxlJtvuDuwLhIvPo1MVEb\" alt=\"HeroPress logo\"></figure>\n\n\n\n<p><em>This post is based on an article originally published on HeroPress.com, a community initiative created by </em><a href=\"https://profiles.wordpress.org/topher1kenobe/\"><em>Topher DeRosia</em></a><em>. HeroPress highlights people in the WordPress community</em>.</p>\n\n\n\n<p><em>Meet more WordPress community members in our <a href=\"https://wordpress.org/news/category/heropress/\">People of WordPress</a> series.</em></p>\n\n\n\n<p>#ContributorStory #HeroPress</p>"},
{"title": "People of WordPress: Pooja Derashri", "content": "<p><em>WordPress is open source software, maintained by a global network of contributors. There are many examples of how WordPress has changed people’s lives for the better. In this monthly series, we share some of the amazing stories that are lesser-known.</em></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"331\" src=\"https://i0.wp.com/wordpress.org/news/files/2021/02/pic1.jpg?resize=632%2C331&amp;ssl=1\" alt=\"Pooja standing in a banner &quot;I'm a WordPress fan&quot;\" class=\"wp-image-9719\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2021/02/pic1.jpg?resize=1024%2C536&amp;ssl=1 1024w, https://i0.wp.com/wordpress.org/news/files/2021/02/pic1.jpg?resize=300%2C157&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2021/02/pic1.jpg?resize=768%2C402&amp;ssl=1 768w, https://i0.wp.com/wordpress.org/news/files/2021/02/pic1.jpg?w=1200&amp;ssl=1 1200w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>Pooja Derashri shares the story of how she went from being an introvert from a small village in India to becoming a developer and working on international projects, thanks to the WordPress community. </p>\n\n\n\n<p>As her interest grew, Pooja started following some WordPress-based groups on Facebook, where she first heard about conference-style WordPress events known as WordCamps. She later joined her first WordCamp in Ahmedabad, India. This three day event in 2017 opened up a new world—the WordPress community—and what would become a life changing moment. “WordCamp Ahmedabad has one of the best WordPress communities in India,” she said, “and everyone, including organizers and attendees were so humble and welcoming.”</p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img src=\"https://i0.wp.com/wordpress.org/news/files/2021/02/pooja600x600.jpg?w=500&amp;ssl=1\" alt=\"\" class=\"wp-image-9654\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2021/02/pooja600x600.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/wordpress.org/news/files/2021/02/pooja600x600.jpg?resize=300%2C300&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2021/02/pooja600x600.jpg?resize=150%2C150&amp;ssl=1 150w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<h2><strong>The thirst for learning</strong></h2>\n\n\n\n<p>A fascination with how things worked and a desire never stop learning were traits that shone through in Pooja from a young age. She moved from Banera, a rural village in India, to a nearby city, where she lived with her uncle while completing her higher education. With her enthusiasm for learning, she decided to become an engineer. When thinking back on that time she says, “Being from a rural background, people in my village tended not to be keen on the idea of sending their girl child to another city for further studies. Fortunately, that was not the case for me because my parents were immensely supportive of me and my interests. They’ve always encouraged me to believe in myself and fulfill my dreams. With their support, I pursued my engineering in electronics and communication.”</p>\n\n\n\n<h2><strong>Discovering the opportunities in web development </strong></h2>\n\n\n\n<p>On completing her engineering training, Pooja was not sure what to do next. One of her friends suggested that she should explore web development. The idea intrigued her, and she sought out learning resources to study. She also secured an internship as a PHP Developer to give herself the chance to learn alongside professionals in the field.</p>\n\n\n\n<h2><strong>Getting started with WordPress</strong></h2>\n\n\n\n<blockquote class=\"wp-block-quote has-text-align-center\"><p><strong>“I found WordPress surpassed other platforms. The vast knowledge base made it easy for me to learn.” – Pooja</strong></p></blockquote>\n\n\n\n<p>This internship led Pooja to her first job where she discovered a range of content management systems. Her view of the opportunities offered by these systems changed when the manager assigned her a small project using the WordPress platform. </p>\n\n\n\n<p>She recalls: “I found WordPress surpassed other platforms I had worked on earlier. The vast knowledge base made it easy for me to learn.” She soon became comfortable managing WordPress, working with plugins and themes, and wanted to learn it more in-depth.</p>\n\n\n\n<p>Pooja soon joined WPVibes as its first team member. Being part of a new startup gave her a lot of experience and a chance to be involved in new processes. As the company expanded they started providing custom plugin development services per the client’s requirement and created some free and paid plugins. Pooja said, “We found it very exciting and productive. Today, we are a team of 10.”</p>\n\n\n\n<h2><strong>Encouragement from the WordPress community</strong></h2>\n\n\n\n<blockquote class=\"wp-block-quote has-text-align-center\"><p><strong>Contributing to WordPress increases your knowledge</strong></p></blockquote>\n\n\n\n<p>At the event, she was able to listen to speakers from India and abroad, many of whom shared their journey with WordPress and how it had changed their lives. “One of the most inspiring sessions was by Rahul Bansal,” she said. “He talked about contributing to WordPress and giving back to the community. He also explained how contributing to WordPress can help you to enhance your knowledge. It inspired me to contribute to WordPress.”</p>\n\n\n\n<p>The WordPress community of Ahmedabad continued to inspire Pooja and her husband Anand Upadhyay, and they later started a Meetup group in their home city of Ajmer as part of their contribution to the community. They continue to be involved in supporting local users through the <a href=\"https://www.meetup.com/ajmer-wordpress-meetup/\">Ajmer Meetup</a>.</p>\n\n\n\n<figure class=\"wp-block-image is-resized\"><img src=\"https://lh5.googleusercontent.com/KmA8iDgGrRar_cgD2jp2ThrzPxuzGTSI7SWkxDdHKyN4p2iNoj0e-VdOxO0xa1TtH56Uci9wEfYYfnW8DYji8c1HuaI7L-xhNqXyXt_kdchWtVxe_PnSea2knlWhP_O7qqG0Quju\" alt=\"Pooja with a WordCamp Ahmedabad badge\" width=\"500\"></figure>\n\n\n\n<p>At the next WordCamp Pooja attended, she joined its contributor day, which brings users together to give back to the open source platform and global community. Most of the contributors she met were interested in giving time to the WordPress CMS. She decided to venture into a different path and took her first steps by joining the WordPress TV group, where you can explore videos from WordPress events across the world. She also discovered the joy of translating into her local language, and is a <a href=\"https://make.wordpress.org/polyglots/\">Polyglot</a> contributor for the Hindi language.</p>\n\n\n\n<p>In 2019, she was selected as a volunteer for WordCamp Asia in Bangkok, Thailand, and it became an impetus to become even more involved with the community. She was very excited about this role, and to be part of her first WordCamp outside India. Sadly, due to the global COVID pandemic, the event had to be cancelled. Her enthusiasm has not diminished and she is eagerly waiting to support in-person WordCamps in the future and meet even more members of the global community.</p>\n\n\n\n<p>Her determination to be part of making WordPress and sharing skills has only increased, which has led to contribute to the WordPress Training team. This team manages lesson plans and prepares content to support people who are training others to use WordPress. The team recently joined a few other teams to <a href=\"https://wordpress.org/news/2020/12/introducing-learn-wordpress/\">launch Learn WordPress</a>, which brings learning materials together for users of all levels, and Pooja contributed to two different teams during the project.</p>\n\n\n\n<h2><strong>Message to the WordPress Community</strong></h2>\n\n\n\n<p>Pooja is eager to share her belief in the power for good in the WordPress community. “There is a huge community to help you with your learning, so start learning and try to give back to the community. It doesn’t matter if you are not comfortable with programming, there are many different ways in which you can contribute.” </p>\n\n\n\n<p>“What I have learned in my life is that it doesn’t matter from where you came and what background you have. All that matters is your hard work and positive attitude towards life.”</p>\n\n\n\n<p>Read more stories in the <a href=\"https://wordpress.org/news/category/heropress/\">People of WordPress series</a>.</p>\n\n\n\n<h2>Contributors</h2>\n\n\n\n<p><em>Thanks to Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\">@webcommsat</a>) and Nalini Thakor (<a href=\"https://profiles.wordpress.org/nalininonstopnewsuk/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>nalininonstopnewsuk</a>) for writing this story, and to Surendra Thakor (<a href=\"https://profiles.wordpress.org/sthakor/\">@sthakor</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>), Meher Bala (<a href=\"https://profiles.wordpress.org/meher/\">@meher</a>), Chloé Bringmann (<a href=\"https://profiles.wordpress.org/cbringmann/\">@cbringmann</a>), Olga Glekler (<a href=\"https://profiles.wordpress.org/oglekler/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>oglekler</a>), Christopher Churchill (<a href=\"https://profiles.wordpress.org/vimes1984/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>vimes1984</a>), Larissa Murillo (<a href=\"https://profiles.wordpress.org/lmurillom/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>lmurillom</a>), and Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\">@yvettesonneveld</a>) for work on the series this month. Thank you also to Pooja Derashri (<a href=\"https://profiles.wordpress.org/webtechpooja/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>webtechpooja</a>) for sharing her #ContributorStory.</em></p>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:100%\">\n<div class=\"wp-block-media-text alignwide is-stacked-on-mobile\" style=\"grid-template-columns:27% auto\"><figure class=\"wp-block-media-text__media\"><img src=\"https://lh4.googleusercontent.com/E9y8t1dTqeOylNc4mkC0KeQfmCisFLy4790Idt2DYwWdKSEwCh7RlsAmTcnRYuTb7jqXzwtYVjPRsXDVTh_HREDUWAbB-sOOXuC7HEZR-uEeV046dl8X3eU9kG6fpIXkRn0SbDcT\" alt=\"HeroPress logo\"></figure><div class=\"wp-block-media-text__content\">\n<p><em>This post is based on an article originally published on HeroPress.com, an initiative focused around people in the WordPress community created by </em><a href=\"https://profiles.wordpress.org/topher1kenobe/\"><em>Topher DeRosia</em></a><em>.</em></p>\n\n\n\n<p><em>Meet more WordPress community members in the <a href=\"https://wordpress.org/news/category/heropress/\">People of WordPress</a> series.</em></p>\n</div></div>\n</div>\n</div>"},
{"title": "People of WordPress: Robert Cheleuka", "content": "<p><em>You’ve probably heard that WordPress is open-source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>Meet Robert Cheleuka</strong></h2>\n\n\n\n<p>Robert is a self-taught graphic and motion designer turned web designer (and aspiring web developer) from Malawi, Africa. Over the years, he has grown fond of WordPress and has become a loyal user. Still, the journey is rough.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"790\" src=\"https://i2.wp.com/wordpress.org/news/files/2020/01/DSC08818.jpg?resize=632%2C790&amp;ssl=1\" alt=\"Robert Cheleuka\" class=\"wp-image-8303\" data-recalc-dims=\"1\"><figcaption>Robert Cheleuka</figcaption></figure>\n\n\n\n<h3><strong>Malawi</strong></h3>\n\n\n\n<p>Malawi is one of the poorest countries in the world. A tiny landlocked country with a population of 17 million, it’s largely rural and still considered a developing country. The average entry-level monthly pay for most skilled jobs is about $110. If you’re employed full-time in the creative industry and if you’re very lucky, you might be able to earn more than that. Employees earning more than $300 a month are rare to non-existent.</p>\n\n\n\n<p>Robert has been a freelance graphic designer since about 2011. He started by doing gigs from his dorm in college and from home. Earnings from his freelance jobs increased his interest in entrepreneurship and he started to consider starting his own creative agency.</p>\n\n\n\n<h3><strong>How Robert was introduced to WordPress</strong></h3>\n\n\n\n<p>Robert first came into contact with WordPress in 2014 when he and a friend started a local tech blog. Before that, all he knew was basic, outdated HTML from high school and some knowledge of Adobe Dreamweaver. They decided to use WordPress, and their new blog looked like it came from the future. They used a theme from the repo and got such positive feedback from the blog they decided to open a content and media publishing agency.</p>\n\n\n\n<p>While they got a few web redesign jobs thanks to the exposure the blog brought, they lacked the administrative and business skills needed and ended up going their separate ways. Then in his first real job after college Robert finally took it upon himself to learn the ins and outs of WordPress. He learned how to install WordPress on a server and did some research on customizing themes. </p>\n\n\n\n<p>With that knowledge alone he got his first web design clients and started earning nearly as much as he did at his job. Robert soon realized that free WordPress themes would only take him so far, especially with his limited code skills.</p>\n\n\n\n<p>Because in Malawi only people who travel abroad have access to credit cards, paying for premium themes was impossible. Like many WordPress designers in developing countries, Robert turned to using pirated themes instead. He knew that was both unsafe and unethical, and decided to learn how to code. Knowing how to build themes from scratch would surely help him rise above the competition. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1080\" height=\"1080\" src=\"https://i1.wp.com/wordpress.org/news/files/2020/01/20180905_1971270886435744_8835917058488139776_n.jpg?fit=632%2C632&amp;ssl=1\" alt=\"\" class=\"wp-image-8304\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2020/01/20180905_1971270886435744_8835917058488139776_n.jpg?w=1080&amp;ssl=1 1080w, https://i1.wp.com/wordpress.org/news/files/2020/01/20180905_1971270886435744_8835917058488139776_n.jpg?resize=300%2C300&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2020/01/20180905_1971270886435744_8835917058488139776_n.jpg?resize=1024%2C1024&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2020/01/20180905_1971270886435744_8835917058488139776_n.jpg?resize=150%2C150&amp;ssl=1 150w, https://i1.wp.com/wordpress.org/news/files/2020/01/20180905_1971270886435744_8835917058488139776_n.jpg?resize=768%2C768&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\"></figure>\n\n\n\n<h3><strong>The WordPress community from Robert’s perspective</strong></h3>\n\n\n\n<p>Robert doesn’t have a lot of interaction with the WordPress community. Although he would search for solutions from blogs about WordPress he had never actually talked to or asked anyone from the community for a solution. </p>\n\n\n\n<p>Robert believes that this isolation is the result of a glass ceiling — the WordPress community is partially online and partially in-person, but there isn’t a local group in Malawi. And because Malawi, like many other developing nations, lacks a way to pay online many can’t access premium support, online learning, or most other types of professional development. No matter how welcoming the people of WordPress might be, it can still feel like it mostly belongs to those with enough privilege to conduct business on the internet.</p>\n\n\n\n<h3><strong>WordPress &amp; inclusion</strong></h3>\n\n\n\n<p>As most freelancers know, it’s really hard to learn while you also still need to earn. Add pitching to clients and shipping graphic design projects… there are only so many hours in a day.</p>\n\n\n\n<p>Robert didn’t have a programming background and had always been more of a creative person. In order to grow as a web designer/developer, he needed to learn PHP. Again, without access to a credit card, that was complicated. Also, free coding training wasn’t as widely available as it is now.</p>\n\n\n\n<p>Robert wishes that more developers would consider alternative ways for users who cannot pay for courses, themes, or plugins (whether that’s because of available infrastructure or otherwise). He wishes that WordPress tutors and developers would open up ways to accommodate aspiring learners in developing countries who cannot access plugins, courses, and themes, to be able to give back and to participate at another level.</p>\n\n\n\n<p>WordPress has allowed him to build an income he would have no other way of earning and it makes a huge difference. He believes sharing stories like his will hopefully make WordPress products and services become more universally available. In addition, he hopes that more aspiring, self-taught developers will find courage in reaching out to connect with others out there.</p>\n\n\n\n<h2><strong>Contributors</strong></h2>\n\n\n\n<p>Alison Rothwell (<a href=\"https://profiles.wordpress.org/wpfiddlybits/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>wpfiddlybits</a>), Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>yvettesonneveld</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>chanthaboune</a>), Siobhan Cunningham (<a href=\"https://profiles.wordpress.org/siobhanseija/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>siobhanseija</a>), Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>topher1kenobe</a>).  Thank you to Robert Cheleuka  for sharing his #ContributorStory.</p>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:33.33%\">\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"474\" src=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=632%2C474&amp;ssl=1\" alt=\"\" class=\"wp-image-7025\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?w=1024&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=768%2C576&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n</div>\n\n\n\n<div class=\"wp-block-column\" style=\"flex-basis:66.66%\">\n<p> <em>This post is based on an article originally published on HeroPress.com, a community initiative created by <a href=\"https://profiles.wordpress.org/topher1kenobe/\">Topher DeRosia</a>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em> </p>\n</div>\n</div>\n\n\n\n<p> <em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em> </p>\n\n\n\n<p><br></p>"},
{"title": "People of WordPress: Fike Komala", "content": "<p><em>WordPress is open source software, maintained by a global network of contributors. There are many examples of how WordPress has changed people’s lives for the better. In this monthly series, we share some of the amazing stories that are not as well known.</em><br><br>Creating content with WordPress and blogging helped Fike Komala, from Indonesia, build a career where she can work remotely from different locations in the world. <br></p>\n\n\n\n<p>In 2020, Fike joined a US-based company that specializes in form building to work as a content marketer. Using her experience as a freelancer and later a full time employee, she encourages others, particularly women in Asia, to consider remote work as a career option. She is so impressed by remote working benefits, that she is now considering writing about it for a thesis for her Master’s Degree, which she started this year in Europe.<br></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"387\" src=\"https://i0.wp.com/wordpress.org/news/files/2021/05/B5939AF2-DFFD-4471-B3F1-7738F82CEF8A.png?resize=632%2C387&amp;ssl=1\" alt=\"Fike pictured with a snow background\" class=\"wp-image-10291\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2021/05/B5939AF2-DFFD-4471-B3F1-7738F82CEF8A.png?w=1024&amp;ssl=1 1024w, https://i0.wp.com/wordpress.org/news/files/2021/05/B5939AF2-DFFD-4471-B3F1-7738F82CEF8A.png?resize=300%2C184&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2021/05/B5939AF2-DFFD-4471-B3F1-7738F82CEF8A.png?resize=768%2C470&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>As a keen blogger, WordPress immediately impressed Fike. Her dad is a programmer, and he helped her create the first of many blogs starting when she was 10 years old. She had private and public blogs, and even an English language one to help her practice and improve her skills. </p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p><strong>“I got satisfaction and happiness from pouring my thoughts in writing and publishing them in my blog. Writing my thoughts and feelings often helped me process them, and does even now.”</strong></p><cite>Fike Komala</cite></blockquote></figure>\n\n\n\n<p>With a natural talent and love for languages, Fike pursued an Information Systems degree after graduating from high school. Her course covered business learning Java, HTML, CSS, Javascript, and Android programming. She also took courses to learn Bootstrap and Ruby on Rails. </p>\n\n\n\n<h2>Earning Through Building With WordPress</h2>\n\n\n\n<p>Fike’s parents had a business building websites. She was drawn to this work and would help proofread and format the articles. This is how she first encountered WordPress, which was to play a pivotal role in her future career. <br></p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“I saw WordPress as something more advanced than other platforms, with more themes and plugins to choose from. The default WordPress websites already looked more professional than others.”</p><cite>Fike Komala</cite></blockquote>\n\n\n\n<p>Throughout school, Fike’s experience with WordPress and blogging helped her earn extra money safely online, including translating texts from English to Indonesia, online surveys, and writing articles in English.</p>\n\n\n\n<h2>Discovering Work You Enjoy </h2>\n\n\n\n<p>The last year at University required a year-long full-time internship. Fike worked as an intern at a big general insurance company within the IT quality control staff. She enjoyed working with the people she met and learned a lot through this opportunity, but she declined the offer of a full-time position. </p>\n\n\n\n<p>Fike is a good student who loves learning and did well in her education. Through her traditional internship experience,  she found that programming in an office job did not fulfill her. It strengthened her belief in a finding a career where she could have the freedom and creativity of working remotely.</p>\n\n\n\n<p>“I was a good student, I love learning algorithms, but I didn’t love programming. I’m not that person who can stay calm finding errors in their codes, and then finding out that it’s only missing a character,” said Fike. She added: “I don’t really like the fact that I have to wake up at 6 AM and be back home at 7 PM, and do it all over again the next day.”</p>\n\n\n\n<h2>Adventure Into Remote Work </h2>\n\n\n\n<p>Fike spent time improving her freelance profile, revising it, and applying to jobs as a virtual assistant. She was willing to do any small website jobs such as formatting WordPress posts, designing social media posts, and processing orders for online shops. Through a freelance job submission site, she was able to work with people from across the globe, including Singapore, Australia, Europe, and America. Through the site, Fike was able to gain experience with remote working tools like Slack, Asana, Trello, and Google Suites, and the work gave her practice writing in English. </p>\n\n\n\n<p>It was through this site that Fike saw a job opportunity with a WordPress plugin company. She sent in her profile and blog. </p>\n\n\n\n<p>“This was my first time being interviewed via a video call. I was ecstatic but panicked. On the day, I woke up at 4 AM, got dressed, and opened my laptop. Weirdly, my wi-fi died that morning. So I went to the nearest cafe to get the interview done, and it went great!”</p>\n\n\n\n<p>She was hired to deliver consistency on the company’s blog. </p>\n\n\n\n<p>Through her job, Fike first began to contribute within the WordPress community and was able to attend her first WordCamp, WordCamp Jakarta 2018, sponsored by her firm. Through WordPress, Fike has met many generous, trusting, and helpful people. </p>\n\n\n\n<p>She said: “Because I’ve experienced the generosity of the WordPress people, I wanted to give back to the community.”</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/ZDAmqCcebOQII99V2RMYmJikoQ3u-tjy6BcCT39QWsOUrAqq2_HeqJ1735UoxVyQHTO_S_V9lzZEJ7WayLb8kY3or78oqG4Xt5ujbNUpt7Vcz7r20lp9XopkPwh85imnvRxjpWTx\" alt=\"WordCamp swag\"><figcaption>Swag from WordCamp Jakarta 2018, that’s Wapuu ondel-ondel!</figcaption></figure>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p><strong>“I got to know the amazing community behind WordPress. How people voluntarily contribute their time, energy, and skills to the community, from development, marketing to translating.</strong> <strong>It was really inspiring.”</strong></p><cite>Fike Komala</cite></blockquote></figure>\n\n\n\n<h2>You Can Inspire Others Through Contributing</h2>\n\n\n\n<p>Fike has been an inspiration to people in her local community and globally within the WordPress community through her enthusiasm and energy. </p>\n\n\n\n<p>She <a href=\"https://www.youtube.com/watch?v=KHSAV_NJtTA\">talks about her joy in contributing</a> during a live interview as part of WordPress Translation Day in 2020. </p>\n\n\n\n<p>So determined to encourage others to become translators of WordPress, she joined the Global Translation Day event with the Indonesian Community last year and took part in wider marketing of the event. She is pictured below with some of the Indonesian polyglots team.</p>\n\n\n\n<p>She continues to support the polyglots and is a General Translation Editor for the Indonesian language. Last year, she also voiced an <a href=\"https://youtu.be/Ifqabp-36_c\">Indonesian translation of the onboarding video</a> for new contributors joining WordPress.org. She has been a regular contributor to the PerempuanWP, an initiative for Indonesian women working in the WordPress world. Working with a firm which uses the WordPress platform has strengthened her familiarity with projects in the community and encourages her interest in contributing.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/H-8VelQbbEb9f5MM-SUXNudVD9U1DNs546yt_cWGRU--GSLm-PCUunnHDNFmquv9w3rWOUadxkbYr9bYsRU1Ecmhb6Ee_Deg_paNEIyyqs91_3DjgtlmfgCA_P45GNA5nf5rmpCe\" alt=\"Indonesian translation team \"></figure>\n\n\n\n<p>To learn more about contributing to WordPress, visit <a href=\"https://make.wordpress.org/\">make.wordpress.org/</a> and follow the “get involved” link. You can join any of the weekly team meetings to get started, and there is a lot of help available. </p>\n\n\n\n<p>Fike says, “I want to represent Asian women. In the future, I hope I can inspire more women, especially Asians, to work remotely.” She is now studying in Europe for a Master’s in Digital Communication Leadership. She hopes to use her learning to help other women, particularly back in her home country of Indonesia.</p>\n\n\n\n<p>She continues to share her energy for learning and remote working. </p>\n\n\n\n<p>“<strong>Just learn things. As much as you can. From anywhere, about anything. Keep an open mind. Read books, listen to podcasts, and learn new skills.”</strong></p>\n\n\n\n<p><strong>She added: “If you’re working in the WordPress world, join the WordPress community. It’s a great place to learn from and connect with great people.”</strong></p>\n\n\n\n<h2>Contributors</h2>\n\n\n\n<p>Thanks to Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\">@webcommsat</a>) and Meg Phillips (<a href=\"https://profiles.wordpress.org/megphillips91/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>megphillips91</a>) for writing this feature, to Surendra Thakor (<a href=\"https://profiles.wordpress.org/sthakor/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>sthakor</a>), Meher Bala (<a href=\"https://profiles.wordpress.org/meher/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>meher</a>), Larissa Murillo (<a href=\"https://profiles.wordpress.org/lmurillom/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>lmurillom</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>), Chloé Bringmann (<a href=\"https://profiles.wordpress.org/cbringmann/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>cbringmann</a>) for additional support and graphics, and to Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\">@topher1kenobe</a>) who created HeroPress. Thank you to Fike Komala (<a href=\"https://profiles.wordpress.org/fikekomala/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>fikekomala</a>) for sharing her #ContributorStory.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/FEZ2FQJ0vQ311YoPfh6ny15NXh8saTLH_RjyDO4pUOuEGBTa-Czk63PGoWL04FawKviRfNx0QXePx-goK04X12ry1BR_WXh-kVPIfsEeItPAX6reN5fHS96q6-8dUI506ZO38Z0G\" alt=\"HeroPress logo\"></figure>\n\n\n\n<p><em>This post is based on an article originally published on HeroPress.com. It highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p><em>Meet more WordPress community members in our <a href=\"https://wordpress.org/news/category/heropress/\">People of WordPress series</a>.</em></p>\n\n\n\n<p><em>#ContributorStory #HeroPress #WPTranslationDay</em></p>"},
{"title": "People of WordPress: Tyler Lau", "content": "<p><em>WordPress is open source software, maintained by a global network of contributors. There are many examples of how WordPress has changed people’s lives for the better. In this monthly series, we share some of the amazing stories that are lesser-known.</em></p>\n\n\n\n<h2><strong>Embrace Who You Are and Your Journey</strong></h2>\n\n\n\n<p>In this People of WordPress contributor story, we chat to Tyler Lau from the US on his relationship building work in marketing and his WordPress journey.</p>\n\n\n\n<p>Read on to discover his story which shows it is often what you have learned from negative experiences in your life that can make you a major asset to a product team.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://i1.wp.com/wordpress.org/news/files/2021/04/people-of-wp-tyler-thumb.jpg?resize=632%2C464&amp;ssl=1\" alt=\"Tyler Lau stood in front of a colorful mural\" class=\"wp-image-10116\" width=\"632\" height=\"464\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2021/04/people-of-wp-tyler-thumb.jpg?zoom=2&amp;resize=640%2C470&amp;ssl=1 1280w, https://i1.wp.com/wordpress.org/news/files/2021/04/people-of-wp-tyler-thumb.jpg?zoom=3&amp;resize=640%2C470&amp;ssl=1 1920w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<h2><strong>An Entrepreneurial Mindset</strong></h2>\n\n\n\n<p>Tyler recalls he always had a knack for spotting a enterprise ideas. As an industrious seven-year-old, he was already finding ways to make sales during the school breaks. </p>\n\n\n\n<p>While many entrepreneurs have similar stories, Tyler’s path took many turns before he discovered and thrived in the WordPress community.</p>\n\n\n\n<p>He was drawn to both the software and the community that surrounds it from his search for personal and professional freedom. He ultimately was able to combine his various business interests and people skills into professional marketing work.</p>\n\n\n\n<h2><strong>Using your skills to uncover your journey</strong></h2>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://i0.wp.com/wordpress.org/news/files/2021/04/people-of-wp-tyler-2.jpg?resize=632%2C758&amp;ssl=1\" alt=\"Tyler Lau pictured sat on a chair using his mobile phone in his social media work\" class=\"wp-image-10118\" width=\"632\" height=\"758\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2021/04/people-of-wp-tyler-2.jpg?zoom=2&amp;resize=640%2C768&amp;ssl=1 1280w, https://i0.wp.com/wordpress.org/news/files/2021/04/people-of-wp-tyler-2.jpg?zoom=3&amp;resize=640%2C768&amp;ssl=1 1920w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>Tyler’s current role is as a Marketing Relationship Builder, based in Kansas, USA. His responsibilities span across all digital properties and products, leveraging his broad set of business and people skills.</p>\n\n\n\n<p>These skills are amplified by his creativity and adaptability. Tyler says that one reason he is always looking for new projects is his Attention Deficit Hyperactivity Disorder (ADHD), a diagnosis he received in 2005.</p>\n\n\n\n<p>In an industry built by programmers and developers who often have a strong sense of focus, Tyler felt that someone with ADHD wouldn’t be seen as a natural fit. He found the WordPress community to be a place where everyone can find the right spot for their unique skills. Tyler’s skill is people, and this has translated into many opportunities and responsibilities in his work life. His skills have also helped him give back to the WordPress community as a speaker and volunteer, and through multiple contributor days.</p>\n\n\n\n<h2><strong>Relationship-building as a career</strong></h2>\n\n\n\n<p>Most of Tyler’s experience was in the restaurant industry, and his resume did not exactly point to a career in tech. But the service industry actually prepared him well for everything he has taken on since.</p>\n\n\n\n<p>When he is at work events, he meets people from across the world and builds connections with them. As an extrovert, he enjoys this and couldn’t imagine a job where he was isolated from getting to know others and relationship-building.</p>\n\n\n\n<p>Understanding people and being able to operate in any setting are key competencies. Social skills and tact are useful for community building in the WordPress space too, and in Tyler’s life at different times it has been necessary for survival. </p>\n\n\n\n<h2><strong>The true meaning of freedom</strong></h2>\n\n\n\n<p>In the WordPress community, the concept of freedom comes up often. WordPress is built on GPL, free software, and open-source values. Practically speaking, anyone can work remotely or be their own boss to gain more freedom in work and life. Tyler feels that he never fitted into a traditional work mould. With his strong focus on freedom, he found this resonated with the freedom and opportunities he believes WordPress provides him and thousands of others.</p>\n\n\n\n<p>Tyler describes how in 2013 his ‘inner opportunist’ got him into trouble. After dropping out of college following a brain aneurysm, he needed capital to fund his first startup. He shares that he found a quick but unlawful way to make money. Alongside this between shifts as a waiter, he worked on prototypes for his first product. The company was growing fast, and to protect his patents and take research and development to the next level, he had to work hard. Everything came to a halt when some of the actions he took resulted in being sent to prison.  </p>\n\n\n\n<p>He says that meeting other inmates reminded him that he was in a much better situation than most. He was educated, well-off, loved, and knew he had a future once he was released. He found that many inmates never graduated from high school and were computer illiterate. While inside, Tyler taught subjects like science, math, writing, reading, and social studies. He found that due to the lack of skills and support, many inmates would struggle upon release. He believes getting the mental health support and job training needed to thrive after prison is not easy for many.</p>\n\n\n\n<p>“<em>There’s more to freedom than just being on the outside. You also need a sense of agency and enfranchisement,</em>” says Tyler. He considered his sense of purpose and support network were plenty to keep him going and was ready to take on his next (legal) business challenge as soon as he could.</p>\n\n\n\n<h2>Going forward positively </h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"632\" src=\"https://i0.wp.com/wordpress.org/news/files/2021/04/FF50DF21-38AA-4778-B465-C2DF0B441AD7.jpeg?resize=632%2C632&amp;ssl=1\" alt=\"Tyler Lau portrait picture\" class=\"wp-image-10139\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2021/04/FF50DF21-38AA-4778-B465-C2DF0B441AD7.jpeg?w=640&amp;ssl=1 640w, https://i0.wp.com/wordpress.org/news/files/2021/04/FF50DF21-38AA-4778-B465-C2DF0B441AD7.jpeg?resize=300%2C300&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2021/04/FF50DF21-38AA-4778-B465-C2DF0B441AD7.jpeg?resize=150%2C150&amp;ssl=1 150w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>The idea that your past doesn’t define you and you can choose to embrace it, is a key driver for Tyler.</p>\n\n\n\n<p>He describes himself as an outlier in many ways. He recalls how politics influenced his life from the day he was born. Tyler’s father is a semi-dissident Chinese visual anthropologist, his mother is an art professor who left her home country of Japan to break free from traditional Japanese gender roles. Tyler feels he inherited a lot of this fearlessness.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“<em>I’ve never fitted in, and yet this is what makes me able to adapt to most situations and relate to just about anyone. I embrace my eclectic, dissonant past and see beauty in the person those experiences shaped me to be</em>,” says Tyler. </p></blockquote>\n\n\n\n<p>Now, he’s able to put those skills to good use in the WordPress community and beyond. </p>\n\n\n\n<p>He says: “<em>Regardless of your physical abilities, mental health struggles, upbringing, and even your run-ins with the law, no one is excluded from carving their place in the WordPress industry</em>”.<br></p>\n\n\n\n<h2><strong>Contributors</strong></h2>\n\n\n\n<p>Thank you to Tyler Lau (<a href=\"https://profiles.wordpress.org/tylermaximus/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>tylermaximus</a>) for sharing his #ContributorStory.</p>\n\n\n\n<p>Thanks to Larissa Murillo (<a href=\"https://profiles.wordpress.org/lmurillom/\">@lmurillom</a>), Surendra Thakor (<a href=\"https://profiles.wordpress.org/sthakor/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>sthakor</a>), Olga Gleckler (<a href=\"https://profiles.wordpress.org/oglekler/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>oglekler</a>), Meher Bala (<a href=\"https://profiles.wordpress.org/meher/\">@meher</a>), Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>yvettesonneveld</a>), Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\">@webcommsat</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>), Chloé Bringmann (<a href=\"https://profiles.wordpress.org/cbringmann/\">@cbringmann</a>) and Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\">@topher1kenobe</a>) for working on the People of WordPress series.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/Y3odYTyvSfJbVxUxUWEgKxOprox2zxVwhk7_vdW-AIs4IlE-jK0Zt1itCj867x0dIAbIiK-VeuTLMZr6BjNEY0fkTf--4dT1hkLbnGtsPFNfyrVBYIN59IirTkNnqiQgqxk6E1MI\" alt=\"HeroPress logo\"></figure>\n\n\n\n<p><em>This post is based on an article originally published on HeroPress.com, a community initiative created by </em><a href=\"https://profiles.wordpress.org/topher1kenobe/\"><em>Topher DeRosia</em></a><em>. It highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p><em>Meet more WordPress community members in our <a href=\"https://wordpress.org/news/category/heropress/\">People of WordPress</a> series.</em></p>\n\n\n\n<p><em>#ContributorStory #HeroPress</em></p>"},
{"title": "People of WordPress: Kim Parsell", "content": "<p><em>You’ve probably heard that WordPress is open-source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>Meet Kim Parsell</strong></h2>\n\n\n\n<p>We’d like to introduce you to Kim Parsell. Kim was an active and well-loved member of the WordPress community. Unfortunately, she passed away in 2015. Lovingly referred to as #wpmom, she leaves behind a legacy of service. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1200\" height=\"478\" src=\"https://i1.wp.com/wordpress.org/news/files/2019/11/Kim-Parsell-1.jpg?fit=632%2C252&amp;ssl=1\" alt=\"\" class=\"wp-image-7664\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2019/11/Kim-Parsell-1.jpg?w=1200&amp;ssl=1 1200w, https://i1.wp.com/wordpress.org/news/files/2019/11/Kim-Parsell-1.jpg?resize=300%2C120&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2019/11/Kim-Parsell-1.jpg?resize=1024%2C408&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2019/11/Kim-Parsell-1.jpg?resize=768%2C306&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>Kim Parsell</figcaption></figure>\n\n\n\n<h2><strong>How Kim became #wpmom</strong></h2>\n\n\n\n<p>In order to understand how highly valued the WordPress community was to Kim Parsell, you have to know a bit about her environment.</p>\n\n\n\n<p>Kim was a middle-aged woman who lived off a dirt road, on top of a hill, in Southern rural Ohio. She was often by herself, taking care of the property with only a few neighbors up and down the road.</p>\n\n\n\n<p>She received internet access from towers that broadcast wireless signals, similar to cell phones but at lower speeds.</p>\n\n\n\n<h2><strong>Connecting through attending live podcast recordings</strong></h2>\n\n\n\n<p>By listening to the regular podcast, WordPress Weekly, Kim met members of the WordPress community and was able to talk to them on a weekly basis. The show and its after-hours sessions provided Kim a chance to mingle with the who’s who of WordPress at the time. It helped establish long-lasting relationships that would open up future opportunities for her.</p>\n\n\n\n<p>Since she lived in a location where few around her used or had even heard of WordPress, the community was an opportunity for her to be with like-minded people. Kim enjoyed interacting with the community, both online and at WordCamp events, and many community members became her second family, a responsibility she took very seriously.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>“Many members of the WordPress community became her second family, a responsibility she took very seriously.”</em></p><cite><em>Jeff Chandler</em></cite></blockquote>\n\n\n\n<h2><strong>One of the first women of WordPress</strong></h2>\n\n\n\n<p>Kim is regarded as one of the first “women of WordPress,” investing a lot of her time in women who wanted to break into tech. She worked hard to create a safe environment sharing herself and her knowledge and was affectionately called #wpmom.</p>\n\n\n\n<p>She contributed countless hours of volunteer time, receiving “props” for 5 major releases of WordPress, and was active on the documentation team. </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>“Affectionately called #wpmom, Kim was an investor. She invested countless hours into the WordPress project and in women who wanted to break into tech.”</em></p><cite><em>Carrie Dils</em></cite></blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1280\" height=\"949\" src=\"https://i0.wp.com/wordpress.org/news/files/2019/11/KimParsell2.jpg?fit=632%2C468&amp;ssl=1\" alt=\"\" class=\"wp-image-7663\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2019/11/KimParsell2.jpg?w=1280&amp;ssl=1 1280w, https://i0.wp.com/wordpress.org/news/files/2019/11/KimParsell2.jpg?resize=300%2C222&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2019/11/KimParsell2.jpg?resize=1024%2C759&amp;ssl=1 1024w, https://i0.wp.com/wordpress.org/news/files/2019/11/KimParsell2.jpg?resize=768%2C569&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>Kim at WordCamp San Francisco</figcaption></figure>\n\n\n\n<h2><strong>Kim Parsell Memorial Scholarship</strong></h2>\n\n\n\n<p>In 2014, she received a travel stipend offered by the WordPress Foundation that enabled her to attend the WordPress community summit, held in conjunction with WordCamp San Francisco. She shared with anyone who would listen, that this was a life-changing event for her. </p>\n\n\n\n<p>The WordPress Foundation now offers that scholarship in her memory. The Kim Parsell Memorial Scholarship provides funding annually for a woman who contributes to WordPress to attend WordCamp US, a flagship event for the WordPress community.</p>\n\n\n\n<p>This scholarship truly is a fitting memorial. Her contributions have been vital to the project. Moreover, the way she treated and encouraged the people around her has been an inspiration to many.  </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Her spirit lives on in the people she knew and inspired. Here’s hoping that the Kim Parsell Memorial Scholarship will serve to further inspire those who follow in her footsteps.</em></p><cite><em>Drew Jaynes</em></cite></blockquote>\n\n\n\n<h2><strong>Kim is missed, but her spirit continues to live on</strong></h2>\n\n\n\n<p>Sadly Kim died just a few short months later. But her spirit lives on in the people she knew and inspired within her communities. The Kim Parsell Memorial Scholarship will serve to further inspire those who follow in her footsteps.</p>\n\n\n\n<h2><strong>Contributors</strong></h2>\n\n\n\n<p>Alison Rothwell (<a href=\"https://profiles.wordpress.org/wpfiddlybits/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>wpfiddlybits</a>), Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>yvettesonneveld</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>chanthaboune</a>), Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>topher1kenobe</a>), Jeff Chandler, Carrie Dils, Jayvee Arrellano, Jan Dembowski, Drew Jaynes</p>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:33.33%\">\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"474\" src=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=632%2C474&amp;ssl=1\" alt=\"\" class=\"wp-image-7025\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?w=1024&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=768%2C576&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n</div>\n\n\n\n<div class=\"wp-block-column\" style=\"flex-basis:66.66%\">\n<p> <em>This #ContributorStory post is based on an article originally published on HeroPress.com, a community initiative created by <a href=\"https://profiles.wordpress.org/topher1kenobe/\">Topher DeRosia</a>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em> </p>\n</div>\n</div>\n\n\n\n<p> <em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em> </p>"},
{"title": "People of WordPress: Kori Ashton", "content": "<p><em>You’ve probably heard that WordPress is open-source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>The beginning</strong></h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"631\" src=\"https://i2.wp.com/wordpress.org/news/files/2020/02/kori-ashton.jpg?resize=632%2C631&amp;ssl=1\" alt=\"\" class=\"wp-image-8349\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2020/02/kori-ashton.jpg?w=960&amp;ssl=1 960w, https://i2.wp.com/wordpress.org/news/files/2020/02/kori-ashton.jpg?resize=300%2C300&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2020/02/kori-ashton.jpg?resize=150%2C150&amp;ssl=1 150w, https://i2.wp.com/wordpress.org/news/files/2020/02/kori-ashton.jpg?resize=768%2C767&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"><figcaption>Kori Ashton</figcaption></figure>\n\n\n\n<p>In 1998, Kori created her very first HTML website. Her dad was creating websites for a living at the time. She needed a website for her band because she wanted to be a rockstar. Under his training, and with a little bit of self-teaching, she learned how to build a website.</p>\n\n\n\n<p>She had been aware of WordPress since 2005, and, in 2008 a client specifically hired her as a freelancer to develop a WordPress website. Kori went straight to Google and taught herself how to build a WordPress website over a single weekend. She really enjoyed the experience of working with WordPress.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>My mind was absolutely blown when I saw the drag and drop options inside of menus to create dropdowns and a form builder. </em></p><cite>Kori Ashton</cite></blockquote>\n\n\n\n<p>She suggested to her dad that WordPress could be a solution for their customers who wanted to be able to access their own websites. Previously, they had found this was not as easy for clients unless they had specific software and knew how to code. So, Kori and her dad worked to learn WordPress over the next few years. </p>\n\n\n\n<p>Then in 2012, Kori and her parents launched their new business, WebTegrity, in San Antonio, Texas, US. It started out small: just Kori and her parents. Soon, they started subcontracting design work and quickly continued to grow their team.</p>\n\n\n\n<h2><strong>Going big time</strong></h2>\n\n\n\n<p>Even though the business was in a saturated industry in San Antonio — over 700 freelancers and agencies were providing similar services —  Kori and her parents were able to sell their company five years later, with a multi-million dollar valuation. There were a few choices they made early on that led to that success.</p>\n\n\n\n<h3><strong>1. They picked a niche: WordPress specialists </strong></h3>\n\n\n\n<p>At the time, there were no WordPress-specific agencies in San Antonio. They emphasized the fact that WordPress was the only CMS their company would use. Prospective clients looking for a different type of CMS solution were not the right fit for their business. They also offered on-site, WordPress training and weekend workshops that were open to anyone (including other agencies) as one of their revenue streams. They soon were established as a city-wide WordPress authority.</p>\n\n\n\n<h3><strong>2. They cultivated a culture</strong></h3>\n\n\n\n<p>Kori wanted a great culture and environment in her company and to make that happen, she needed to hire the right people. She believes you must be careful about who you bring into the culture of your business, but particularly when hiring leaders into that community. You can’t teach passion so you’ve got to find people that are excited about what you do. You also need to look for integrity, creativity, a love for solving problems, and an eagerness to keep getting better. </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>You can teach code all day long, but be sure to find people with the right hearts to join your community and then train them up the right way. This way you will grow your culture in a healthy way.</em></p><cite>Kori Ashton</cite></blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"660\" src=\"https://i0.wp.com/wordpress.org/news/files/2020/02/kori-ashton-2.png?resize=632%2C660&amp;ssl=1\" alt=\"\" class=\"wp-image-8350\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2020/02/kori-ashton-2.png?w=711&amp;ssl=1 711w, https://i0.wp.com/wordpress.org/news/files/2020/02/kori-ashton-2.png?resize=287%2C300&amp;ssl=1 287w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"><figcaption>Kori and her two sons</figcaption></figure>\n\n\n\n<h3><strong>3. They learned how to build sustainable revenue streams</strong></h3>\n\n\n\n<p>Like many other web development agencies, WebTegrity started out with the “one-time fee and you’re done” business model. This business model is known for unpredictable revenue streams. Hearing about recurring revenue business models at WordCamp Austin was a lightbulb moment for Kori. She started drafting a more sustainable business model on the way back home. </p>\n\n\n\n<p>Support packages were key to their new business plan. Clients needed ongoing support. They decided to include at least 12 months of post-launch support into their web development projects. This doubled their revenue in one year and allowed them to even out their revenue streams.</p>\n\n\n\n<h3><strong>4. They knew the importance of reputation</strong></h3>\n\n\n\n<p>Kori believes that every client, whether they have a $5,000 or a $50,000 budget, should get the same type of boutique-style, white glove, concierge relationship.</p>\n\n\n\n<p>Every single project results in the absolute best solution for a client’s needs. In addition to that, offering training helped boost their reputation. Explaining the lingo of the web development and SEO fields and showing the processes used, added transparency. It helped set and meet expectations and it built trust. </p>\n\n\n\n<h3><strong>5. They proactively gave back to the community</strong></h3>\n\n\n\n<p>Kori heard Matt Mullenweg speak about <a href=\"https://wordpress.org/five-for-the-future/\">Five For The Future</a> at WordCamp US. He encouraged people in the audience who make a living using WordPress, to find ways to give back 5% of their time to building the WordPress software and community. Matt talked about how firms and individuals could give back to the community. He suggested, for instance to:</p>\n\n\n\n<ul><li>start a WordPress Meetup group</li><li>present at a Meetup event </li><li>facilitate a Meetup group where maybe you’re just the organizer and you never have to speak because you’re not a fan of speaking</li><li>help organize a WordCamp</li><li>volunteer at a WordCamp</li><li>write a tutorial and tell people how to do WordPress related things </li><li>run a workshop</li><li>make a video</li></ul>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1500\" height=\"1001\" src=\"https://i1.wp.com/wordpress.org/news/files/2020/02/kori-ashton-3.jpg?fit=632%2C422&amp;ssl=1\" alt=\"\" class=\"wp-image-8351\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2020/02/kori-ashton-3.jpg?w=1500&amp;ssl=1 1500w, https://i1.wp.com/wordpress.org/news/files/2020/02/kori-ashton-3.jpg?resize=300%2C200&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2020/02/kori-ashton-3.jpg?resize=1024%2C683&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2020/02/kori-ashton-3.jpg?resize=768%2C513&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2020/02/kori-ashton-3.jpg?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>If you’re making an income using WordPress, consider giving 5% of your time back to building the software and/or the community.</figcaption></figure>\n\n\n\n<p>This gave Kori another light bulb moment. She could make videos to give back. So her way to give back to the WordPress community is her <a href=\"https://www.youtube.com/user/webtegrity\">YouTube channel</a>.</p>\n\n\n\n<p>Every Wednesday, she published a video on how to improve your online marketing. This made a huge impact, both inside the WordPress community, but also in her own business.</p>\n\n\n\n<h2><strong>Understanding</strong></h2>\n\n\n\n<p>So, in summary, how did Kori and her family turn their business into a multi-million dollar buyout in just five years? </p>\n\n\n\n<p>Ultimately, it was about understanding that you have to build value. About keeping an exit strategy in mind while building your business. For instance when naming your company. Will it stand alone? Could it turn into a brand that you could sell as an independent entity?</p>\n\n\n\n<ul><li>Think about revenue streams and watch sales margins.</li><li>Be sure to include healthy margins. </li><li>Don’t hire until you have no further option.</li><li>Make sure to structure your offerings in such a way that you’re actually recouping your value. </li><li>Understand entrepreneurship, watch Shark Tank, read more tutorials, watch more videos.</li><li>Get involved in the WordPress community. Get to know its core leaders, the speakers that travel around to all the WordCamps. Start following them on Twitter and try to understand what they’re sharing. </li></ul>\n\n\n\n<p>In the end, the fact that Kori was so active in the San Antonio community helped enable the sale.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>We just kept hammering on the fact that we were the go-to place here in San Antonio for WordPress. We kept training, we kept doing free opportunities, going out and speaking at different events, and people kept seeing us. We kept showing up, kept giving back and kept establishing ourselves as the authority.</em></p><cite>Kori Ashton</cite></blockquote>\n\n\n\n<h2><strong>Contributors</strong></h2>\n\n\n\n<p>Alison Rothwell (<a href=\"https://profiles.wordpress.org/wpfiddlybits/\">@wpfiddlybits</a>), Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\">@yvettesonneveld</a>), Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\">@webcommsat</a>),  Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>), Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\">@topher1kenobe</a>). Thank you to Kori Ashton (<a href=\"https://profiles.wordpress.org/koriashton/\">@koriashton</a>) for sharing his #ContributorStory.</p>\n\n\n\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:33.33%\">\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"474\" src=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=632%2C474&amp;ssl=1\" alt=\"\" class=\"wp-image-7025\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?w=1024&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2019/07/heropress_large_white_logo.jpg?resize=768%2C576&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n</div>\n\n\n\n<div class=\"wp-block-column\" style=\"flex-basis:66.66%\">\n<p><em>This post is based on an <a href=\"https://heropress.com/essays/build-company-wordpress/\">article originally published on HeroPress.com</a>, a community initiative created by </em><a href=\"https://profiles.wordpress.org/topher1kenobe/\"><em>Topher DeRosia</em></a><em>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em></p>\n</div>\n</div>\n</div></div>\n</div></div>"},
{"title": "People of WordPress: Jill Binder", "content": "<p><em>You’ve probably heard that WordPress is open-source software, and may know that it’s created and run by volunteers. WordPress enthusiasts share many examples of how WordPress changed people’s lives for the better. This monthly series shares some of those lesser-known, amazing stories.</em></p>\n\n\n\n<h2><strong>Meet Jill Binder</strong></h2>\n\n\n\n<p>Jill Binder never meant to become an activist. She insists it was an accident.</p>\n\n\n\n<p>Despite that, Jill has led the Diversity Outreach Speaker Training working group in the WordPress Community team since 2017. This group is dedicated to increasing the number of women and other underrepresented groups who are stepping up to become speakers at WordPress Meetups, WordCamps, and events. </p>\n\n\n\n<h2><strong>Jill’s back story</strong></h2>\n\n\n\n<h3><strong>Internship</strong></h3>\n\n\n\n<p>Jill’s WordPress story begins in 2011, in Vancouver, Canada. Jill secured an internship for her college program, working on a higher education website that was built in WordPress. As a thank you, her practicum advisor bought Jill a ticket to WordCamp Vancouver 2011: Developer’s Edition. After that Jill began freelancing  with WordPress as a Solopreneur. </p>\n\n\n\n<h3><strong>First steps in the WordPress community</strong></h3>\n\n\n\n<p>The following year her internship advisor, who had become a client, was creating the first ever BuddyCamp for BuddyPress. He asked Jill to be on his organizing team. At that event she also moderated a panel that had Matt Mullenweg on it. Then, Jill was invited to be on the core organizing team for WordCamp Vancouver.</p>\n\n\n\n<p>Part of this role meant reviewing and selecting speakers. From 40 speaker applications that could be a fit the team had to pick only 14 to speak.</p>\n\n\n\n<h2><strong>The diversity challenge when selecting speakers</strong></h2>\n\n\n\n<p>For anyone who has organized a conference, you know that speaker selection is hard. Of the 40 applications, 7 were from women, and the lead organizer selected 6 of those to be included in the speaker line up.</p>\n\n\n\n<p>At this point Jill wasn’t aware that very few women apply to speak at tech conferences and suggested selection should be made on the best fit for the conference. The team shared that not only did they feel the pitches were good and fit the conference, but they also needed to be accepted or the Organizers would be criticized for a lack of diversity.</p>\n\n\n\n<p>Selecting women for fear of criticism is embarrassing to admit, but that’s how people felt in 2013.</p>\n\n\n\n<p>By the time the event happened, though, the number of women speakers dropped to 4. And with an additional track being added, the number of speakers overall was up to 28. Only 1 speaker in 7 was a woman (or 14%) and attendees did ask questions and even blogged about the lack of representation.</p>\n\n\n\n<h2><strong>What keeps women from applying?</strong></h2>\n\n\n\n<p>Later that year at  WordCamp San Francisco—the biggest WordCamp at the time (before there was a WordCamp US)—Jill took the opportunity to chat with other organizers about her experience. She found out that many organizers had trouble getting enough women to present.</p>\n\n\n\n<p>Surprisingly Vancouver had a high number of women applicants in comparison to others, and the consensus was more would be accepted  if only more would apply.</p>\n\n\n\n<p>Jill decided that she  needed to know why this was happening? Why weren’t there more women applying? She started researching, reading, and talking to people.</p>\n\n\n\n<p>Though this issue is complex, two things came up over and over:</p>\n\n\n\n<ul><li>“What would I talk about?”</li><li>“I’m not an expert on anything. I don’t know enough about anything to give a talk on it.”</li></ul>\n\n\n\n<h2><strong>A first workshop with encouraging results</strong></h2>\n\n\n\n<p>Then Jill had an idea. She brought up the issue at an event and someone suggested that they should get women together in a room and brainstorm speaker topics.</p>\n\n\n\n<p>So Jill became the lead of a small group creating a workshop in Vancouver: the talented Vanessa Chu, Kate Moore Hermes, and Mandi Wise. In one of the exercises that they created, participants were invited to brainstorm ideas—this proved that they had literally a hundred topic ideas and the biggest problem then became picking just one!</p>\n\n\n\n<p>In the first workshop, they focussed on:</p>\n\n\n\n<ul><li>Why it matters that women (<em>added later: diverse groups</em>) are in the front of the room</li><li>The myths of what it takes to be the speaker at the front of the room (aka beating impostor syndrome)</li><li>Different presentation formats, especially story-telling</li><li>Finding and refining a topic</li><li>Tips to become a better speaker</li><li>Leveling up by speaking in front of the group throughout the afternoon</li></ul>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"600\" height=\"400\" src=\"https://i1.wp.com/wordpress.org/news/files/2019/12/image-2.png?resize=600%2C400&amp;ssl=1\" alt=\"women gathering to discussion presentation topics\" class=\"wp-image-8195\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2019/12/image-2.png?w=600&amp;ssl=1 600w, https://i1.wp.com/wordpress.org/news/files/2019/12/image-2.png?resize=300%2C200&amp;ssl=1 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><figcaption>Vancouver Workshop 2014</figcaption></figure>\n\n\n\n<h2><strong>Leading to workshops across North America and then the world</strong></h2>\n\n\n\n<p>Other cities across North America heard about the workshop and started hosting them, adding their own material.</p>\n\n\n\n<p>Many women who initially joined her workshop wanted help getting even better at public speaking. So Jill’s Vancouver team added in some material created from the other cities and a bit more of their own. Such as:</p>\n\n\n\n<ul><li>Coming up with a great title</li><li>Writing a pitch that is more likely to get accepted</li><li>Writing a bio</li><li>Creating an outline</li></ul>\n\n\n\n<p>At WordCamp Vancouver 2014—only one year since Jill started—there were 50% women speakers and 3 times the number of women applicants! Not only that, but this WordCamp was a Developer’s Edition, where it’s more challenging to find women developers in general, let alone those who will step up to speak.</p>\n\n\n\n<h3><strong>More work is needed!</strong></h3>\n\n\n\n<p>Impressive as those results were, the reason Jill is so passionate about this work is because of what happened next:</p>\n\n\n\n<ul><li>Some of the women who attended the workshop stepped up to be leaders in the community and created new content for other women.</li><li>A handful of others became WordCamp organizers. One year Vancouver had an almost all-female organizing team – 5 out of 6!</li><li>It also influenced local businesses. One local business owner loved what one of the women speakers said so much that he hired her immediately. She was the first woman developer on the team, and soon after she became the Senior Developer.</li></ul>\n\n\n\n<h2><strong>Diversity touches on many levels</strong></h2>\n\n\n\n<p>Jill has seen time and again what happens when different people speak at the front of the room. More people feel welcome in the community. The speakers and the new community members bring new ideas and new passions that help to make the technology we are creating more inclusive. And together we generate new ideas that benefit everyone.</p>\n\n\n\n<p>This workshop was so successful, with typical results of going from 10% to 40-60% women speakers at WordCamps, that the WordPress Global Community Team asked Jill to promote it and train it for women and all diverse groups around the world. In late 2017, Jill started leading the Diverse Speaker Training group (<a href=\"https://make.wordpress.org/community/tag/wpdiversity/\">#wpdiversity</a>).</p>\n\n\n\n<p>Dozens of community members across the world have now been trained to lead the workshop. With now dozens of workshops worldwide, for WordPress and other open source software projects as well, there is an increase in speaker diversity. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"2048\" height=\"1536\" src=\"https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?fit=632%2C474&amp;ssl=1\" alt=\"Diverse Speaker Training group \" class=\"wp-image-8196\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?w=2048&amp;ssl=1 2048w, https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?resize=300%2C225&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?resize=1024%2C768&amp;ssl=1 1024w, https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?resize=768%2C576&amp;ssl=1 768w, https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?resize=1536%2C1152&amp;ssl=1 1536w, https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?w=1264&amp;ssl=1 1264w, https://i0.wp.com/wordpress.org/news/files/2019/12/image-3.png?w=1896&amp;ssl=1 1896w\" sizes=\"(max-width: 632px) 100vw, 632px\"><figcaption>WordCamp US 2019</figcaption></figure>\n\n\n\n<p>As a result of the success, Jill is now sponsored to continue the program. The first sponsor is Automattic. She’s proud of how the diversity represented on the stage adds value not only to the brand but also in the long-term will lead to the creation of a better product. She’s inspired by seeing the communities change as a result of the new voices and new ideas at the WordPress events.</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Jill’s leadership in the development and growth of the Diversity Outreach Speaker Training initiative has had a positive, measurable impact on WordPress community events worldwide. When WordPress events are more diverse, the WordPress project gets more diverse — which makes WordPress better for more people.”</em></p><cite><em> Andrea Middleton, Community organizer on the WordPress open source project</em></cite></blockquote>\n\n\n\n<h3><strong>Resources:</strong></h3>\n\n\n\n<ul><li>The Workshop: <a href=\"http://diversespeakers.info/\">http://diversespeakers.info/</a></li><li>More information: <a href=\"https://tiny.cc/wpdiversity\">https://tiny.cc/wpdiversity</a></li><li><a href=\"https://make.wordpress.org/community/handbook/wordcamp-organizer/planning-details/speakers/building-a-diverse-speaker-roster/\">How to build a diverse speaker roster</a></li><li><a href=\"https://make.wordpress.org/community/2017/11/13/call-for-volunteers-diversity-outreach-speaker-training/\">Diversity Outreach Speaker Training Team</a></li></ul>\n\n\n\n<h2><strong>Contributors</strong></h2>\n\n\n\n<p>Alison Rothwell (<a href=\"https://profiles.wordpress.org/wpfiddlybits/\">@wpfiddlybits</a>), Yvette Sonneveld (<a href=\"https://profiles.wordpress.org/yvettesonneveld/\">@yvettesonneveld</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>), Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\">@topher1kenobe</a>)</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img loading=\"lazy\" src=\"https://lh6.googleusercontent.com/fq6qus5qmviDZaznrQnW-4wcbSs6NSrqeqEEGnPjgi2WJrVevNm4Em4KsP-VVH_0kMgWuNtW7mm_V9-hKtrrJFohRi6KrUXAoLHjrymChCltMr9fuh4dBIu_0SqNPts0MZgcvh_W\" alt=\"\" width=\"153\" height=\"115\"></figure></div>\n\n\n\n<p><em>This post is based on an article originally published on HeroPress.com, a community initiative created by </em><a href=\"https://profiles.wordpress.org/topher1kenobe/\"><em>Topher DeRosia</em></a><em>. HeroPress highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p></p>\n\n\n\n<p><em>Meet more WordPress community members over at </em><a href=\"https://heropress.com/\"><em>HeroPress.com</em></a><em>!</em></p>\n\n\n\n<p><em><strong>Correction: December 7, 2019</strong><br>The original article mentioned the team Jill lead, but did not mention the team members who joined her. Those have been added. Apologies to Vanessa, Kate, and Mandi. 🙂 </em></p>"},
{"title": "People of WordPress: Tijana Andrejic", "content": "<p><strong>WordPress is open source software, maintained by a global network of contributors. There are many examples of how WordPress has changed people’s lives for the better. In this monthly series, we share some of the amazing stories.</strong></p>\n\n\n\n<p>This month to coincide with WordCamp Europe, we feature Tijana Andrejic from Belgrade, Serbia, about her journey from fitness trainer to the WordPress world, with the freelance and corporate opportunities it introduced. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"387\" src=\"https://i0.wp.com/wordpress.org/news/files/2021/06/2021-07-Tijana-Andrejic_Featured-Img_1.jpg?resize=632%2C387&amp;ssl=1\" alt=\"Tijana - portrait picture\" class=\"wp-image-10713\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2021/06/2021-07-Tijana-Andrejic_Featured-Img_1.jpg?w=1024&amp;ssl=1 1024w, https://i0.wp.com/wordpress.org/news/files/2021/06/2021-07-Tijana-Andrejic_Featured-Img_1.jpg?resize=300%2C184&amp;ssl=1 300w, https://i0.wp.com/wordpress.org/news/files/2021/06/2021-07-Tijana-Andrejic_Featured-Img_1.jpg?resize=768%2C470&amp;ssl=1 768w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>As a professional manager with a college degree in Organizational Science and a certified fitness instructor, Tijana is nothing if not driven and goal-oriented. </p>\n\n\n\n<p>Following her time as a fitness trainer, Tijana moved to work in IT around 2016. She first explored content creation and design before focusing on SEO and becoming an independent specialist.  </p>\n\n\n\n<p>Tijana was hired as a Customer Happiness Engineer for a hosting company, where she discovered the benefits of having a team. She realized that having close working relationships with colleagues is helpful for business success and accelerates personal growth.</p>\n\n\n\n<p>Tijana hopes that by sharing her story, she can help others who are either starting their career or are moving roles. She describes the opportunities she discovered in the WordPress community as ‘a huge epiphany’, especially in the world of freelancing.</p>\n\n\n\n<p>She highlights <strong>5 things that helped her to start a new freelancing career</strong>. Let’s dive into them.</p>\n\n\n\n<h2>What motivates me?</h2>\n\n\n\n<p>“Why am I doing this?” is the first question that Tijana asks herself before starting anything new. This self-review and honesty, she feels, allows her to determine her priorities. She also benchmarks options around her motivations of wanting a flexible schedule and to grow professionally. </p>\n\n\n\n<p>She lists the reasons to make a particular choice, like being a freelancer, to help her choose the right job, pathway, or identify alternatives. </p>\n\n\n\n<p>She recommends that others can take a similar approach. If freelancing is still the best solution after examining all their goals and motivations, Tijana believes a good next step would be to learn WordPress-related skills.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/cdHeIL-H_mE6QFCUxUT-gfKS2GzizRHtn4iCENoaWOimC82BfModRJh44QbhvHPW0GNVP5eUPhgxQteDRbA_9EUzpssTXMGWje1hUuKyrfXUgGhCnvXQdraaUQiaGBjFr73dNYxr\" alt=\"WordCamp Europe 2019 group picture\"></figure>\n\n\n\n<h2>Develop WordPress related skills</h2>\n\n\n\n<p>The next question you may ask: “Why WordPress?”</p>\n\n\n\n<p>WordPress is used by more than 40% of websites in some form and offers various roles, many of which are not developer-specific. Tijana highlights a few: </p>\n\n\n\n<ul><li>web developer (coding websites, themes, and plugins)</li><li>web implementor (creating websites from existing themes without coding)</li><li>web designer (designing website mock-ups, editing images, or creating online infographics)</li><li>client support professional (helping people with their websites)</li><li>website maintenance (WordPress, themes, and plugins are maintained and backed up regularly)</li><li>WordPress trainer (helping clients with how to use the platform or teaching other web professionals)</li><li>content writer</li><li>accessibility specialist (making sure standards are met and suggesting solutions for accessibility barriers)</li><li>SEO consultant (improving search outcomes and understanding)</li><li>statistics consultant, especially for web shops</li><li>WordPress assistant (adding new content and editing existing posts)</li><li>website migration specialist (moving websites from one server to another)</li><li>web security specialist</li></ul>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/16XExYT_P4R4PX3orOaWbueDfkBIA6PFQ-CuYEXdeN9AvUIuIF33aIjT1DpdnFCqhrijWv1f68OR2Qh14xGT9REHGJ-MqK-OxJ9XcrhZ3IkcW8DBI7nVAtvFcCnCHL0woka_FV6t\" alt=\"WCBGD group picture\"></figure>\n\n\n\n<p>Tijana emphasized: “Another reason why WordPress is great for freelancers is the strong community that exists around this content management system (CMS).” WordCamps and Meetups are a way to get useful information and meet people from a large and very diverse community and get answers to many questions straight away. </p>\n\n\n\n<p>In the past year, these events have been primarily online. However, the contributors who run them continue to make an effort to provide an experience as close to in-person events as possible. The biggest advantage to online events is that we can attend events from across the world, even if sometimes during these difficult times, it is difficult to get enough time to deeply into this new experience. Since Tijana’s first Meetup, she has attended many WordPress community events and volunteered as a speaker.</p>\n\n\n\n<h2>Plan in advance</h2>\n\n\n\n<p>Becoming a freelancer takes time. For Tijana, success came with proper planning and following her plan to ‘acquire or improve relevant skills that will make you stand out in the freelance market.’ She strongly believes that learning and growing as a professional opens more business opportunities. </p>\n\n\n\n<p>If you are considering a freelance career, she advises improving relevant skills or developing new skills related to your hobbies as ‘there is nothing better than doing what you love.’ In cases where no previous experience and knowledge can be used, she suggests choosing ‘a job that has a shorter learning curve and builds your knowledge around that.’</p>\n\n\n\n<p>Tijana started as a content creator and learned to become an SEO expert. However, she highlights many alternative paths, including starting as a web implementer and moving to train as a developer. </p>\n\n\n\n<p>She suggests to others: “It would be a good idea to analyze the market before you jump into the learning process.” She also recommends people check the latest trends and consider the future of the skills they are developing.</p>\n\n\n\n<p>Visit the new <a href=\"https://learn.wordpress.org/\">Learn WordPress.org</a> to see what topics are of interest to you. In this newly established resource, the WordPress community aggregates workshops to support those who want to start and improve their skills, provides lesson plans for professional WordPress trainers and helps you create personal learning to develop key skills. There is also material on helping you be part of and organize events for your local community.</p>\n\n\n\n<p>Tijana highlights that there are many places for freelancers to find clients. For example, the WordPress Community has a place where companies and individual site owners publish their job advertisements  – <a href=\"https://jobs.wordpress.net/\">Jobs.WordPress.net</a>.</p>\n\n\n\n<h2>Hurray, it’s time to get a first freelancing job</h2>\n\n\n\n<p>As a pragmatic person, Tijana recommends: “Save money before quitting your job to become a full-time freelancer. Alternatively, try freelancing for a few hours per week to see if you like it. Although some people do benefit when taking a risk, think twice before you take any irreversible actions.” </p>\n\n\n\n<p>She shared some possible next steps: </p>\n\n\n\n<ul><li>use a freelancing platform</li><li>triple-check your resume</li><li>professionally present yourself</li><li>fill up your portfolio with examples</li><li>use video material</li></ul>\n\n\n\n<p>“By using video material, your clients will not see you like a list of skills and previous experiences, but as a real person that has these skills and experiences and that provides a certain service for them.”</p>\n\n\n\n<p>She adds: “Have a detailed strategy when choosing your first employer. Choose your first employer wisely, very wisely. I can’t emphasize enough how important this is”.</p>\n\n\n\n<p>When Tijana took her first freelancing job, she considered the following:</p>\n\n\n\n<ul><li>how was the employer rated by other freelancers who worked for him previously</li><li>how does the employer rate other freelancers</li><li>how much money had they already spent on the platform</li><li>the number of open positions for a specific job and the number of freelancers that have already applied </li></ul>\n\n\n\n<p>“The first job is not all about the money. Don’t get greedy on your first job. If you get good recommendations, your second job can pay two to three times more. And your third job can go up to five times more. That was my experience.”</p>\n\n\n\n<h2>Take responsibility as a freelancer</h2>\n\n\n\n<p>Tijana reminds us: “Freedom often comes with responsibility; individual responsibility is key when it comes to freelancing.”</p>\n\n\n\n<p>She advises others not to take a job if you can not make a deadline and have someone reliable who can help you. </p>\n\n\n\n<p>Missing deadlines will cost your client money and affect the review the client will be willing to leave about your job, and this can have a big impact on your future opportunities or freelance jobs.</p>\n\n\n\n<p>She adds: “This can start a downward spiral for your career. However, we are all humans, and unpredictable things can happen. If for some reason you are not able to complete your work in a timely manner, let your client know immediately so they can have enough time to hire someone else”.</p>\n\n\n\n<p>Tijana emphasizes the importance of making expectations clear before accepting a job, both what the client is expecting and what you can expect from the client. </p>\n\n\n\n<p>Lastly, she points out that if you are working from home, your friends and family should treat you the way they would if you were in an office. She advises: “Let them know about your working schedule.”</p>\n\n\n\n<p>She hopes that these basic guidelines will be useful in launching freelance careers, as they did her, even though there is no universal recipe for all.</p>\n\n\n\n<p>Tijana highlights: “It’s just important to stay focused on your goals and to be open to new opportunities.” Freelancing wasn’t the only way she could have fulfilled her goals, but it was an important part of her path, and it helped her be confident in her abilities to make the next big step in her life.</p>\n\n\n\n<p>As a freelancer, she was missing close relationships with colleagues and teamwork, which she has now found in her current firm. Her colleagues describe her as a: “walking-talking bundle of superpowers: sports medicine and fitness professional, SEO expert, blogger, designer and a kitty foster mum”.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/PIGT9R6FmtEHsNBvWzyViW5htRAm156asTOsohOGOUwfsWjW1TuDhUI9yuZnjIe-1eFHfFUWPULPtw82P3YYXHa0bsY_jA5keelmDHfSkTdd3xUsVZTmG9KvdE8XTojvU3LxYCsi\" alt=\"Conference reception\"></figure>\n\n\n\n<p>If you are considering starting your career as a freelancer, take the courses offered at <a href=\"https://learn.wordpress.org/\">learn.wordpress.org,</a> reach out to companies that you would be interested in working with, and remember that there are a whole host of opportunities in the WordPress project.</p>\n\n\n\n<p><a href=\"https://make.wordpress.org/\">The WordPress.org Teams</a> – what they do, when and where they meet</p>\n\n\n\n<p><a href=\"https://learn.wordpress.org/\">Learn WordPress resource</a> – free to use to expand your knowledge and skills of using the platform and learning about the community around it.</p>\n\n\n\n<p>The three-day <a href=\"https://europe.wordcamp.org/2021/\">WordCamp Europe 2021</a> online event begins on 7 June 2021. You can discover more about being a contributor in its live sessions and <a href=\"https://europe.wordcamp.org/2021/contribute-to-wordpress/\">section on ways to contribute to WordPress</a>.</p>\n\n\n\n<h2>Contributors</h2>\n\n\n\n<p>Thanks to Olga Gleckler (<a href=\"https://profiles.wordpress.org/oglekler/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>oglekler</a>), Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\">@webcommsat</a>), Chloé Bringmann (<a href=\"https://profiles.wordpress.org/cbringmann/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>cbringmann</a>), Surendra Thakor (<a href=\"https://profiles.wordpress.org/sthakor/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>sthakor</a>), and Meher Bala (<a href=\"https://profiles.wordpress.org/meher/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>meher</a>) for working on this story. Thank you to Tijana Andrejic (<a href=\"https://profiles.wordpress.org/andtijana/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>andtijana</a>) for sharing her Contributor Story, and to Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>) and Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\">@topher1kenobe</a>) for their support of the series.</p>\n\n\n\n<p><em>This People of WordPress feature is inspired by an article originally published on HeroPress.com, a community initiative created by Topher DeRosia. The initiative highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard. Meet more WordPressers in our <a href=\"https://wordpress.org/news/category/newsletter/interviews/\">People of WordPress series.</a></em></p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/FEZ2FQJ0vQ311YoPfh6ny15NXh8saTLH_RjyDO4pUOuEGBTa-Czk63PGoWL04FawKviRfNx0QXePx-goK04X12ry1BR_WXh-kVPIfsEeItPAX6reN5fHS96q6-8dUI506ZO38Z0G\" alt=\"HeroPress logo\"></figure>\n\n\n\n<p><em>#ContributorStory #HeroPress</em></p>"},
{"title": "People of WordPress: Olga Gleckler", "content": "<p><em>WordPress is open source software, maintained by a global network of contributors. There are many examples of how WordPress has changed people’s lives for the better. In this monthly series, we share some of the amazing stories that are lesser-known.</em></p>\n\n\n\n<p><strong>From a natural interest in computers and fixing things as a young woman, Olga Gleckler from St Petersburg, Russia, found WordPress took her on a journey to becoming a successful female tech entrepreneur. On International Women’s Day, we share her story.  </strong></p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?resize=580%2C768&amp;ssl=1\" alt=\"Olga with a WordCamp Vienna t-shirt\" class=\"wp-image-9878\" width=\"580\" height=\"768\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?resize=773%2C1024&amp;ssl=1 773w, https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?resize=226%2C300&amp;ssl=1 226w, https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?resize=768%2C1018&amp;ssl=1 768w, https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?resize=1159%2C1536&amp;ssl=1 1159w, https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?resize=1546%2C2048&amp;ssl=1 1546w, https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?w=1932&amp;ssl=1 1932w, https://i2.wp.com/wordpress.org/news/files/2021/03/WCEU-2020-online.jpg?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 580px) 100vw, 580px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<h2><strong>Finding your path can take longer than you expect</strong></h2>\n\n\n\n<p>From the age of 15, Olga found herself under pressure to find a free place for her professional studies. She said: “I didn’t know how high or low my chances were even if I had very good marks. I could have been just the biggest fish in a small pond. But anyway, I made up my mind to go to technical school.”</p>\n\n\n\n<p>On leaving school in St Petersburg with her certificate, Olga felt her knowledge of opportunities was very narrow. She had pictured being an ecologist or guide translator based on the subjects she had been taught at school. There was also an advertising boom in Russia and she began to explore this as a career avenue. She had developed her computer skills and found opportunities to practise by helping her teachers with administrative work.</p>\n\n\n\n<p>Though she did not have access to any formal career advice, her journey led her into programming. She said: “The range of technical schools was not wide. I spent four years studying transistor markings, soldering and drawing PCB layouts. Programming courses using Pascal didn’t do anything useful with it.”</p>\n\n\n\n<p>A lack of suitable access to English-language courses made things harder for Olga. She was determined that she would master the language later in her life. In the meantime, she left technical school with an honors degree and improved typing skills.</p>\n\n\n\n<p>“I faced it was a wild, unfriendly market. I didn’t know how to recognize a genuine job offer or how to avoid the bad ones. It was difficult and I don’t know how long I would’ve looked for work without help.”</p>\n\n\n\n<h2><strong>Think differently to find where you belong</strong></h2>\n\n\n\n<p>Olga’s father worked in an IT company and was able to give her some advice and help with potential introductions. When she was still studying, he suggested her strong technical skills might be useful as a substitute typist. When she finished her studies, he helped her apply for a job updating a legal system on clients’ computers.<br><br>Six months later, she got a full-time job in the same service department. She liked her position and her clients. However, she was given friendly advice that without a university degree she would not be able to have any further promotions.</p>\n\n\n\n<p>At this time, Olga was trying to study PHP from a book. She found it very exciting at first, but a lot of their functions did not give her explanations on how to build something useful. She found when she tried to build practical items from book reading, it did not always make sense and the solutions would often fail. </p>\n\n\n\n<p>She said: “It was hard to admit a failure even to myself and it was nagging me for a long time. I had to choose something I could handle, that I was interested in and could afford. It turned out to be advertising.”</p>\n\n\n\n<p>She spent most of the family’s holidays on learning sessions during the next six years. Olga recalled: “It was tricky for my husband to make me leave a computer, once I was glued to it, so he bought me my first laptop. English was still hard for me, I got high marks through just memorizing all the words in a textbook and how they should sound.”</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><strong>Doubting your professional skills can happen when you are at home isolated looking after children. Keeping up your interests is important.</strong></p></blockquote>\n\n\n\n<p>Olga’s life took a change after having a new baby and she spent three years doubting her professional skills and her chances of getting a good job. She tried to get back into other interests through studying, baking and drawing, but found ‘the pram was pulling me back’. She found she became very isolated and felt less able to contribute as the family was relying on her husband’s income as she tried to focus on looking forward.</p>\n\n\n\n<p>She said: “I was convinced (and saw) that not too many companies wanted a woman in the office, who with a small baby might need lots of leave.”</p>\n\n\n\n<p>She finished her education when she returned to work after three years caring for her son. She secured a promotion but with changes in the company’s staffing, things were tense. She found the difficulties there had become more heightened and felt that young female colleagues were treated as ‘pieces of furniture’ by one manager. She did not want to stay in this environment and in a few months time decided to leave.</p>\n\n\n\n<h2><strong>Your next chapter may be nearby</strong></h2>\n\n\n\n<p>Determined to not repeat this type of experience, Olga looked at the brighter side. She said: “I wanted to be a marketer. Knowing how tricky it is to sell intangibles, I wanted a solid product to work with.” </p>\n\n\n\n<p>It turned out to be more difficult to find a job outside traditional IT as a young mother. Some human resource officers advised her to remain within the technology arena.</p>\n\n\n\n<p>Olga remained hopeful and continued to study hard. She had many learning experiences along the way, which she hopes others can learn from too. One was setting a low bar to employers. She said: “Companies I worked in wanted to get all publicity and sales increases achieved through deductions from my salary.” This happened once and the next time she was in this situation she asked specifically about the budget before signing up. “I was assured this would not be the case, but again I found the budget for publicity came out of my wages. It was a tough period of disappointments. So when I was offered a part-time administrative job with basic sick leave, I took it gladly as a reprieve.”</p>\n\n\n\n<p>The job was far from home and involved a lot of travelling. Olga spent two to three hours a day on buses with Harry Potter audio books for company. “In these traffic jams, I started to feel English at last and loved it. It gave me a freedom no money can buy. Life was getting better.” </p>\n\n\n\n<p>Though the job did not pay highly, it gave her something valuable – a working website. After her boss and the developer parted company, she was asked to maintain the site. Through some studying and reverse engineering, she discovered how it worked and it gave her an insight into how to write simple websites from scratch.</p>\n\n\n\n<p>Olga’s first encounter with JavaScript wasn’t easy: “My first JavaScript calculator almost made me crazy, but I pursued it.”</p>\n\n\n\n<p>Quickly she started to get small tasks from friends and relatives, usually to solve some urgent problems and started to meet popular content management systems. One of the first she met with was WordPress. There was an issue in a website theme used by a website which had been changed and not maintained. It took a whole weekend to solve, but she was determined to work it out. Back then, WordPress was ‘just a system’. She didn’t know then how much it was to become part of her life.</p>\n\n\n\n<p>Olga spent the next two years in this role. As time went on, she started to feel worried and less satisfied with the work. The last straw for her was a negative statement from her boss, who was not a programmer and who hadn’t seen any of the work done on the website. She felt the approach was unfair as she had done extensive work on the site. She recalls: “I became angry, but it was exactly what I needed to move jobs.”</p>\n\n\n\n<p>When Olga was job hunting, she didn’t feel she had the courage to apply for a developer’s role, despite the learning and work she had already done. So instead she started working on projects where she felt she was more like a ‘seller of box-ready websites’. It was another tough half a year for her with a lot of work, low payment and plans not turning out as she had hoped. On top of long hours, she ended up with pneumonia. She said: “I see now that I was doing a disservice to customers, websites are not a microwave meal – quick, cheap and dummy. There was no life in the sites without a lot of work which no one was willing to buy. Most of the sites I sold back then died after the first year and they never were truly alive and useful.”</p>\n\n\n\n<h2><strong>You need to be brave and have courage</strong></h2>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?resize=632%2C422&amp;ssl=1\" alt=\"Olga in Berlin wearing the WordPress Code is Poetry lanyard and a WordCamp t-shirt\" class=\"wp-image-9879\" width=\"632\" height=\"422\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?resize=1024%2C684&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?resize=300%2C200&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?resize=768%2C513&amp;ssl=1 768w, https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?resize=1536%2C1025&amp;ssl=1 1536w, https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?w=2048&amp;ssl=1 2048w, https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?w=1264&amp;ssl=1 1264w, https://i2.wp.com/wordpress.org/news/files/2021/03/Berlin-2019.jpg?w=1896&amp;ssl=1 1896w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>Olga really wanted a developer job but seeking jobs of this type was very frustrating. From the job adverts she found, it felt like most IT companies were asking for geniuses who already knew a lot of technologies and frameworks. She found this very demotivating.</p>\n\n\n\n<p>She then found a job offer on a website outside the most popular job portals  and it seemed like a perfect fit. They wanted someone with experience to write from scratch, understand someone else’s code and maintain it, with an ability to translate technical documentation and articles, and make simple designs for printing products. After completing a trial task, she was taken on, and enjoyed a better salary, in a calm environment with good colleagues and without the requirement for a lot of extra hours. </p>\n\n\n\n<p>The advert turned out to be a direct ad from one of the sales departments in a technology company. By succeeding in the  task set, Olga had bypassed the Human Resources team which she felt would not normally have considered her. </p>\n\n\n\n<p>Her boss agreed to her working remotely most of the time. It solved any potential leave problems which Olga had thought may be an obstacle. </p>\n\n\n\n<p>For Olga it had been 14 years since the original decision to become a programmer and it was only the beginning. </p>\n\n\n\n<p>After a few years at what she describes as an ‘amazing experience’ in this workplace, Olga felt able to move on to her next challenge as a developer.</p>\n\n\n\n<h2><strong>Decision-making can benefit from wider knowledge</strong></h2>\n\n\n\n<p>After working with different systems Olga became sure that WordPress is the best CMS for developers and clients. But she was disappointed to find that the ease of use meant that good code was not always a priority for some of the sites she looked at. </p>\n\n\n\n<p>“The biggest flaw of WordPress – it’s so easy to make things work that some may feel they don’t need to bother to do things right, but this becomes a problem later.”</p>\n\n\n\n<p>In custom themes for a site, she also saw sites being made and clients left without any further support, or items hard coded when clients actually needed more control to change regularly.</p>\n\n\n\n<p>Olga used to rely on examples she could easily find, documentation and search engines to improve her understanding in using WordPress. She discovered that just by searching for a specific feature or a solution, you can miss the whole picture. </p>\n\n\n\n<p>She turned to online courses to get more comprehensive knowledge and then started to attend WordPress events, firstly online and then by foot, trains and planes! She discovered a worldwide community that was very much alive. She didn’t know when she started studying online materials and attending discussions that she would end up contributing herself to the <a href=\"https://learn.wordpress.org/\">Learn WordPress</a> platform a few years later.</p>\n\n\n\n<p>WordCamps and contributor days became a big part of her life. From her early days attending events and starting out contributing to WordPress, she is an active member of the WordPress.org Global Marketing and Polyglots Teams, and supported the recent WordPress release. She is just beginning her first WordCamp organiser experience, joining WordCamp Europe 2021 on the Contribute Team. </p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?resize=632%2C602&amp;ssl=1\" alt=\"Olga next to a banner of WordCamp St Petersburg 2018\" class=\"wp-image-9883\" width=\"632\" height=\"602\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?resize=1024%2C976&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?resize=300%2C286&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?resize=768%2C732&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?resize=1536%2C1464&amp;ssl=1 1536w, https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?resize=2048%2C1951&amp;ssl=1 2048w, https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?w=1264&amp;ssl=1 1264w, https://i1.wp.com/wordpress.org/news/files/2021/03/St-Petersburg-2018.jpg?w=1896&amp;ssl=1 1896w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>Olga said: “Through the wider WordPress community, I knew not only where to look but also whom to ask. Most importantly, I found allies who don’t think I’m going crazy by speaking with delight about work, and with whom I share a passion and fondness for WordPress. This is what matters.</p>\n\n\n\n<p>“Now, after more than seven years of full time development, I am still enjoying endless learning, frequent discoveries, mistakes and an impassioned wish to do better.”</p>\n\n\n\n<p>This and a desire to help others use WordPress.org is part of Olga’s continued contribution to its Support and Marketing Teams, and led her to be involved in the Release Marketing questions and answers in 2020.</p>\n\n\n\n<h2><strong>There is no chequered flag on the way</strong></h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"946\" src=\"https://i1.wp.com/wordpress.org/news/files/2021/03/Berlin-2019-1.jpg?resize=632%2C946&amp;ssl=1\" alt=\"Olga at WordCamp Europe in Berlin in 2019\" class=\"wp-image-9881\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2021/03/Berlin-2019-1.jpg?resize=684%2C1024&amp;ssl=1 684w, https://i1.wp.com/wordpress.org/news/files/2021/03/Berlin-2019-1.jpg?resize=200%2C300&amp;ssl=1 200w, https://i1.wp.com/wordpress.org/news/files/2021/03/Berlin-2019-1.jpg?resize=768%2C1151&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2021/03/Berlin-2019-1.jpg?resize=1025%2C1536&amp;ssl=1 1025w, https://i1.wp.com/wordpress.org/news/files/2021/03/Berlin-2019-1.jpg?w=1367&amp;ssl=1 1367w, https://i1.wp.com/wordpress.org/news/files/2021/03/Berlin-2019-1.jpg?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>The road to freedom and becoming her own boss has not been easy for Olga. It is the path that got her where she is today, and she continues to find joy in it. She retains the lessons she’s learned and is always hungry to learn more.</p>\n\n\n\n<p> “I travelled through a very uneven path, with a lot of obstacles and noise, but for me it’s like a kaleidoscope where a little turn presents a new picture, a new “ah-ha” moment, new excitement after seemingly pointless efforts.” </p>\n\n\n\n<p>She added: “When in doubt I remind myself about David Ogilvy (generally considered the Founding Father of the modern advertising industry) who tried a lot of things before he struck gold with advertising, and maybe that’s why he did.”</p>\n\n\n\n<p>Finally, she learned not only to keep a good spirit and try different things, but also to dare as you move forward.</p>\n\n\n\n<h2><strong>Contributors</strong></h2>\n\n\n\n<p>Thanks to Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\">@webcommsat</a>), Nalini Thakor (<a href=\"https://profiles.wordpress.org/nalininonstopnewsuk/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>nalininonstopnewsuk</a>), Larissa Murillo (<a href=\"https://profiles.wordpress.org/lmurillom/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>lmurillom</a>), Meher Bala (<a href=\"https://profiles.wordpress.org/meher/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>meher</a>), Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\">@chanthaboune</a>), Chloé Bringmann (<a href=\"https://profiles.wordpress.org/cbringmann/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>cbringmann</a>) and Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\">@topher1kenobe</a>). Thank you to Olga Gleckler (<a href=\"https://profiles.wordpress.org/oglekler/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>oglekler</a>) for sharing her #ContributorStory.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/Y3odYTyvSfJbVxUxUWEgKxOprox2zxVwhk7_vdW-AIs4IlE-jK0Zt1itCj867x0dIAbIiK-VeuTLMZr6BjNEY0fkTf--4dT1hkLbnGtsPFNfyrVBYIN59IirTkNnqiQgqxk6E1MI\" alt=\"HeroPress logo\"></figure>\n\n\n\n<p><em>This post is based on an article originally published on HeroPress.com, a community initiative created by </em><a href=\"https://profiles.wordpress.org/topher1kenobe/\"><em>Topher DeRosia</em></a><em>. It highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard.</em></p>\n\n\n\n<p><em>Meet more WordPress community members in our <a href=\"https://wordpress.org/news/category/heropress/\">People of WordPress</a> series.</em></p>\n\n\n\n<p><em>#ContributorStory #HeroPress</em></p>\n\n\n\n<p></p>\n\n\n\n<p><em>Photo credits: 2nd and 4th Pablo Gigena, Berlin, 2019</em></p>"},
{"title": "People of WordPress: Yordan Soares", "content": "<p><strong>WordPress is open source software, maintained by a global network of contributors. There are many examples of how WordPress has changed people’s lives for the better. In this monthly series, we share some of the amazing stories.</strong> </p>\n\n\n\n<p><strong>To coincide with International Translation Day and the final day of the <a href=\"https://wptranslationday.org/\">2021 WordPress Translation celebration</a>, we feature the story of a WordPresser who has made a major impact in the polyglots team. </strong></p>\n\n\n\n<h2>Beyond software, meeting the WordPress community</h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"600\" height=\"600\" src=\"https://i2.wp.com/wordpress.org/news/files/2021/09/yordan-min-300x300@2x.jpg?resize=600%2C600&amp;ssl=1\" alt=\"\" class=\"wp-image-11299\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2021/09/yordan-min-300x300@2x.jpg?w=600&amp;ssl=1 600w, https://i2.wp.com/wordpress.org/news/files/2021/09/yordan-min-300x300@2x.jpg?resize=300%2C300&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2021/09/yordan-min-300x300@2x.jpg?resize=150%2C150&amp;ssl=1 150w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>For Yordan Soares from South America, finding WordPress also meant discovering friends, community, and opportunities. He had not expected to find a whole global movement behind the web development software.</p>\n\n\n\n<p>Yordan, who is from Venezuela, South America, said: “The first time I used WordPress, I had no idea what was going on behind the software or beyond it. I knew there was someone making it all work, but I couldn’t even remotely imagine all the people who were making WordPress not just a tool for developing websites, but a whole movement that comes together to share, build, and help make the world better.”<br></p>\n\n\n\n<h2>Turning your hobby into your job</h2>\n\n\n\n<p>Initially, Yordan earned his income from computer technical support and installing networks for small and medium-sized businesses. Back in 2005, web development and code-writing was just a hobby. When he discovered the concept of CSS and how it could make everything dynamic. This opened up a whole new career pathway for him.</p>\n\n\n\n<p>In 2010, an introduction to WordPress through a friend opened up a future he had not imagined. He stopped using any other content management system (CMS) and wanted to explore how much he could do with the platform.</p>\n\n\n\n<p>Three years later in 2013, he was able to take his WordPress journey further by starting a small advertising agency with some of his friends. During this time, they crafted commercials for local radio and TV stations. Through WordPress, they found it easy to build more than 15 websites for businesses in a market that previously had not valued the importance of having an online presence.</p>\n\n\n\n<p>He said: “We were working for almost four years until at the end of 2017 the economic crisis in Venezuela became too acute, and we decided to close the agency when we stopped making profits. Taking stock of that period, I think we changed the way merchants saw the Internet business in the city.”</p>\n\n\n\n<h2>Working full time as a freelancer</h2>\n\n\n\n<p>One year on in 2018, Yordan began to freelance full-time as a web developer. His first clients were primarily agencies and friends who had emigrated to other countries. Later, he expanded into freelance marketplaces.</p>\n\n\n\n<p>At that time, getting started as a freelancer was quite a challenging task in Venezuela. The first hindrance was getting a fair level of recompense. Additionally, the deteriorating conditions in the country with constant blackouts and internet connection failures complicated matters.</p>\n\n\n\n<p>At the time, Yordan was living in Guarenas, where the situation was relatively better. He managed to get a reasonably uninterrupted electricity supply with adequate internet speed, which was just good enough to complete his projects.</p>\n\n\n\n<h2>Meeting the WordPress community</h2>\n\n\n\n<p>“Surely if I hadn’t met the community, I would have continued to work on my own, like a lone wolf, doing the ordinary work of solving problems for occasional customers and paying my bills,” he said.</p>\n\n\n\n<p>Living in Guarenas, Yordan began to experience stability in his career and made new friends and contacts. He began looking for co-working spaces or technology communities nearby, and that’s when he met the WordPress community in Caracas.</p>\n\n\n\n<p>He quickly signed up for the first face-to-face event. As soon as the event concluded, he went to talk to the co-organizer and offered his help. He was inspired to help with designing promotional pieces, managing social networks, and organizing events.</p>\n\n\n\n<p>Through such events, he met and connected with several people living in nearby cities.</p>\n\n\n\n<div class=\"wp-block-media-text alignwide is-stacked-on-mobile\" style=\"grid-template-columns:32% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"120\" height=\"300\" src=\"https://i0.wp.com/wordpress.org/news/files/2021/09/WP_Guarenas-Guatire-120x300-1-120x300.png?resize=120%2C300&amp;ssl=1\" alt=\"\" class=\"wp-image-11300 size-medium\" srcset=\"https://i0.wp.com/wordpress.org/news/files/2021/09/WP_Guarenas-Guatire-120x300-1.png?resize=120%2C300&amp;ssl=1 120w, https://i0.wp.com/wordpress.org/news/files/2021/09/WP_Guarenas-Guatire-120x300-1.png?w=240&amp;ssl=1 240w\" sizes=\"(max-width: 120px) 100vw, 120px\" data-recalc-dims=\"1\"></figure><div class=\"wp-block-media-text__content\">\n<p class=\"has-normal-font-size\"> A few months later, with other WordPress users in the area, the idea emerged to start a new Guarenas-Guatire meetup group. The idea became a reality by December 2019, when they applied to the WordPress community team. </p>\n\n\n\n<p>Once the final approvals came in, the team started scheduling the activities. The <a href=\"https://www.meetup.com/wordpress-meetup-guarenas-guatire/\">WordPress Guarenas-Guatire Meetup</a> was officially recognized!</p>\n\n\n\n<p>During the first quarter of 2020, just before the pandemic, Yordan and colleagues organized five face-to-face events. With the worldwide lockdown, in-person community engagements came to a halt. However, the Guarenas-Guatire community was eager to continue meeting.</p>\n</div></div>\n\n\n\n<p>To keep the community active and motivated, and with the support of sponsors, they started organizing online events under a format called “WordPress a la medianoche” (WordPress at midnight).</p>\n\n\n\n<p>The format of these events was inspired by Alexis Arnal, who suggested meeting at midnight to make the most of the internet speed that would usually improve somewhat after that time!</p>\n\n\n\n<p>At the time of writing, Yordan and the team have organized 16 WordPress a la medianoche events with an attendance of up to 50 people per online gathering. An impressive audience which enabled a comparatively small meetup to keep communications flowing at a difficult and unprecedented time.</p>\n\n\n\n<p>One positive of such events, is an opportunity to invite people from other countries and run sessions in partnership with others. An example was a special translation event with Javier Esteban, a member of the translation team from Spain. The meetup also invited contributors from Mexico, Costa Rica, Peru, and Colombia who were happy to participate.</p>\n\n\n\n<h2>Strengthened by the community</h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"241\" src=\"https://i1.wp.com/wordpress.org/news/files/2021/09/wp-translation-2020.jpg?resize=632%2C241&amp;ssl=1\" alt=\"\" class=\"wp-image-11307\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2021/09/wp-translation-2020.jpg?resize=1024%2C390&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2021/09/wp-translation-2020.jpg?resize=300%2C114&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2021/09/wp-translation-2020.jpg?resize=768%2C292&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2021/09/wp-translation-2020.jpg?resize=1536%2C585&amp;ssl=1 1536w, https://i1.wp.com/wordpress.org/news/files/2021/09/wp-translation-2020.jpg?w=1889&amp;ssl=1 1889w, https://i1.wp.com/wordpress.org/news/files/2021/09/wp-translation-2020.jpg?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"><figcaption>Yordan (pictured bottom left) speaking at the WordPress Translation Day 2020 events</figcaption></figure>\n\n\n\n<p>Yordan believes that he would have continued to work on his own had he not met the WordPress community.</p>\n\n\n\n<p>He said: “Fortunately, this was not the case and I have been able to live a lot of transforming experiences that have shown me the meaning of the words ‘community’ and ‘volunteerism’.”</p>\n\n\n\n<p>Yordan felt empowered by the community and it led him to volunteer for many other roles and activities, including Locale Manager for <a href=\"https://translate.wordpress.org/locale/es-ve/\">Spanish Venezuela</a>, a moderator for <a href=\"https://make.wordpress.org/tv/\">WordPress.tv</a>, and as a <a href=\"https://make.wordpress.org/support/\">support</a> contributor in the forums helping people with technical issues. He has also developed free plugins for the official WordPress directory and <a href=\"https://wordpress.tv/speakers/yordan-soares/\">spoken at community events</a> including <a href=\"https://spain.wordcamp.org/2020/session/actualizaciones-automaticas-para-tus-plugins-y-temas-personalizados/\">WordCamp Spain 2020</a>.  </p>\n\n\n\n<p>All this has a boomerang effect, Yordan explains. These experiences helped him grow personally and professionally, as it’s always rewarding to know that you’ve helped improve the WordPress ecosystem.</p>\n\n\n\n<p>He also likes being able to directly help people when they need it and feels it is a two-way learning process.</p>\n\n\n\n<p>“At first, when I told my family and friends about the community and the work I was doing, they would ask me ‘what do you get in return?’ Perhaps they expected me to tell them a specific amount of money, but the answer is more complex,” he said.</p>\n\n\n\n<p>“It’s rewarding to know that you’ve helped improve the WordPress ecosystem, the tool you use to work and put food on the table.”</p>\n\n\n\n<p>During his journey, Yordan has met many wonderful people with common interests and values, and the best part is that many of these people are now his friends, business partners, or customers.</p>\n\n\n\n<p>At the same time, he has learned new skills and gained experience, which have given him a significant confidence boost in facing difficult situations that may come in life.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"632\" height=\"332\" src=\"https://i1.wp.com/wordpress.org/news/files/2021/10/special-acknowledgement-yordansoares.png?resize=632%2C332&amp;ssl=1\" alt=\"Polyglots special appreciation. Yordan Soares. \" class=\"wp-image-11320\" srcset=\"https://i1.wp.com/wordpress.org/news/files/2021/10/special-acknowledgement-yordansoares.png?resize=1024%2C538&amp;ssl=1 1024w, https://i1.wp.com/wordpress.org/news/files/2021/10/special-acknowledgement-yordansoares.png?resize=300%2C158&amp;ssl=1 300w, https://i1.wp.com/wordpress.org/news/files/2021/10/special-acknowledgement-yordansoares.png?resize=768%2C403&amp;ssl=1 768w, https://i1.wp.com/wordpress.org/news/files/2021/10/special-acknowledgement-yordansoares.png?w=1200&amp;ssl=1 1200w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></figure>\n\n\n\n<p>As part of the <a href=\"https://wordpress.org/news/2021/09/join-us-for-wordpress-translation-day-global-events-in-september-2021/\">WordPress Translation Day 2021</a> celebrations, Yordan was nominated for his contribution to the work of the Polyglots Team translating WordPress. The full nominations list and stories will be published in October and November on the <a href=\"https://wptranslationday.org/\">WordPress Translation Day website</a>. Check out the <a href=\"https://make.wordpress.org/polyglots/2021/09/30/30-days-of-translation-celebration/\">final events for International Translation Day</a>.</p>\n\n\n\n<h2>Contributors</h2>\n\n\n\n<p>Thanks to Abha Thakor (<a href=\"https://profiles.wordpress.org/webcommsat/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>webcommsat</a>), Larissa Murillo (<a href=\"https://profiles.wordpress.org/lmurillom/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>lmurillom</a>), Maedah Batool (<a href=\"https://profiles.wordpress.org/maedahbatool/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>maedahbatool</a>), Chloé Bringmann (<a href=\"https://profiles.wordpress.org/cbringmann/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>cbringmann</a>), and Nalini (<a href=\"https://profiles.wordpress.org/nalininonstopnewsuk/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>nalininonstopnewsuk</a>) for work on this story. Thank you to Yordan Soares (<a href=\"https://profiles.wordpress.org/yordansoares/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>yordansoares</a>) for sharing his Contributor Story, and to Josepha Haden (<a href=\"https://profiles.wordpress.org/chanthaboune/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>chanthaboune</a>) and Topher DeRosia (<a href=\"https://profiles.wordpress.org/topher1kenobe/\" class=\"mention\"><span class=\"mentions-prefix\">@</span>topher1kenobe</a>) for their support of the series. The WordPress Guarenas-Guatire logo on this page was designed by <a href=\"https://profiles.wordpress.org/bragnieljimenez/\">Bragniel Jimenez</a> </p>\n\n\n\n<p>This People of WordPress feature is inspired by an article originally published on HeroPress.com, a community initiative created by Topher DeRosia. The initiative highlights people in the WordPress community who have overcome barriers and whose stories would otherwise go unheard. Meet more WordPressers in our <a href=\"https://wordpress.org/news/category/newsletter/interviews/\">People of WordPress series.</a></p>\n\n\n\n<p>#ContributorStory #HeroPress</p>"}
]