[
{"title": "Browsing Happy with WordPress", "content": "<p>You can get the <a href=\"http://www.webstandards.org/press/releases/archive/2005/06/01/index.html\">full details from the Web Standards Project press release</a>, but to make a long story short WordPress.org will be taking <a href=\"http://browsehappy.com/\">Browse Happy</a> under its wing by continuing hosting the site and keeping it current with the latest trends and information.</p>\n<p>Browse Happy is a site dedicated to educating people about browser alternatives that will give them a better online experience. We’ve promoted <a href=\"http://getfirefox.com/\">Firefox</a> for a long time within our administration interface, this will allow us to expand our promotion to cover other excellent browsers as well. If you have any ideas for the site or would like to share your story, please let us know through the <a href=\"http://browsehappy.com/people/you/\">Browse Happy contact and submission form</a>.</p>"},
{"title": "Ideas and Kvetch!", "content": "<p>It’s a new year, and we have a new major release of WordPress coming soon. (We’re currently aiming for the 22nd.) It’s as good a time as any to examine where we’ve been, and where we are, and where we’re going as a community. 2006 was a pretty exciting year, we saw 1.54 million downloads of WP, and that’s not even counting the people who install it through their host’s one-click install or the half a million who have experienced it through the hosted WordPress.com. WordPress is touching more lives than ever.</p>\n<p>However, just because what we’ve done has worked in the past doesn’t mean it’s the best for the future. We have to take a self-critical look at assumptions we have about our development process and WP itself. The upcoming release, which has been long coming, is a perfect time to focus on WP’s secret ingredient… you.</p>\n<p>If you could add anything in the world to WordPress, what would it be? If you could name the thing that frustrates you the most about WP, what would that be?</p>\n<p>Now you can tell us. We’re announcing new projects—two sides of the same coin.</p>\n<p><a href=\"https://wordpress.org/extend/ideas/\">The first is simply called Ideas</a>, and it’s a place where you can share your wildest WordPress wishes with the world, and also vote on other people’s ideas. This allows people outside our normal circle of developers to have a direct say in what goes into the next version of WordPress. For 2.2, which comes out in late April, we will include the top voted on features, so propose something, tell your friends about it, and link it from your blog.</p>\n<p>The second we’ve named after the <a href=\"http://www.answers.com/kvetch\">Yiddish word</a>, <a href=\"https://wordpress.org/extend/kvetch/\">Kvetch</a>. This is a place where you can quickly and anonymously express whatever might disagree with you in the WordPress world. Let it all loose, but try to keep it PG rated, and we’ll show a random kvetch on the page once we get enough in the system.</p>\n<p>Both are just part of putting you guys—our users—first. It’s easy because there’s so many of you.</p>"},
{"title": "Plugin Directory", "content": "<p>One of the greatest things about WordPress has always been the amazing number of high-quality plugins available for the platform. I believe that there aren’t any more “killer features” in software, there are 10,000 killer features and everyone has a different 20. If we tried to put everything into WordPress the result would be, for lack of a better term, bloated. However through our robust plugin API people have used WordPress as a platform for building almost anything you can imagine leveraging the huge WP userbase and scalable core codebase.</p>\n<p>That’s all fine and dandy, but having all these plugins isn’t that useful if you’ve got no place to find them. Even though we have provided development hosting at <a href=\"http://wp-plugins.org\">wp-plugins.org</a> for years, we hadn’t had a user interface to the plugins hosted there, which I think was a travesty.</p>\n<p>No longer! Our ever-expanding “extend” section <a href=\"https://wordpress.org/extend/plugins/\">now has a brand-spanking new plugins directory</a> where you can browse, download, rate, and comment on all your favorite plugins. I highly encourage you to go check it out.</p>\n<p>For users, this means:</p>\n<ul>\n<li>There is now a <a href=\"https://wordpress.org/extend/plugins/\">central place to find and download WordPress plugins</a>.</li>\n<li>You can get a much better idea about plugin quality and compatibility from the site.</li>\n<li>In the future you’ll be able to get notification inside of WordPress about plugins you use that have updates.</li>\n</ul>\n<p>For developers, you now have:</p>\n<ul>\n<li>Exposure to the millions of people who visit WordPress.org every month.</li>\n<li>Free SVN hosting for GPL plugin development at wp-plugins.org. (Like always.)</li>\n<li>Automatic download packages and free hosting of those.</li>\n<li>Statistics about how many people are using and downloading your plugins.</li>\n<li>Prominent links to your homepage, and the ability to specify a Paypal donation link from your plugin page.</li>\n</ul>\n<p>As a developer all you need to do to start taking advantage of the new plugin pages is to include a <a href=\"https://wordpress.org/extend/plugins/about/\">properly formatted readme.txt file</a> along with your plugin.</p>\n<p>Props to <a href=\"http://blogwaffe.com/\">Michael Adams</a>, <a href=\"http://txfx.net/\">Mark Jaquith</a>, and <a href=\"http://iammattthomas.com/\">Matt Thomas</a> for making this dream a reality. We hope you all enjoy it and if you have any feedback blog it and <a href=\"https://wordpress.org/development/2007/03/plugin-directory/\">link back to this entry</a> so we get the pingback. Happy downloading!</p>"},
{"title": "WebWare 100 Winner", "content": "<p>The results are in, and WordPress is the <a href=\"http://www.webware.com/html/ww/100.html\">winner of the Webware 100 in the Publishing category</a>. Thanks to everyone who voted, but thank you even more to <a href=\"http://foolswisdom.com/wordpress-22-source-code-worth-1-million/\">all the great people who make WordPress what it is</a>. It’s an honor to have so many of you entrust your blogs to our software, and it’s an incredible opportunity for us to live up to the high standards you’ve set. Here’s what <a href=\"http://www.webware.com/8301-1_109-9728770-2.html\">Rafe Needleman wrote about the results</a>:</p>\n<blockquote><p>WordPress got the most votes. I was interested to see the Drupal CMS platform placing high in this category–above the consumer-oriented publishing products Typepad and Vox. Even combined, these two Six Apart services didn’t come close to winning the same number of votes as Drupal.</p></blockquote>\n<p>Glad to see our open-source brother-by-another-mother representing. The rankings in Publishing were WordPress, Adobe Flash, Drupal, Blogger, and Google Analytics as the top 5.</p>"},
{"title": "Showcase", "content": "<p>Today we launched the <a title=\"WordPress Showcase\" href=\"https://wordpress.org/showcase/\">WordPress Showcase</a>, a display of some of the best and brightest WordPress users, who are using it to do a whole lot more than blog.</p>\n<p><a href=\"https://wordpress.org/showcase/\"><img loading=\"lazy\" title=\"Showcase Screenshot\" src=\"https://wpdotorg.files.wordpress.com/2008/10/showcase-screenshot.png?resize=567%2C605\" alt=\"Duke Center for International Studies\" width=\"567\" height=\"605\" data-recalc-dims=\"1\"></a></p>\n<p>Pick your flavor and check out the possibilities available through WordPress MU, WordPress.com, WordPress.com VIP and WordPress.org.</p>\n<p>Site screenshots are constantly updated, so what you see is a realtime look at what’s going on with our hottest users.</p>\n<p>Don’t see something there that should be? <a href=\"https://wordpress.org/showcase/submit-a-wordpress-site/\">Suggest an addition!</a> We’ll check it out and add it to the bunch if we think it makes the cut.</p>"},
{"title": "Theme Directory", "content": "<p>It’s been a long time since <a href=\"http://themes.wordpress.net/blog/4426/upcoming-changes/\">themes.wordpress.net</a> stopped accepting new themes.  Since then most theme authors have been distributing their themes from their own sites, without a good centralized place for people to browse, search, comment on, and rate themes.  With the success of the <a href=\"https://wordpress.org/extend/plugins/\">plugins directory</a>, we’ve wanted to have those same benefits in a theme directory.  Today is the day we start making that happen, with the introduction of <a href=\"https://wordpress.org/extend/themes/\">wordpress.org/extend/themes/</a>.</p>\n<p>Bringing the new theme directory under the WordPress “<a href=\"https://wordpress.org/extend/\">extend</a>” umbrella allowed us to take advantage of all the infrastructure that has already been built up to support WordPress.org.  If you’ve browsed through the plugin directory, you’ll feel right at home in the new theme directory.</p>\n<p>We’ve gone through great lengths to make this as painless as possible for theme authors.  You don’t need to know anything about Subversion (our back end magic takes care of all that for you), just login with your WordPress.org username and password and go to the <a href=\"https://wordpress.org/extend/themes/upload/\">upload page</a>.  From there you upload your regular theme zip file and we take care of the rest.</p>\n<p>Once you upload your new theme we do a few automated checks for some of the <a href=\"https://wordpress.org/extend/themes/about/#requirements\">requirements</a> for each theme.  If we find one that you missed we’ll provide you an error and description of what needs to be fixed.  When a theme upload has been accepted we’ll send you an email and put it in the queue to be reviewed, to make sure we didn’t miss anything.  After the theme has been approved you’ll get another email letting you know that the theme is now live.</p>\n<p>That catches you up to where we’re at today.  When you finish that theme you’ve been slaving over, upload it to the new directory and let us know what you think. Since so much has changed since the old theme directory we’re starting fresh from zero. If you’ve got specific questions or suggestions <a href=\"https://wordpress.org/extend/themes/contact/\">contact us</a> and we’ll do our best to get them answered.</p>"},
{"title": "Preparing for 2.3", "content": "<p>In just a few short days WordPress 2.3 will be coming out with tons of new features that (hopefully) will make you want to upgrade right away. Well while you have a bit of time over this lovely weekend, here are some things you can do to help yourself prepare for the big upgrade on Monday:</p>\n<ul>\n<li>Back up your blog. It never goes out of style, and we have <a href=\"https://codex.wordpress.org/Backing_Up_Your_Database\">a nifty Codex page with a few different methods</a>.</li>\n<li>Check for the latest versions of your plugins. <a href=\"https://codex.wordpress.org/Plugins/Plugin_Compatibility/2.3\">Here’s a list of known compatible and incompatible plugins with 2.3</a>, Google Sitemaps seems to be one causing a lot of issues. (<a href=\"https://wordpress.org/support/topic/135160\">Forum thread</a>.) Upgrading might get you cool new features anyway. Don’t forget about our <a href=\"https://wordpress.org/extend/plugins/\">plugin directory</a>.</li>\n<li>Enjoy the last time you have to check for plugin updates manually, as 2.3 will do it magically behind the scenes.</li>\n<li><a href=\"http://richgilchrest.com/how-to-add-wordpress-23-tags-to-your-current-theme/\">Read up on how to modify your theme to add tag support</a>.</li>\n<li>Consider <a href=\"https://codex.wordpress.org/Installing/Updating_WordPress_with_Subversion\">switching your install to use Subversion</a> to make updating ultra-easy.</li>\n<li>Make a list of your friends who are less computer literate so you can help them upgrade. (Maybe <a href=\"http://upcoming.yahoo.com/event/269586/\">throw an upgrade party</a>?)</li>\n</ul>\n<p>If you have any other ideas put them on your blog and pingback this post.</p>"},
{"title": "New Faces", "content": "<p>If you follow WordPress development closely you’ve probably noticed a few new faces around lately, or to be more accurate a few old faces who are taking on bigger roles in the community. I would like to take this opportunity to announce and publicly congratulate Mark Jaquith and Peter Westwood who have both become lead developers, the highest development honor on WordPress.org.</p>\n<p><a href=\"http://markjaquith.com/\">Mark Jaquith</a> has been using and contributing to WordPress since 2004.  Mark especially enjoys watching people use WordPress to express themselves in areas of the world where free expression is suppressed.  But, being a voracious consumer of information, he probably reads your cat blog too.</p>\n<p><a href=\"http://blog.ftwr.co.uk/\">Peter</a> works as an Embedded Software Engineer developing a <a href=\"http://www.trend-controls.com/wps/portal/!ut/p/_s.7_0_A/7_0_3TJ/.cmd/ad/.c/6_0_1L5/.ce/7_0_4CL/.p/5_0_3DD/.d/1/_th/J_0_CI/_s.7_0_A/7_0_3TJ?PC_7_0_4CL_proxyurl=j#7_0_4CL\">web-enabled BMS controller</a>. Using WordPress since version 1.0.1, Peter spends his spare time triaging bugs on Trac and investigating new open source tools. When not at the computer Peter can often be found photographing flowers, animals and <a href=\"http://flickr.com/photos/westi\">cars</a> and listening to a <a href=\"http://last.fm/user/peterwestwood\">wide variety of music</a>.</p>"},
{"title": "Themes are GPL, too", "content": "<p>If WordPress were a country, our Bill of Rights would be <a href=\"https://wordpress.org/about/gpl/\">the GPL</a> because it <a href=\"http://www.gnu.org/philosophy/free-sw.html\">protects our core freedoms</a>. We’ve always done our best to keep WordPress.org clean and only promote things that are completely compatible and legal with WordPress’s license. There have been some questions in the community about whether the GPL applies to themes like we’ve always assumed. To help clarify this point, I reached out to the <a href=\"http://en.wikipedia.org/wiki/Software_Freedom_Law_Center\">Software Freedom Law Center</a>, the world’s preëminent experts on the GPL, which spent time with WordPress’s code, community, and provided us with an official legal opinion. One sentence summary: PHP in WordPress themes must be GPL, artwork and CSS may be but are not required.</p>\n<blockquote><p>Matt,</p>\n<p>You asked the Software Freedom Law Center to clarify the status of themes as derivative works of WordPress, a content management software package written in PHP and licensed under version 2 of the GNU General Public License.</p>\n<p>We examined release candidate 1 of WordPress 2.8, which you provided to us at https://wordpress.org/wordpress-2.8-RC1.tar.gz.  The “classic” and “default” themes included in that release candidate comprise various PHP and CSS files along with an optional directory of images.  The PHP files contain a mix of HTML markup and PHP calls to<br>\nWordPress functions.  There is some programmatic logic in the PHP code, including loops and conditionals.</p>\n<p>When WordPress is started, it executes various routines that prepare information for use by themes.  In normal use, control is then transferred via PHP’s include() function to HTML and PHP templates found in theme package files.  The PHP code in those template files relies on the earlier-prepared information to fill the templates for serving to the client.</p>\n<p>On the basis of that version of WordPress, and considering those themes as if they had been added to WordPress by a third party, it is our opinion that the themes presented, and any that are substantially similar, contain elements that are derivative works of the WordPress software as well as elements that are potentially separate works. Specifically, the CSS files and material contained in the images directory of the “default” theme are works separate from the WordPress code.  On the other hand, the PHP and HTML code that is intermingled with and operated on by PHP the code derives from the WordPress code.</p>\n<p>In the WordPress themes, CSS files and images exist purely as data to be served by a web server.  WordPress itself ignores these files[1]. The CSS and image files are simply read by the server as data and delivered verbatim to the user, avoiding the WordPress instance altogether.  The CSS and images could easily be used with a range of HTML documents and read and displayed by a variety of software having no relation to WordPress.  As such, these files are separate works from the WordPress code itself.</p>\n<p>The PHP elements, taken together, are clearly derivative of WordPress code.  The template is loaded via the include() function.  Its contents are combined with the WordPress code in memory to be processed by PHP along with (and completely indistinguishable from) the rest of WordPress.  The PHP code consists largely of calls to WordPress functions and sparse, minimal logic to control which WordPress functions are accessed and how many times they will be called.  They are derivative of WordPress because every part of them is determined by the content of the WordPress functions they call.  As works of authorship, they are designed only to be combined with WordPress into a larger work.</p>\n<p>HTML elements are intermingled with PHP in the two themes presented. These snippets of HTML interspersed with PHP throughout the theme PHP files together form a work whose form is highly dependent on the PHP and thus derivative of it.</p>\n<p>In conclusion, the WordPress themes supplied contain elements that are derivative of WordPress’s copyrighted code.  These themes, being collections of distinct works (images, CSS files, PHP files), need not be GPL-licensed as a whole.  Rather, the PHP files are subject to the requirements of the GPL while the images and CSS are not.  Third-party developers of such themes may apply restrictive copyrights to these elements if they wish.</p>\n<p>Finally, we note that it might be possible to design a valid WordPress theme that avoids the factors that subject it to WordPress’s copyright, but such a theme would have to forgo almost all the WordPress functionality that makes the software useful.</p>\n<p>Sincerely,<br>\nJames Vasile<br>\nSoftware Freedom Law Center</p>\n<p>[1] There is one exception.  WordPress does reads CSS and image files to create previews of templates for the template selection portion of the administrative interface.  Even in that case, though, nothing in those files calls any WordPress functions, is treated as a command by PHP, or alters any other WordPress data structure.  These files are read as data and used to create an image and display a miniaturized version of a webpage to the user.</p></blockquote>\n<p>Even though graphics and CSS aren’t <em>required</em> to be GPL legally, the lack thereof is pretty limiting. Can you imagine WordPress without any CSS or javascript? So as before, we will only promote and host things on WordPress.org that are 100% GPL <a href=\"http://en.wikipedia.org/wiki/License_compatibility\">or compatible</a>. To celebrate a few folks creating 100% GPL themes and providing support and other services around them, <a href=\"https://wordpress.org/extend/themes/commercial/\">we have a new page listing GPL commercially supported themes</a>.</p>"},
{"title": "WordPress Foundation", "content": "<p>It is with extremely great pleasure that I point you to the <a href=\"http://wordpressfoundation.org/2010/getting-off-the-ground/\">first post</a> at the new <a href=\"http://wordpressfoundation.org/\">WordPress Foundation site</a>. Not only am I excited about the things that will happen under the auspices of the Foundation, I’m excited to see a site running the 3.0 development version and the nascent theme called <em>2010</em>. Go <a href=\"http://wordpressfoundation.org\">check it out</a> for yourself.</p>"},
{"title": "State of the Word", "content": "<p>This has been an exciting year for WordPress. We’ve grown to power <strong>14.7% of the top million websites in the world</strong>, up from 8.5%, and the latest data show <strong>22 out of every 100 new active domains in the US are running WordPress</strong>.</p>\n<p>We also conducted our first ever user and developer survey, which got over 18,000 responses from all over the world:</p>\n<p><img src=\"https://michaelpick.files.wordpress.com/2011/08/sotw2011-final-046-0012.jpg?w=632\" alt=\"\" data-recalc-dims=\"1\"></p>\n<p>We found a few interesting tidbits from the survey responses already, including that <strong>6,800 self-employed respondents were responsible for over 170,000 sites personally</strong>, and charged a median hourly rate of $50. In tough economic times, it’s heartening to see Open Source creating so many jobs. (If each site took only 3 hours to make, that’s $29.5M of work at the average hourly rate.)</p>\n<p>I talk about this data, and much more, in my State of the Word address which you <a href=\"http://wordpress.tv/2011/08/14/matt-mullenweg-state-of-the-word-2011/\">can watch here</a>:</p>\n<p><iframe width=\"632\" height=\"356\" src=\"https://videopress.com/embed/9ujY295r?hd=0\" frameborder=\"0\" allowfullscreen></iframe><script src=\"https://v0.wordpress.com/js/next/videopress-iframe.js?m=1435166243\"></script></p>\n<p>We know there’s more good stuff hidden in there and we’re open sourcing and releasing the raw information behind it. If you’re a researcher and would like to dig into the anonymized survey data yourself, <a href=\"https://s.w.org/resources/survey/wp2011-survey.tar.gz\">you can grab it here</a>. (Careful, it’s a 9MB CSV.)</p>\n<p>There has never been a better time to be part of the WordPress community, and I want to thank each and every one of you for making it such a wonderful place to be. Now it’s time to get back to work, there’s still 85.3% of the web that needs help. 🙂</p>"},
{"title": "Plugin Directory Refreshed", "content": "<p>Been hanging out with a few WordPress.org hackers — Scott, Nacin, and Otto — the last few days in a BBQ-fueled haze of hacking to make plugin directory better. There are over <a href=\"https://wordpress.org/extend/plugins/\">19,000 plugins listed</a> and they’re really the heart and soul of WordPress for many people, so they deserve a little tender loving care. Here’s a quick before and after snapshot you can zoom in on to see a visual overview of some of the changes:</p>\n<p><a href=\"https://wpdotorg.files.wordpress.com/2012/05/contact-form-7.png\"><img src=\"//i0.wp.com/wpdotorg.files.wordpress.com/2012/05/contact-form-7.png?resize=690,350\" alt=\"\"></a></p>\n<p>Our first focus was around improving the discussion and support around plugins.</p>\n<p>You’ll now notice that threads about a plugin are pulled directly into a “support” tab on the plugin page — each plugin has its own forum. We’ve made authors much more prominent and with bigger Gravatars and better placement, so you can get a sense of who made the plugin you’re using. And finally to show how active and well-supported a plugin is, you can see  “16 of 75 support threads in the last two weeks have been resolved.” Finally, if you’re logged in you get access to the new “favorites” feature that lets you mark the plugins you use the most so you can share them on your profile page and find them quickly later. We soft-launched favorites a few days ago and there have already been 2,000 saved!</p>\n<p>If you’re a plugin author, we’ve started with a short threshold (2 weeks) for the resolved stats so it’s easy to catch up and stay on top of it. (It’ll eventually go to two months.) You also now have the ability to set stickies on your plugin forum to put FAQs or important information at the top, and of course any person you put as a committer on the plugin will have moderation access. People on the forum tag will see your custom header and links to the other resources attached to your plugin.</p>\n<p>We’ve tightened up the styling a bit on the forums and plugin pages, though still some cleanups to do there. Some older improvements you might have missed, but are still useful for users and developers alike:</p>\n<ul>\n<li>“Plugin headers” or those cool graphics you see at the top of plugin pages have really taken off, there are over 1,600 active now.</li>\n<li>You can now subscribe to get an email whenever a commit is made to a plugin repository even if it isn’t yours. There is no better way to follow the development of your favorite plugins. There’s nothing like the smell of fresh changesets in the morning.</li>\n<li>Behind the scenes, we’ve dramatically ramped up proactive scanning of the entire repository to help authors fix security and other problems they might not even know about yet. The quality level of the repo has gone way, way up.</li>\n</ul>\n<p>All of this will continue to evolve as we get feedback and see usage, but we’re happy to have been able to make some key improvements in just a few days while hanging out in Memphis. (This is why WordCamps usually have BBQ — it imparts magical coding powers.)</p>"},
{"title": "Ten Good Years", "content": "<p><img loading=\"lazy\" class=\"alignright\" alt=\"\" align=\"right\" src=\"https://wpdotorg.files.wordpress.com/2013/05/wp10.jpg?resize=316%2C164\" width=\"316\" height=\"164\" data-recalc-dims=\"1\">It’s been ten years since we started this thing, and what a long way we’ve come. From a discussion between myself and <a href=\"http://mikelittle.org/\">Mike Little</a> about <a href=\"http://ma.tt/2003/01/the-blogging-software-dilemma/\">forking our favorite blogging software</a>, to powering 18% of the web. It’s been a crazy, exciting, journey, and one that won’t stop any time soon.</p>\n<p>At ten years, it’s fun to reflect on our beginnings. We launched WordPress on 27th May 2003, but that wasn’t inception. Go back far enough, and you can <a href=\"http://zengun.org/weblog/archives/2001/06/post1958/\">read a post by Michel Valdrighi</a> who, frustrated by the self-hosted blogging platforms available, decided to write his own software; “b2, a PHP+MySQL alternative to Blogger and GreyMatter.” b2 was easy to install, easy to configure, and easy for developers to extend. Of all the blogging platforms out there, <a href=\"http://cafelog.com\">b2</a> was the right one for me: I could write my content and get it on the web quickly and painlessly.</p>\n<p>Sometimes, however, life gets in the way. In 2002, Michel stopped maintaining b2. Over time, security flaws became apparent and updates were needed and, while the b2 community could write patches and fixes, no one was driving the software forward. We were lucky that Michel decided to release b2 under the GPL; the software may have been abandoned, but we weren’t without options. A fork was always a possibility. That was where it stood in January 2003, when <a href=\"http://ma.tt/2003/01/the-blogging-software-dilemma/\">I posted about forking b2</a> and <a href=\"http://ma.tt/2003/01/the-blogging-software-dilemma/#comment-445\">Mike responded</a>. The rest, as they say, is history.</p>\n<p>From the very beginning to the present day, I’ve been impressed by the thought, care, and dedication that WordPress’ developers have demonstrated. Each one has brought his or her unique perspective, each individual has strengthened the whole. It would be impossible to thank each of them here individually, but their achievements speak for themselves. In WordPress 1.2 the new Plugin API made it easy for developers to extend WordPress. In the same release <code>gettext()</code> internationalization opened WordPress up to every language (hat tip: <a href=\"http://ryan.boren.me/\">Ryan Boren</a> for spending hours wrapping strings with gettext). In WordPress 1.5 our Theme system made it possible for WordPress users to quickly change their site’s design: there was huge resistance to the theme system from the wider community at the time, but can you imagine WordPress without it? Versions 2.7, 2.8, and 2.9 saw improvements that let users install and update their plugins and themes with one click. WordPress has seen a redesign by <a href=\"http://v2.happycog.com/create/wordpress/?p=design/wordpress/\">happycog</a> (2.3) and gone under extensive user testing and redesign (<a href=\"http://www.slideshare.net/edanzico/riding-the-crazyhorse-future-generation-wordpress-presentation\">Crazyhorse</a>, Liz Danzico and Jen Mylo, WordPress 2.5). In WordPress 3.0 we merged WordPress MU with WordPress — a huge job but 100% worth it. And in WordPress 3.5 we revamped the media uploader to make it easier for people to get their images, video, and media online.</p>\n<p>In sticking to our commitment to user experience, we’ve done a few things that have made us unpopular. The <a href=\"http://tech.gaeatimes.com/index.php/archive/wordpress-wysiwyg-editor-is-a-disaster/\">WYSIWYG editor</a> was hated by many, especially those who felt that if you have a blog you should know HTML. Some developers hated that we stuck with our code, refusing to rewrite, but it’s always been the users that matter: better a developer lose sleep than a site break for a user. Our code isn’t always beautiful, after all, when WordPress was created most of us were still learning PHP, but we try to make a flawless experience for users.</p>\n<p>It’s not all about developers. WordPress’ strength lies in the diversity of its community. From the start, we wanted a low barrier to entry and we came up with our “famous 5 minute install”. This brought on board users from varied technical background: people who didn’t write code wanted to help make WordPress better. If you couldn’t write code, it didn’t matter: you could answer a question in the support forums, write documentation, translate WordPress, or build your friends and family a WordPress website. There is <a href=\"https://make.wordpress.org/\">space in the community</a> for anyone with a passion for WordPress.</p>\n<p>It’s been wonderful to see all of the people who have used WordPress to build their home on the internet. Early on <a href=\"https://wordpress.org/news/2004/04/switchers/\">we got excited</a> by <a href=\"https://wordpress.org/news/2004/04/more-switchers/\">switchers</a>. From a community of tinkerers we grew, as writers such as <a href=\"http://ma.tt/2004/05/om-malik/\">Om Malik</a>, <a href=\"http://dougal.gunters.org/blog/2004/05/15/mark-pilgrim-switches/\">Mark Pilgrim</a>, and <a href=\"http://ma.tt/2004/07/mollycom-switches/\">Molly Holzschlag</a> made the switch to WordPress. Our commitment to effortless publishing quickly paid off and has continued to do so: <strong>the WordPress 1.2 release saw 822 downloads per day, our latest release, WordPress 3.5, has seen 145,692 per day.</strong></p>\n<p>I’m continually amazed by what people have built with WordPress. I’ve seen <a href=\"http://justintimberlake.com/main/\">musicians</a> and <a href=\"http://ma.tt/2013/01/neil-leifer-on-wordpress/\">photographers</a>, magazines such as <a href=\"http://life.time.com/\">Life</a>, <a href=\"http://boingboing.net/\">BoingBoing</a>, and the <a href=\"http://observer.com/\">New York Observer</a>, <a href=\"http://www.compliance.gov/\">government websites</a>, a <a href=\"http://josephscott.org/archives/2011/05/pressfs-a-wordpress-filesystem/\">filesystem</a>, <a href=\"http://www.ymcanyc.org/association/pages/y-mvp\"> mobile applications</a>, and even <a href=\"http://www.viper007bond.com/2010/06/12/so-apparently-wordpress-can-guide-missiles/\">seen WordPress guide missiles</a>.</p>\n<p>As the web evolves, WordPress evolves. Factors outside of our control will always influence WordPress’ development: today it’s mobile devices and retina display, tomorrow it could be Google Glass or technology not yet conceived. A lot can happen in ten years! As technology changes and advances, WordPress has to change with it while remaining true to its core values: making publishing online easy for everyone. How we rise to these challenges will be what defines WordPress over the coming ten years.</p>\n<p><strong>To celebrate ten years of WordPress, we’re working on a book about our history.</strong> We’re carrying out interviews with people who have involved with the community from the very beginning, those who are still around, and those who have left. It’s a huge project, but we wanted to have something to share with you on the 10th anniversary. To learn about the very early days of WordPress, just after Mike and I forked b2 <a href=\"https://wordpress.org/about/history/\">you can download Chapter 3 right here</a>. We’ll be releasing the rest of the book serially, so watch out as the story of the last ten years emerges.</p>\n<p>In the meantime, <a href=\"http://ma.tt/2013/05/dear-wordpress/\"> I penned my own letter to WordPress</a> and other community members have been sharing their thoughts:</p>\n<ul>\n<li><a href=\"http://zed1.com/journalized/archives/2013/01/25/wordpress-a-10-year-journey/\">Mike Little on our Ten Year Journey</a>.</li>\n<li>Core contributor Helen Hou-Sandi <a href=\"http://helen.wordpress.com/2013/05/27/happy-10th-wordpress-and-thanks-from-my-little-family/\">wishes WordPress happy birthday</a>.</li>\n<li>Peter Westwood on <a href=\"http://blog.ftwr.co.uk/archives/2013/05/27/a-decade-gone-more-to-come/\">a decade gone</a>.</li>\n<li>Support rep Mika Epstein <a href=\"http://ipstenu.org/2013/you-me-and-wp/\">on her WordPress journey</a>.</li>\n<li>Dougal Campbell <a href=\"http://dougal.gunters.org/blog/2013/05/27/instagram-my-wife-suzecampbell-and-i-celebrating-the-wordpress-10th-anniversary-with-bbq-in-our-wordpress-shirts-wp10/\">celebrating with his wife, Suze</a>.</li>\n<li>Otto on <a href=\"http://ottodestruct.com/blog/2013/how-wp-affected-me/\">how WordPress affected him</a>.</li>\n</ul>\n<p>You can see how WordPress’ 10th Anniversary was celebrated all over the world <a href=\"http://wp10.wordpress.net/\">by visiting the wp10 website</a>, according to Meetup we had 4,999 celebrators.</p>\n<p>To finish, I just want to say thank you to everyone: to the developers who write the code, to the designers who make WordPress sing, to the worldwide community translating WordPress into so many languages, to volunteers who answer support questions, to those who make WordPress accessible, to the systems team and the plugin and theme reviewers, to documentation writers, event organisers, evangelists, detractors, supporters and friends. Thanks to the jazzers whose music inspired us and whose names are at the heart of WordPress. Thanks to everyone who uses WordPress to power their blog or website, and to everyone who will in the future. Thanks to WordPress and its community that I’m proud to be part of.</p>\n<p>Thank you. I can’t wait to see what the next ten years bring.</p>\n<p><em>Final thanks to <a href=\"http://siobhanmckeown.com/\">Siobhan McKeown</a> for help with this post.</em></p>"},
{"title": "Lucky Seven", "content": "<p>Has it really been seven years since the first release of WordPress? It seems like just yesterday we were fresh to the world, a new entrant to a market  everyone said was already saturated. (As a side note, if the common perception is that a market is finished and that everything interesting has been done already, it’s probably a really good time to enter it.)</p>\n<p>The growth over the past year has blown me away. Since our last birthday we’ve doubled theme downloads to over 10 million, and doubled plugin downloads to 60 million. Most importantly, we continued to grow the development community to 1,528 people active on Trac and 13 committers, both numbers the highest in the history of WordPress.</p>\n<p>That’s 1,528 people pouring their hearts and souls into GPL software we all own, we all build on, we can use as we please, we can all make better. We’ve evolved from a simple script to a web platform.</p>\n<p>We’re on the cusp of version 3.0, with a release candidate coming out any minute now.</p>\n<p>If you’d like to celebrate WordPress’s birthday with us — tell a friend! Help them upgrade their blog or find the perfect theme. Talk about how WordPress is built by and for a community. Drop in to help test 3.0, including all the plugins you use. Write something to take advantage of the new 3.0 features, or teach your friends how to. If you buy any themes or plugins, make sure they’re GPL or compatible just like WordPress. We’ve got a long road ahead of us, it’s important that we not forget that Open Source got us this far, and is the only way we’re going to get to the next level. The whole of what we can build together is far greater than the sum of our parts. Spread the good word. 🙂</p>"},
{"title": "WordPress at 18", "content": "<p>Today marks the 18th anniversary of WordPress’ launch, a day that I fondly refer to as WordPress’ birthday, which means WordPress is 6,575 days old. To celebrate another turn around the sun, the <a href=\"https://wordpress.org/news/2008/05/birthday-party/\">community</a> has had <a href=\"https://wp15.wordpress.net/\">parties</a>, we have <a href=\"https://wordpress.org/news/2010/05/lucky-seven/\">shared data</a>, and we have <a href=\"https://wordpress.org/news/2013/05/ten-good-years/\">told our story</a>.</p>\n\n\n\n<p>Since our last birthday we developed our 40th release and now also support over 40% of the web. So it seems fitting that this year’s celebration should be a list of 40 milestones that have helped us get there.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-wp-embed is-provider-wordpress-org wp-block-embed-wordpress-org\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"jfhsKLBL8n\"><a href=\"https://wordpress.org/40-percent-of-web/\">WordPress and the Journey to 40% of the Web</a></blockquote><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; clip: rect(1px, 1px, 1px, 1px);\" title=\"“WordPress and the Journey to 40% of the Web” — WordPress.org\" src=\"https://wordpress.org/40-percent-of-web/embed/#?secret=jfhsKLBL8n\" data-secret=\"jfhsKLBL8n\" width=\"600\" height=\"338\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"></iframe>\n</div></figure>\n\n\n\n<p>Grab a slice of cake or festive beverage and give it a scroll!</p>"},
{"title": "Improvements to WordPress.org", "content": "<p>If you visit WordPress.org regularly you might have noticed some changes around the place. If you don’t, now’s the time to check them out! We’ve been working hard to improve the site to make it more useful to everyone, both developers and users, and we hope you like what we’ve done.</p>\n<h2>New Theme and Plugin Directories</h2>\n<p>Since WordPress 3.8, you’ve been enjoying improved theme management in your WordPress admin, and in WordPress 4.0 plugin management was refined. We’ve brought these experiences from your admin and re-created them right here on WordPress.org.</p>\n<h3>Theme Directory</h3>\n<p>The <a href=\"https://wordpress.org/themes/\">Theme Directory</a> has a better browsing experience, with handy tabs where you can view featured, popular, and the latest themes. As with the theme experience in your admin, you can use the feature filter to browse for just the right theme for your WordPress website.</p>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-3572\" src=\"https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory.png?resize=632%2C474&amp;ssl=1\" alt=\"theme-directory\" width=\"632\" height=\"474\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory.png?resize=1024%2C768&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory.png?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory.png?w=1318&amp;ssl=1 1318w, https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory.png?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></p>\n<p>Click on a theme to get more information about it, including shiny screenshots, ratings, and statistics.</p>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-3573\" src=\"https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory-individual.png?resize=632%2C474&amp;ssl=1\" alt=\"theme-directory-individual\" width=\"632\" height=\"474\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory-individual.png?resize=1024%2C768&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory-individual.png?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory-individual.png?w=1318&amp;ssl=1 1318w, https://i2.wp.com/wordpress.org/news/files/2015/04/theme-directory-individual.png?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></p>\n<p>Konstantin Obenland <a href=\"https://make.wordpress.org/meta/2015/03/10/new-theme-directory/\">posted a good overview</a> of everything involved with the theme directory overhaul and followed up with <a href=\"https://make.wordpress.org/meta/2015/03/31/theme-directory-stats/\">a post on improved statistics</a>.</p>\n<h3>Plugin Directory</h3>\n<p>The <a href=\"https://wordpress.org/plugins/\">Plugin Directory</a> has a brand new theme that mirrors the experience in your WordPress admin, with a more visual experience, and better search and statistics.</p>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-3594\" src=\"https://i2.wp.com/wordpress.org/news/files/2015/04/plugin-directory.png?resize=632%2C474&amp;ssl=1\" alt=\"plugin-directory\" width=\"632\" height=\"474\" srcset=\"https://i2.wp.com/wordpress.org/news/files/2015/04/plugin-directory.png?resize=1024%2C768&amp;ssl=1 1024w, https://i2.wp.com/wordpress.org/news/files/2015/04/plugin-directory.png?resize=300%2C225&amp;ssl=1 300w, https://i2.wp.com/wordpress.org/news/files/2015/04/plugin-directory.png?w=1318&amp;ssl=1 1318w, https://i2.wp.com/wordpress.org/news/files/2015/04/plugin-directory.png?w=1264&amp;ssl=1 1264w\" sizes=\"(max-width: 632px) 100vw, 632px\" data-recalc-dims=\"1\"></p>\n<p>As well as a facelift, there are some great new features for you to play around with:</p>\n<ul>\n<li>Favorites – when you’re logged in to you WordPress.org account, this page gives you direct access to the plugins that you have favorited.</li>\n<li>Beta Testing – try out plugins where developers are experimenting with new features for WordPress.</li>\n<li>Search by plugin author – you can search for a plugin author using their username.</li>\n<li>Better statistics – listings now display the number of active installs so you can see how many people are actually using a plugin.</li>\n</ul>\n<p>An <a href=\"https://make.wordpress.org/meta/2015/03/04/new-plugin-directory-theme/\">overview of the new theme</a> was posted by Scott Reilly.</p>\n<h2>Better Statistics</h2>\n<p>We’ve made huge improvements to <a href=\"https://wordpress.org/about/stats/\">our statistics</a>. This gives us more useful information about the WordPress versions people are using, their PHP version, and their MySQL version.</p>\n<p>Already these new statistics have provided us with useful insights into WordPress usage.</p>\n<ul>\n<li>More than 43% of all sites are running the latest version of WordPress. Previously, we thought only 10% of sites were up-to-date. By excluding sites that are no longer online we were able to improve these statistics.</li>\n<li>We were able to clear up the data around WordPress 3.0, bringing it more in line with expectations. This anomaly was a by-product of spammers.</li>\n<li>Only 15.9% of sites are using PHP 5.2, which is better than we thought.</li>\n</ul>\n<p>Over the coming months we’ll be able to use these statistics to bring you new tools and improvements, and to make more informed decisions across the board. Read <a href=\"https://make.wordpress.org/meta/2015/03/01/major-update-to-our-version-stats-for-php-mysql-and-wordpress/\">Andrew Nacin’s post about these changes</a> for more background.</p>\n<h2>Thanks!</h2>\n<p>Thanks to everyone who contributed to the theme directory redesign, the plugin directory refresh, and improved statistics: <a href=\"https://profiles.wordpress.org/deconf\">Alin Marcu</a>, <a href=\"https://profiles.wordpress.org/colorful-tones/\">Damon Cook</a>, <a href=\"https://profiles.wordpress.org/dd32\">Dion Hulse</a>, <a href=\"https://profiles.wordpress.org/ocean90\">Dominik Schilling</a>, <a href=\"https://profiles.wordpress.org/mj12982\">Jan Cavan Boulas</a>, <a href=\"https://profiles.wordpress.org/obenland\">Konstantin Obenland</a>, <a href=\"https://profiles.wordpress.org/BrashRebel\">Kyle Maurer</a>, <a href=\"https://profiles.wordpress.org/matveb\">Matías Ventura</a>, <a href=\"https://profiles.wordpress.org/melchoyce\">Mel Choyce</a>, <a href=\"https://profiles.wordpress.org/nataliemac\">Natalie MacLees</a>, <a href=\"https://profiles.wordpress.org/pauldewouters\">Paul de Wouters</a>, <a href=\"https://profiles.wordpress.org/samuelsidler\">Samuel Sidler</a>, <a href=\"https://profiles.wordpress.org/Otto42\">Samuel Wood (Otto)</a>, <a href=\"https://profiles.wordpress.org/coffee2code\">Scott Reilly</a>, <a href=\"https://profiles.wordpress.org/siobhan\">Siobhan McKeown</a>.</p>\n<p>If you want to help out or follow along with future WordPress.org projects, check out <a href=\"https://make.wordpress.org/\">Make WordPress</a> and our <a href=\"https://make.wordpress.org/meta/\">meta development blog</a>.</p>"},
{"title": "Welcome", "content": "<p>Welcome to the WordPress development blog. Run by WordPress itself, it will catalog what’s happening with the development. Think of it like a changelog with comments, permalinks, archives…</p>"},
{"title": "WordPress Official b2 Branch", "content": "<p>In case you missed it, <a href=\"http://cafelog.com\">Michel</a> has <a href=\"http://www.cafelog.com/index.php?p=500&amp;c=1\">announced</a> that WordPress is going to be the official b2 branch “once they get a release out.” Needless to say we are working on doing so as soon as possible. If you would be willing to <em>alpha</em> test releases in order to help us iron out some final issues please let me know in the forums.</p>"},
{"title": "Publicity and Validation", "content": "<p>Thanks to Christine for the links on <a href=\"http://www.scriptygoddess.com/\">Scriptygoddess</a> and <a href=\"http://www.bigpinkcookie.com/\">Big Pink Cookie</a>. Christine is a MT user but has been a strong supporter from day 0, she’s even on the <a href=\"/about/\">about page</a></p>\n<p>In other news the embarrassing validation errors have been taken care of. There might still be some pages on the support forums that I need to clean up, but the rest of the site should be good. Don’t be too shy to drop me an email if you notice a mistake.</p>"},
{"title": "Donncha Joins Team", "content": "<p>We are very happy to announce that <strong>Donncha O’Caoimh</strong> is the newest member of the WordPress team. <a href=\"http://blogs.linux.ie/xeer/\" title=\"Donncha's blog, Holy Shmoly!\">Donncha</a> is the developer of the very mature <a href=\"http://blogs.linux.ie/\">b2++</a> product and we will be merging the best of the two projects with Donncha’s able help.</p>"},
{"title": "Style Updates", "content": "<p>The look around here should be a little more respectable now, though there is still a long way to go, espescially with this blog. To get it where I’d like though I want to modify code and I want this to run on an unmodified version of WordPress as much as possible, so polish will come incrementally and in line with CVS commits.</p>\n<p>The <a href=\"/about/\">about page</a> has been updated, and the <a href=\"/support/\">support forum</a> is no longer formatting things oddly.</p>"},
{"title": "About Section Revamped", "content": "<p>The <a href=\"https://wordpress.org/about/\">about section</a> of the site has been completely revamped with a lot of new information. It should serve as a good introduction to what the WordPress project is about and where we hope to take it. Also new is the <a href=\"https://wordpress.org/about/testimonials/\">testimonials page</a> where you can share your own WordPress testimonial. Please let us know what you think!</p>"},
{"title": "Represent", "content": "<p>The <a href=\"https://wordpress.org/about/buttons/\">button page</a> is up and running, so grab one that suits you. If anyone feels inspired I would be interested to see some alternative ideas for the buttons, especially ones that don’t follow the Antipixel-style mold or make a creative use of the small space afforded. In return you get fame, fortune, and the cool fuzzy feeling of seeing <em>your</em> button on other sites when blog-surfing.</p>"},
{"title": "RSS Fixed", "content": "<p>This is just a quick post to let everyone know that the RSS for this development blog has been fixed. We’ve been so busy adding great features to WordPress that it must have just slipped under the radar. On that I’d like to bring this blog back to more what it was originally intended: an informal constant stream of news regarding WordPress development. Things have been quiet here but there has been a ton of progress happening. Just a quick summary:</p>\n<ul>\n<li>New options system, never edit a configuration file again.</li>\n<li>Full Blogger API and MetaWeblog API; partial MT API support (so tools like <a href=\"http://zempt.com/\">Zempt</a> work)</li>\n<li>Numerous improvements to the administration interface</li>\n</ul>\n<p>That’s just a peek. Right now I’m working on multiple category support and the last “must-have” feature before we put out the release is password-protected posts. What else? The Movable Type import is basically done, I just want to get multiple categories working first so no information is lost in the transition. There are a few other improvements underway that will most likely be in the next release, including quicktag improvements and some geographical integration but I’ll post more on that later. When? Good question, hard to say. The time we devote to the project can vary from week to week depending on, well, life. However I’m going to go out on a limb and guess that there will be a good beta out in about a week, and the release will follow after any bugs are worked out.</p>\n<p>To address the dev blog problem, I am going to at the very least post development updates every weekend, even if it’s just to say that nothing has happened.</p>"},
{"title": "Forum Fixups", "content": "<p>I fixed the forums so that now instead of the threads being unsemantic tables they are ordered lists, styled a little different than they were before. This should mean faster load times for everyone. The thread lists and such I’m inclined to leave because it really is representing tabular information, just the thread itself wasn’t.</p>\n<p>I also fixed up the character handling for the forum. It now allows a few tags (listed by the post box) and encodes everything else. This should make posting code and such much easier. Enjoy!</p>"},
{"title": "Drink the Kool-aid", "content": "<p>The entire site and much of the forum should now be XHTML 1.1, completely valid and tested. I’ve submitted the site to the <a href=\"http://www.goer.org/Markup/TheXPhiles/\">X-Philes</a>. <ins>The forums still need some work. Cursed invalid embedded markup!</ins></p>"},
{"title": "More Changes", "content": "<p>Still sprucing up the WordPress website, a little fall cleaning if you will.</p>\n<p>The forum has been improved a little more to handle some obscure character problems. I also fixed the minor bug in the last discussions list that showed the wrong number of replies. I haven’t looked at the RSS code lately, and to be truthful I don’t know if anyone even uses it, but if you do and you notice any problems let me now and I’ll take a look at it.</p>\n<p>The site is now XHTML 1.1 and is being sent with the MIME type of <code>application/xhtml+xml</code> to browsers that support it. This means we’ll have to be even more vigilant than ever against errors, but I think that’s a good thing. I’ve validated the entire site except the forums and it is all kosher. I’m working on the forums there, but there are a lot of little things that need to be fixed before it becomes XHTML 1.1.</p>\n<p>WordPress itself, incidentally, is XHTML 1.1 compliant out of the box, all you have to do is switch the DOCTYPE and you’re ready to roll. For compability reasons the default DOCTYPE is XHTML 1 Transitional, which is going to be the best choice for the vast majority of people out there. We’re realists.</p>\n<p><ins>Update: Wow, I forgot width and bgcolor aren’t around anymore in 1.1, this might take longer than I thought.</ins></p>"},
{"title": "Comments Closed", "content": "<p>After some discussion we’ve decided that the signal to noise ratio in comments on this blog tends to be high and much of the discussion that takes place here really should happen in the <a href=\"/support/\">support forums</a>, which are specifically for that purpose. Old comments will be preserved, but new comments on all entries have been closed and new entries will have comments off except in certain circumstances. Trackbacks and pingbacks will remain on though, so feel free to provide feedback through those mechanisms.</p>"},
{"title": "WordPress Wiki", "content": "<p>The brand-spanking new <a href=\"https://wiki.wordpress.org/\">WordPress wiki</a> is online and running. For those not familiar with what a wiki is it’s basically a content management system where everyone can edit all the content. It sounds chaotic but if anyone vandalizes the site it only takes a click to restore it to how it was. Wikis can be great for collecting information, and we plan to use it to develop some of the <a href=\"/docs/\">documentation</a>. So go have a look around, make a page for yourself, kick the tires. Thanks to the wp-docs group that talked me into finally getting a public wiki up.</p>"},
{"title": "Hacks Section", "content": "<p>I’ve started working on an implementation of WordPress that will be used to drive the <a href=\"https://wordpress.org/utilities/\">Hacks Section</a> of this site. Check out <a href=\"https://wordpress.org/support/10/597\">this thread in the forum</a> for a discussion of potential categories.</p>\n<p>The Hacks Section will include tested hacks that follow the <a href=\"https://wordpress.org/support/10/341\">Hack Guidelines</a>. I believe this will become a great resource for the WordPress community and encourage the development of more WordPress hacks and add-ons.</p>"},
{"title": "New Forum RSS feeds", "content": "<p><a href=\"http://alexking.org/blog/\">Alex</a> hacked the RSS functionality I wrote for the <a href=\"/support/\">support forums</a> and added a feed that shows <a href=\"https://wordpress.org/support/rss/\">the last 20 posts in any forum</a>. Also as always you can get an RSS representation of a thread by adding <code>/rss/</code> to the end of the URL or following the link at the top of every thread. Enjoy!</p>"},
{"title": "Spam: Kill it at the root", "content": "<p>\n<a href=\"http://ma.tt/\">Matt</a> and I were chatting briefly earlier today about blog comment spam, and about <a href=\"http://diveintomark.org/archives/2003/11/15/more-spam\">an article</a> that <a href=\"http://diveintomark.org/\">Mark Pilgrim</a> posted on his site. Mark is pretty pessimistic about the outlook for anti-comment-spam efforts. And he points out the great lengths to which spammers will go in order to get their spams out to where eyeballs will see them. Both usenet and email are awash with the refuse of spammers, because for some reason, <a href=\"http://spam.gunters.org/index.html?p=198&amp;c=1\">there are people out there who respond to their messages</a>.\n</p>\n<p>\nHowever, I, like <a href=\"http://www.intertwingly.net/blog/1647.html\">Sam Ruby</a>, believe that the outlook isn’t quite as grim for blogs as it has been for usenet and email. Blogs are fundamentally different in how they work and in how people use them.\n</p>\n<p>\nIt was easy for spammers to abuse <a href=\"http://networking.webopedia.com/TERM/U/USENET.html\">usenet</a>, because it is a <a href=\"http://networking.webopedia.com/TERM/S/store_and_forward.html\">store-and-forward</a> system designed specifically for distributing messages to a large number of leaf nodes. You post a message into a newsgroup, and your message is replicated around the world, on thousands of other usenet servers, viewed by millions of users. Clients and servers speak a simple protocol, <a href=\"http://www.academ.com/academ/nntp/index.html\">NNTP</a>, and though most servers these days require authentication before you can post a message, there are still open servers to be found, if you know how to look.\n</p>\n<p>\nLikewise, email is a store-and-forward system, with a method of relaying messages from one server to another. Unlike usenet, email is designed to deliver messages directly to a particluar person, which makes it slightly less efficient for reaching large numbers of users. But only slightly, because it’s quite easy to specify multiple recipients for a message. So the spammer can deliver a single message to a server, and instruct the server to deliver it to hundreds of different people. And again, many modern servers attempt to prevent unauthorized users from relaying messages, but there are still plenty of <a href=\"http://whatis.techtarget.com/definition/0,,sid9_gci782509,00.html\">vulnerable servers</a> on the internet that the spammers can find.\n</p>\n<p>\nThe relative ease and extreme low cost of reaching large numbers of consumers have made usenet and email into juicy targets for spammers. Low-hanging fruit, if you will. Spammers have also targeted other services, such as <a href=\"http://www.computercops.biz/article4094.html\">instant messaging</a> services, pagers, <a href=\"http://abclocal.go.com/kabc/features/CONSUMER/101503_fs_cell_phone_spam.html\">cell phones</a>, and more recently, blogs.\n</p>\n<p>\nObviously, I have a great interest in the problem of spam on blogs. I run <a href=\"http://dougal.gunters.org/\">multiple</a> <a href=\"http://spam.gunters.org/\">personal</a> <a href=\"http://www.gunters.org/\">blogs</a>, and I’m a developer for the <a href=\"https://wordpress.org/\">WordPress</a> blogging software. Spammers have hit my blogs on multiple occassions recently, and I delete the spam comments as soon as I become aware of them. But automating the process to some degree would certainly allow me to relax more. Fortunately, blogs are fundamentally different from usenet and email in several ways, and I think that these differences may allow us to stop this spam problem before it really gets bad. There’s still a chance for us to kill this weed at the root, before it has a chance to grow.\n</p>\n<p>\nWhy do spammers post comments on blogs? Do they really expect blog owners to leave their comments up for people to read? Do they expect people to follow their links to the spammers’ sites selling viagra and porn? Not really. What they are really after is <a href=\"http://c2.com/cgi/wiki?GoogleJuice\">search engine ranking</a>. Because the more links to their sites that a search engine sees, the better the chance that their site will come up in a list of search results. Even if you’ve deleted the original comment, it won’t matter, if a search engine has already indexed the links in the comment before you deleted it. So, <strong>one</strong> of our anti-spam tactics should be to <a href=\"http://dougal.gunters.org/spamtest/\">bust up the search engine ranking</a> for spammers links.\n</p>\n<p>\nAnd once a spammer has given us the link to his page and we see it for what it is, we can store that information in a blacklist, and use it to block future messages that try to link to that site. And if we can make a common, distributed, authenticated way to <a href=\"http://blam.sourceforge.net/\">share such blacklist info</a>, we can be pretty effective at staunching the flow of the spam. And if we can team up now, while this problem is still young, we can basically create an environment where comment spam just isn’t cost-effective for the spammers.</p>"},
{"title": "WordPress CSS Styles Competition", "content": "<p>To help grow the number of stylesheets available for the default WordPress template, we’re sponsoring a <a href=\"http://www.alexking.org/blog/2004/01/25/wordpress-css-style-competition/\">CSS Style Competition for WordPress</a> (with <strong>prizes</strong>!) through February 6, 2004.</p>\n<p>Tell your neighbors, tell your friends… get those creative juices flowing and send in your designs!</p>"},
{"title": "4 Days Left in the CSS Style Competition", "content": "<p>We’ve received a number of great entries in the <a href=\"http://www.alexking.org/blog/2004/01/25/wordpress-css-style-competition/\">CSS Style Competition</a>. Just a reminder, you have 4 more days (until Friday @ midnight PST) to get your entry in!</p>"},
{"title": "Wiki Update", "content": "<p>Everything with the Wiki has been fixed up. It actually wasn’t a problem with the wiki software we use, <a href=\"http://phpwiki.sourceforge.net/\">PHPWiki</a>, it was a glitch in <a href=\"http://turck-mmcache.sourceforge.net/\">mmcache</a>. As always, if you notice anything funky feel free to email me or post on the forums.</p>"},
{"title": "Slashdot Again", "content": "<p><strong>Welcome <a href=\"http://slashdot.org/article.pl?sid=04/05/24/1927242&amp;mode=nested&amp;tid=126&amp;tid=185&amp;tid=95\">Slashdot visitors</a></strong>, again. Can’t you guys give us a break? 😉</p>\n<p>You know the drill, some parts of the site will be static while the wave rides out.</p>"},
{"title": "Ping-o-Matic and Site Fix", "content": "<p>First off I wanted to let everyone know that the <a href=\"http://pingomatic.com\">Ping-o-Matic</a> XML-RPC interface is up and running. So to ping all those services with one fast and automatic step, follow these instructions:</p>\n<ol>\n<li>Login</li>\n<li>Go to Options → Writing</li>\n<li>Erase anything you may have in “Update Services” and just put <code>http://rpc.pingomatic.com/</code></li>\n<li>Watch how fast your posting goes</li>\n</ol>\n<p>Pinging multiple update services is often the slowest part of any blogging system’s posting, and we’ve designed the pingomatic interface to be as fast as humanly possible. Try it out.</p>\n<p>I also wanted to thank <a href=\"http://rym.waglo.com/wordpress/\">Robin Millette</a> for tracking down the CSS that was causing several versions of Mozilla and Firefox to slow to a crawl and often crash on this site. I was perplexed because the markup and CSS validated, and I couldn’t find what could be causing such a bizarre problem. Robin tracked it down to a duplicate <code>body</code> selector that wasn’t really needed so I removed it and the problem seems to have gone away. It was obviously a bug in Mozilla’s rendering engine but it seems to be fixed in the newer versions already. Mozilla bugs like this are so rare I was sure it was a problem with the site. 🙂</p>"},
{"title": "Slashdotted!", "content": "<p>All the hubbub over the new MovableType terms and people switching to WordPress has been <a href=\"http://developers.slashdot.org/developers/04/05/14/1314256.shtml?tid=149&amp;tid=185&amp;tid=99\">mentioned over on Slashdot</a>.  Welcome to all our new visitors!</p>\n<p>We’re going to deactivate the forums for a few minutes while we ride out the wave, if you check back later today they should be up.</p>"},
{"title": "Forums Growing", "content": "<p>As many of you know, the WordPress support forums have been growing by leaps and bounds lately, with over 30,000 posts and 2,000 in just the  relatively short time they’ve been available. Personally I think they’re  the best support forums on the web, but I’m biased. Anyway we tracked down  the 2,000th registrant on the forums, <a href=\"http://www.jamesbickers.com/\">James Bickers</a>, to highlight this  occasion.</p>\n<dl>\n<dt>James, could you tell us a little about yourself? (What you do, where you’re from, etc)</dt>\n<dd>I live in Louisville, KY with my wife and son and two dogs, where I work as (a) a radio DJ and producer, and (b) a freelance writer and graphic designer. In the mornings, I host the 6-9 am drive-time slot on WFPK-FM, a AAA/adult rock radio station (it’s awesome – you can listen online at <a href=\"http://www.wfpk.org\">http://www.wfpk.org</a>). I produce and host a weekly arts/culture interview show for WFPL-FM called “On Second Thought,” which is now in its sixth season (ditto about listening online – <a href=\"http://www.wfpl.org/ost.htm\">http://www.wfpl.org/ost.htm</a>). In the time that remains, I write album reviews for a Gannett newspaper, book reviews for Publisher’s Weekly, and educational stories on technology for various textbook publishers.</dd>\n<dt>How did you find WordPress? </dt>\n<dd>On <a href=\"http://opensourcecms.com\">opensourcecms.com</a>.</dd>\n<dt> What do you use or hope to use WordPress for? </dt>\n<dd>I had used Greymatter a year or so ago to run my website, but it was overdue for a complete rehaul, and GM doesn’t support categories. I absolutely love it so far – it’s got the best installer I’ve ever seen, and definitely the cleanest interface. And so far I’ve posed a few newbie questions to the forums, and got friendly answers almost immediately.</dd>\n<dt> If you could request one feature what would it be? </dt>\n<dd>Integrated photoblogging (I really love Ross Poulton’s script at <a href=\"http://www.rossp.org\">www.rossp.org</a> – it’s based on directories, is a snap to use, and has a great, clean look). Integrating an “Upload Image” field into the new post screen. But, having said that, I think it’s a remarkable program, and even if you left it just as it is today, it’s going to be valuable for years to come. </dd>\n</dl>\n<p>Many thanks to James for joining the WordPress community and also for putting up with this interview. 🙂</p>"},
{"title": "Swat Team", "content": "<p>I’ve set up bug tracking software at <a href=\"https://mosquito.wordpress.org/\">https://mosquito.wordpress.org/</a> and already people have begun to sign up. There is a lot of work that needs to be done to get the bug tracker up to WordPress standards, but the process has begun.</p>"},
{"title": "Color Contest", "content": "<p>Over at my site I’m running a <a href=\"http://ma.tt/2004/07/color-schemes/\">small contest for people to create alternative color schemes</a> for the administration interface. When it’s done I’ll pick a few winners and package everything up in a plugin you can use to spice up your administration a bit. If you have a few free minutes try your hand at it. There will be a few prizes for the winners, including a copy of <a href=\"http://www.colorschemer.com/download.html\">Color Schemer Studio</a>.</p>"},
{"title": "Firefox 1.0 Gold", "content": "<p>\nAnd in other news… <a href=\"http://www.mozilla.org/products/firefox/\">Firefox 1.0</a> is now gold. The Mozilla sites are swamped right now, so I’ve currently got a <a href=\"http://dougal.gunters.org/Firefox%20Setup%201.0.exe.torrent\">torrent</a> of the US English version for Windows going. Download some fresh, hot browser goodness, and don’t forget to <a href=\"http://spreadfirefox.com/community/?q=affiliates&amp;id=2490&amp;t=1\">spread the word</a>.\n</p>\n<p>\nIf you don’t already have a <a href=\"http://bittorrent.com/\">BitTorrent</a> client, try <a href=\"http://bittornado.com/\">BitTornado</a>.</p>"},
{"title": "The WordPress Plugin Repository", "content": "<p>We are proud to announce <a href=\"http://dev.wp-plugins.org\">wp-plugins.org</a>, the WordPress Plugin repository. A need was felt for a set of common tools, and a common playground for developers creating plugins and themes to extend WordPress. WP-Plugins.org seeks to fill the gap by providing <a href=\"http://dev.wp-plugins.org/wiki/AboutHosting\">stable and reliable hosting</a>, complete with <a href=\"http://dev.wp-plugins.org/wiki/VersionControl\">version control</a>, an <a href=\"http://dev.wp-plugins.org/wiki/TracTickets\">issue tracker</a>, and wiki to the developers, absolutely free.</p>\n<p>All of the <a href=\"http://dev.wp-plugins.org/\">Plugin Repository</a> is powered by <a href=\"http://trac.edgewall.com/\">Trac</a> – an integrated SCM (Source Control Management) and project management tool. Version control is provided using <a href=\"http://subversion.tigris.org/\">Subversion</a>. Subversion is the source management tool WordPress itself will be using after the 1.5 release.</p>\n<p><strong>Developers</strong> can:</p>\n<ul>\n<li>Host their development for <strong>free</strong></li>\n<li>Be assured of <strong>high visibility</strong> </li>\n<li><strong>Manage their code</strong> using an <a href=\"http://subversion.tigris.org/project_links.html\">SVN client</a></li>\n<li><strong>Track issues</strong> (bugs) using the <a href=\"http://dev.wp-plugins.org/wiki/TracTickets\">tracker</a></li>\n<li><strong>Provide documentation</strong> using the <a href=\"http://dev.wp-plugins.org/wiki\">wiki</a> with the help of end-users.</li>\n</ul>\n<p><strong>WordPress Users</strong> can:</p>\n<ul>\n<li><a href=\"http://dev.wp-plugins.org/browser/\"><strong>Browse</strong></a> all the plugins and themes.</li>\n<li><strong>Download</strong> plugins and themes from one location.</li>\n<li><strong>Provide feedback</strong> to plugin developers using the tracker.<br>\nHelp improve the plugin or theme.</li>\n<li>Develop documentation at the wiki page for the plugins they use.</li>\n<li>Stay in the the loop using the <a href=\"http://dev.wp-plugins.org/wiki/TracRss\">RSS feeds</a>.</li>\n</ul>\n<p>If you have developed plugins or themes for WordPress, or if you are engaged in the process, we strongly urge you to check it in to this community resource. <a href=\"http://dev.wp-plugins.org/wiki/GetHosted\">Get hosted</a> — a simple email is all it takes to get started. Things have been <a href=\"http://dev.wp-plugins.org/timeline\">busy</a> in the few weeks the service has been around and in testing. About <a href=\"http://svn.wp-plugins.org/\">60 plugins</a> have already been checked in by their developers. Checking in your plugin or theme is the best way to expose your plugin to a vast cross-section of WordPress users, without having to worry about bandwidth. It also makes it much easier to collaborate with other developers, should you choose to.</p>\n<p>At this point the Plugin Repository is mainly aimed at developers and more savvy users, but if you can find your way around the interface it will prove a very powerful resource. Trac makes it simple to <a href=\"http://dev.wp-plugins.org/wiki/TracBrowser\">browse the plugins</a> and download the latest version, and if the interest that has been shown so far by the WordPress hacker community is any indication, the repository is where the action is gonna be. So regardless of whether you are a developer or an end-user, <a href=\"http://dev.wp-plugins.org\">check it out now</a>.</p>\n<p>That said, we plan to create a friendlier front-end to the repository aimed specifically at new users in the coming months, stay tuned.</p>"},
{"title": "Mailing Lists Down", "content": "<p>Just a quick note to say the <a href=\"https://codex.wordpress.org/Mailing_Lists\">WordPress discussion lists</a> will be down for a few more hours while we transition the archives and subscriptions from the old system to the new one. When everything is back to normal we’ll update this post.</p>\n<p>I hope everyone is enjoying the holidays as much as we are. 🙂</p>"},
{"title": "WordPress Hosting", "content": "<p>It seems like every few days a post comes up on the support forums about hosting — people asking for recommendations, talking about problems, or sharing advice. Where your blog lives is really central to your WordPress experience, and for a long time we’ve wanted to highlight some excellent resources to consider next time you’re considering a web host. On our new <a href=\"https://wordpress.org/hosting/\">web hosting</a> page we try to do just that, pointing you in the direction of some people we think are swell. Better yet, some of the hosts on that page donate back to WordPress, so you can support WordPress by patronizing them. There is more information about everything on the <a href=\"https://wordpress.org/hosting/\">web host page</a>, including a place to send feedback if you have any. Happy hosting!</p>"}
]